{"pageData":{"data":[null,"W itch’s Grave  Copyright © J. Bennington, 201 8  Cover design by   nishagandhi_99041  See more covers by this artist at   https://selfpubbookcovers.com /nishagandhi_99041  Robin Kirby and   Ariel   Wright wove through the   dense   crowd in   squashing   humidity.  Being jos tled by obese and sweaty patrons would   usu ally annoy them to   silent  condemnation and   early d eparture . However,   the State Employees Free   Admission  Night   at the   Delaware   State Fair   w as   the one extravaganza that   filtered   out   a ll th e bad  and stroked the pleasu re sensors to enjoy, forgive ,   and ignore all   negatives.  “What do you think, Robin?   Is this a greater   attendance than last year? I don’t ever  recall so many people before.”  Robin shook her head and felt her straight raven hair   settle   back. The hair annoyed  her because   she had few options   for   a different style . She could   cut it, put it in a   ponytail ,  or add color highlights , and that was her limit . It   defied all attempts at   curling and  wagged its hair   tongue at professional perms.  “Neither do I, but I’d pay a n extra $5 for admission if half the crowd was turned  away at the gates. Like wow!   Like yuck!   I wish I were   a porcupine for   at least long  enough to clear a path t o the Cotton Candy Booth , l ike yum, folks. Excuse me . Pardon  me.   Did   that hurt? My bad, now mo ve   out of my way. ”  She batted her bright blue eyes for added   emphasis .  Ariel laughed and patted her cheeks.   “That sounds like you,   and   don’t worry, girl.  I’ve got your back o n   that one.”  They   reached   their goal , munched on the sweet cotton strands,   and hea ded   to   their  last stop   for t he   night, the fortune teller booth, where Sister Stella   was   reported   to give  some   excellent   and accurate   readings   about   the future from her crystal ball. Word   of her  skill   spread   fast   when   two   positive   incidents happened the day   after the   predictions .  S tella   was   n ew   to the   recent   carnival.   The former   fortune   teller, Sister   Grace,   the  anchor medium   for   ten   years ,   died after standing too close to the lion’s cage and being  devoured after   being   ripped to shreds.   The fatal error   happe ned while the carnival was  on a train ,   and the car holding Rexus   the Killer   Lion   was locked, all three doors, yet  Grace was mauled and eaten .  Authorities never   determined   why or how   the incident happened. However,   two  days later, while setting up without   a   fortune teller booth , Sister Stella appeared seeking  employment.   The news of Grace’s death disturbed her ,   and she   wanted to take her place  to   help   the Golden Helmet Carnival. She told the management what   happened and what  clothes Grace wore when Fate sett led its account with   her. She   was hired with   no  background   investigation. Sometimes ,   fellow workers worried and wondered a bou t her ","3 AUDIOBOOK COLLECTIONS 6 BOOK COLLECTIONS ","ability   to tell the truth   and make accurate predictions. However,   no one challenged   her,  and she became popular so   quickly   wi th   her clients   that her longevity was assured by  management.   After that, rumors   and questions   ceased, and praise commenced.  Even though it was near closing time, her tent was busy , and   Stella   had   Ariel   hold a  sign alerting the crowd that she was the last t o enter . That deterred   a   few ,   and   people  tried to cut into the line and take the sign from her.  “Go   away! Leave me   alone!\"   Ariel   slapped the   last man ’s hand   somewhat   hard .  He blasted her with an insulting name and stomped away, threatening her, Sister  Stel la, and the carnival with   punitive   lawsuits   for his lost fortunes .  Then they were   inside   the   comfortable, inviting   atmosphere   and Sister Stella   looked  poised and ready   to use her talents for their benefit .  “Welcome, you two   beautiful   ladies. Please approac h my table and be seated.”  Robin did a hasty evaluation of her face and upper body that was   visible,   and the  results pleased her , bu t   she still   had to ask.  “How do you work such long hours and   remain calm and collected?”  “Because I live right,   my dear, and   I seem to be blessed with supernatural stamina.  Otherwise, I’d give in and curl up in a ball beside the one on the table ,   and people could  not tell us apart.”  Ariel’s brow wrinkled.   “Huh?”  “That’s a funny expression   on your face .   Almost had you there. At   least I made you  think. Thanks for entertaining me. Now then, which one of you wants to have your  fortune told?   One   of you doesn’t   strongly believe in me ,   so   I need   the guilty party   to  confess .   Don’t make me break out the rubber hose and   learn   the   painful   way.”  “You’re strange, Stella, but you’re right. I’m your customer ,   and   Ariel   is my sidekick  for tonight. I’m curious. She’s not. I’m brave. She’s not unless she’s standing behind  me.”  Ariel ’s temper   flared,   and she flashed   Robin   a harsh stare   as red - paint ed nails ran  through her curly blonde   hair. “ You can stop now!   I can be what I am without you r  announcement   to the world!”  Sister Stella clasped her hands   before her shiny bluish crystal ball and ignored  Ariel’s   huff.  She held Robin’s attention with pierci ng eyes.   “Okay, young lady,   what is   your  name?”  “Robin Kirby, I want   you to tell me   my future. I want to discover something about  me or my family that   has remained   hidden.   I don’t want it handed to me on a silver  platter. Easy things are   too comfortable fo r   me   and ,   therefore,   meaningless. I learn with  more satisfaction if I do it the hard way or at least   in   a semi - difficult   way. D id I make  sense with that explanation ?”  “Yes.   You mean   you talk a lot to say a little.   However,   I enjoy people like you as my  las t customer of the day.”  She unclasped her hands and lay them palm up, one on each side of her ball on the  green velvet mat.  “ It’s up to you to   expose your desire for knowledge , Miss Robin Kirby. Lay your  hands on mine ,   and we’ll   commence .”  Robin grinned an d lay her   young   hands on top of Stella’s dark   ones .  On contact,   the room lights extinguished . Simultaneously ,   a light from the ceiling  spotlighted it . ","The coordination and effects pleased Robin.   “Awesome .”  Stella squeezed her hands   hard .   “Silence !   I see yo u r life has been   quiet until now.  But t hat’s about to change.   First, y ou   must   go to   Denton ,   Maryland,   and stay   until you  cannot avoid the mystery   and destiny   waiting for you. You appear to be   brash   now , but  what you will learn will   shock and   sober you.   How ever,   I d are   to say   before your  learning adventure is complete, you’ll wish you had never ente red my tent tonight   or  sought knowledge of   things hidden . Some things   should   be accepted   without   knowing  why , and   other s should never be sought for   knowledge alon e . ”  Robin gasped ,   and a blue spark of electricity jumped   upward   from the ball   and  shattered the spotlight bulb.   She jerked her hands free as glass   shards   dropped around  the tabletop .  Stella   squealed ,   shook her hands , and   sat back in her   chair   hard enough t o cause it  to tip and fall .   The wild attempt at recovery only served to dump her onto the floor in a  heap.  Three   tiny   snakes emerged from the globe, faced Robin ,   and stopped when they  were   two feet   long. They writhed and tried to reach her .  She tried to sh ut out their clear   voices but   could not   succeed .  “I’m the vampire snake. I want your blood.”  “I’m the viper snake. You’ll not live long after my bite.”  “I’m the varicose snake. I’ll clot your body and spirit . They will twist and fuse  together   until   you’re   not recognizable ,   and   salvation is impossible.   That’s my specialty ,  and I LOVE doing that to any Kirby   I encounter .   You’re all worthless bitches and  bastards to me! ”  They each disappeared in a   black, sour - smelling   vapor , with an   increasing gong  sound for e ach one.  “Did you have to be so extravagant and theatrical?” she asked.  Stella   stood, righted her chair, and   gl ared   tongues of fire   at   her .  “That wasn’t planned, Miss Kirby !   That was Karma showing its glee in helping you  along this path.   Please give me $5   and go away !   I was happy not   having   customers for  the reminder of the evening.   Pay and depart my presence!   I’ve had quite enough of you! ”  “You didn’t tell me what I’ll learn.   That’s the deal I wanted and bargained for.”  “I   can’t tell you that !   That part of   it is reserved for you and you alone. Pay up for my  services and go   with your unimpressive intelligence   and babbling nonsense !   You won’t  be this way   long !   Denton, Maryland ,   will wipe the smart ass from your life! ”  Ariel   had remained immobile but not   throu gh desire. She knew   what   had   happened  between Stella and Robin   and finally   found her voice and let it go.  “Hey, Robin !   Stop it !   Pay her ,   and let’s get   the hell   out of here. You asked. She  delivered. It’s not her fault   you don’t understand or like the resul ts.”  “That’s not the problem! Never   mind, I   don’t feel like fighting anymore tonight. It’s  my fault ,   so I’ll pay!”  She   opened her purse and la id   a bill on the table. “Here you go. I won’t join the  crowd who speaks ill of you, but you’ve disappointed me ton ight. I thought better of you.  Come along,   Ariel . We’re overdue leaving.”  “You don’t have to be rude .   Sorry, Stella. She gets like this when she can’t have  everything go her way.”  “That’s got nothing to do with it!   She’s all bogus tonight!   No one in my fam ily has  ever lived in or near Denton, Maryland! I don’t   even   know where it is   other than people ","mention ing   it in passing,   and I don’t want to know! I thought my fortune or future  would be tol d ,   and it wasn’t. So, I paid you for   nothing. I could have used t he money for  a coffee and   a bagel   in the morning. Thanks, Stella. Let’s go,   Ariel .”  Stella picked up the bill   with a   smile and   tucked it inside her dress pocket. “Thanks,  Robin. I told   you   about   your future   as far as I   can,   a nd you won’t like it. You may e nd up  with a fortune, but you’l l pay a   dreadful   price   to acquire it . Goodnight ,   and have  pleasant dreams while you can. ”  *  Robin walked into Billy’s Donut Delight, where the ‘o’ was a   photo of a   blueberry  cake   donut, and   waited her turn   in line .   W hen she   reached the counter,   she remember ed  she   had spent   her last bill with Sister Stella.  “ Oh, bother and a half!   N o cash and no ATM   here . ”   She looked helpless   to maybe  play on the cashier’s sympathy .  “Can I use my debit card?   Please?   I spent my last cash on my   future in the State Fair  last night ,   and I’ve not had the time to prepare   for the day .”  “Sister Stella got you, huh?   Did she say, ‘ Give me a fiver and get out? ’   Well, Billy’s  got you covered , sweetie.   New technology makes it possible for you to do that. Y ou’ll just  have to pay $ . 60 extra for the low transaction   fee .”  “No problem.   Thanks so much.   Billy’s okay .   Stella ’s   not okay.”  “ So,   I’ve heard.”  Robin paid for her coffee and   Old - Fashioned Glazed Cake Donuts and chose to sit  and enjoy them in the shop inst ead of   driving. She sipped the coffee with a sigh and  broke off a piece of donut with her fingers.  A strange man stopped beside her.  “Excuse me,   miss.   I couldn’t help hearing about Sister Stella. Do you believe in  fortunes and futures   so   much that you   spen d money on her   prattle ?”  “ In   general, I   do, but last night   ruined my faith . It was very generic and   sounded   like  a   cold   bologna sandwich   waiting to be bitten . Why? Don’t you?”  “No, but I believe in my hurting goldfish. The cat bit him last night and wiped   out  his tail.   As a result, h e’s hav ing   great difficulty swimming until it grows back. Would you  contribute some money to help pay his medical bills?”  Robin frowned and shook her head. “No. Save yourself some money , feed the rest of  the goldfish to your cat   as dessert,   and get over it. You’re just as strange as Sister Stella.”  He snapped his fingers.   “Except you paid her for nothing. Never min d. The scam  didn’t work   on   you.” He raised an invisible glass in a toast. “To your oh, so   lousy   future  as   the clever   Sister Stella predicted .   Puffers and   Toodles , worthless trash that you are. ”  Robin watched him walk out the door ,   and the cashier stopped in his place.  “Was everything satis factory today,   m iss?”  “Yes, do you know that man who stopped at my table? I mean ,   t he one who just left?  The tall man in the brown   pinstripe   suit?”  She scratched her belly button.   “No ,   m iss. We   haven’t had any customers like that  this morning. Are you sure of it?”  Robin stood and tried to find him in the parking   lot but   failed to   locate   him.  “Never mind. I’m sorry to waste your time. ”  “You didn’t. I’m still getting paid.” ","“Well ,   have a nice day. I’ll dispose of the waste for you and catch you tomorrow   if  you’re still employed .”  She left the building and cursed at an advertisement stuck un der the wiper   blade   on  the driver’s side   of her car . She   snatched it free and   cursed again   when she scanned the  ad.   She threw it on the ground and stomped on it. She glanced around to see if other  cars held the same thing ,   but   none did.  “ Why o nly my car? T hat’s not right.   Thanks, whoever did it, you little prick.   I hope  your nuts shrivel up   to the size of bbs ! ”  She unlocked   her doors   with the remote tag , picked up the advertisement,   and sat  behind the wheel.  “Now I know wh y I was so uneasy   when he stood bes ide me. His actions made me  recall an undertaker   I   dealt   with in Harrington before. I wonder if he was ,   and   was   that  why he   chose only   my car to advertise?   Do they support each other? ”  She read the entire brochure   and could not find a person’s name.   It adv ertised a   sale  on cemetery plots in the Denton Cemetery ,   Denton, Maryland,   a nd   a phone number .  Someone scribbled the message   on the back in a blank white space , “Buy one, Robin.  You’ll need it sooner than you think.”  She folded it and tapped it against the   steering wheel.   “ Stella, are you screwing with  my mind from   a   long   distance ? Will you keep it   up   until I’m jittery enough to pay you  off? I s that part of your fortune in my   future?   Did you hypnotize me   and learn things I  didn’t want   to share with you ? ”  Wi th a nervous sigh, she laid it on the seat beside her   and   drove to work.  *  She shook off the jittery feeling and   processed Motor Fuels Tax   Permits   until   almost  noon before Josie approached her.  “Do you want to sign   this card for   Paula ?   Her   hubby   died las t night . ”  “Aw ,   man. That’s rough.”   Robin took the card and read it inside and out. “How old  was he?”  “Twenty - two.   He was   two   years younger than her. ”  “Bummer . ” Robin picked up her pen.  Josie lay   a hand on her shoulder.   “Several girls said that   same thing .   I say   the  asshole   deserved   to die.   He   overdosed   on Oxycodone. Popped   twenty - two   of them for  his birthday party.   Dumb ass! Left a wife, a kid, and one on the way,   and no income for  them   other than this job . And no,   the   insurance won’t pay up for suicide.   So ,   s he’s   alone  and at the mercy of every money - grabber waiting to make a   quick buck. ”  “ That sucks   for Paula.” Robin returned her pen and closed the card. “Is there a  collection going on,   wanted or not?”  “Yes.   Do y ou want to contribute?”  “I do, but I’ll have   to catch yo u after lunch. I need to   hit an ATM   first .   I didn’t have  time this morning. The fair drained my wallet last night.”  “Been there, done that. It won’t go to her until tomorrow. You can   catch   me this  afternoon. Thanks, Robin.”  “You’re welcome. Whe re’s he   going to be   buried?”  “In the Denton Cemetery. I didn’t know   until   this morning that she commutes from  there daily. That’s quite a haul for her.” ","Robin grimaced and nodded. “I agree, but   you take what you can get in this  economy . Maybe her luck will   turn   around,   and she’ll get a job closer to home.”  Josie   left   her,   and she sat gazing at the monitors on her desk without moving. “This  is too weird for me. All this   concentration   about Denton? I don’t think so , Sister Stella  and all the spirits who work   with her .   My   ancestors settled in the Dover , Wilmington,  and   Newark areas. There were no Marylanders in the Kirby   Family   history. So there,  Stella. Opting out of the   burial   is   allowed,   and I’ll do it.”  *  She   donated some money   for Paula and opted out of   the funeral two days later, and  no negative remark was made.  She   longed for a break from her routine   and watched the news on Friday night to  check the weather forecast for the weekend. She   need ed to relax   at   the beach and   hoped  bikini weather would be the   norm . Before the weather came on, though, she sat   upon  the   sofa's edge   and watched black smoke billowing into the sky from a gasoline truck  that   explo ded   on Route 404 near the Denton, Maryland exit.   The   driver was   killed   in the  crash ,   and the investigatio n continued . However,   nothing indicated why the truck  crashed   and   when and where it did.  Robin felt chilled and rubbed her arms.  “It crashed there ,   so I would hear about it on the news.   Listen to me, Stella, w hat  part of I’m not going to Denton, Maryland ,   don’t you get? I don’t care if   it’s   my future or  my fortune. I’m not going to Denton!”  *  Three weeks later,   Ariel   called her at home. “You won’t believe what just happened,  Robin! Some   wild entrepreneur   company   has opened   a hotel and casino in Denton,  Ma ryland !   They sent me reservations for two and a n   $800 coupon for slot machines or  Blackjack gambling for promotional purposes ! Wahoo! And since I’m single   and not  dating , I   immediately thought of you . Do you want me to go with you? I mean you go  with   me.   D o you want to? Do I sound excited? I don’t win anything, ever!   But I   won   this  time   without trying ! Wahoo! ”  “Denton, Maryland, huh? Now that’s damned convenient if you ask me.   All’s been  quiet on that front ,   and now you’re kicking it off again. Thanks,   Arie l .”  “Oh, now I get it.   So,   y ou   think this   freebie for   me   and the invite   is   all going back to  Sister Stella’s fortune   from the State Fair, don’t you?”  “It was thrown in my face   quite   often   after that night and then nothing for three  weeks. Now   you’re triple   excited to go to Denton and take me with you . ”  “So,   does that mean   you’ll go with me? You know I can’t stand driving alone for long  distance s . You can take some books and read   and relax   in the hotel room.   On the other  hand,   I’ll give you some money to sta rt you off on the   slots,   and you might win some  jackpots and have some fun. Are you in?   Pretty please,   sweetie? Just say yes and make  us both happy.   You’ll be okay. I promise you and cross my heart. ”  “I give up.   I’m in.   Are   we   going this   weekend?” ","“That’s   the plan. I’ve put in for vacation on Friday and plan on a   three - day weekend.  Do you   want to try the same thing tomorrow? That   way,   we can hit it together.   I can't  wait.”  “I can   wait , but right now ,   some adventure sounds great. Maybe some millionaire  will   notice me and want me to be his showpiece. If he does, I’m   in,   and you can   meander  back to Seaford alone. I’ve got faith in   you, even if it takes you a week.”  “I’m glad you do.”  “I’ll talk with B randy   tomorrow morning and let you know.”  She   laid   the phone   down , filled a glass with tea,   and walked downstairs to sit on a  patio   designed for the apartment dwellers   to share. She chose a table , sat in the quiet  area, and relaxed until a neighbor approached her as quietly   as a cat and touched her  shoulder.  “Hello ,   Robin. ”  She   yelped ,   recovered ,   and patted her chest   to calm her wildly beating heart .  “Hello, Rachel , you evil ghost . What’s going on?   You scared the crap out of me!”  “The sight of you sitting   alone   and looking   sad   motivated me.   May I join you in your  sol itude?”  “Sure thing. Pull up a chair and participate in my Quaker Church Meeting. Do you  believe in fortune tellers?”  “Can I talk?”  “You can. The meeting is over. Do you?”  “No , I don’t.   T here’s something to them, but they’re not gods , demigods,   or seers  in to the future . I think they fish for answers and then ask questions,   quite   certain how  you’ll respond . They   are   swift   at   deciphering   human behavior and psychology, but   that’s  about it, other than   the capability to   put on a   display   of   good   charm and profess ional  bull shit. Why   do you ask? Do you have one bugging you?”  “ Well,   I’ve not seen her since the fair left, but it seems I’m bugging   me . She said I  must   go to Denton, Maryland ,   and   that’s all I can see or hear about for a time . Had a  small break ,   and now   Ariel   gets a free weekend   at   a hotel and a stake for slot machine  play in   Denton's new casino . I’m getting on my nerves   and   don’t know how to stop it.”  “ So, she’s using your own mind to mess with you.   She planted a seed and hit on  something you   love,   and y ou can’t stop thinking about it.   Try going to New York City  instead . That’s north and a long way from Denton. Th ere’s a bus trip through Dawson  Tours this weekend   with   five   open seats. Have you been   to   Manhattan   before ?”  “No , and no thanks . I’d be lost.”  “ That won't happen with   me around. I love that city. No matter what you want to do,  you can do it at any hour   during   the day or   night, e ven   if it’s illegal.”  “I’m not   sure about that.”  “Oh, come on , Robin! Live a little before you grow old.   You’ll have fun ,   and I  promise that   you’ll never have time to recall that Denton is even a part of the world if  you hang with me . I party like I’m on speed in that city.   I l ove it!”  “Well, you’ve convinced me , but I’ve already committed   to   the Casino   with Ariel .  Remind me   if you go   again   and I’ll go with you   then . Sorry.”  “That’s fine with me, but I think you’ll be sorry you didn’t go this time. Anyway,  what’s on for the rest of the night?”  “I’ ve   started researching my   ancestry ,   and I think I’ll work on that unless you hav e a  better offer.” ","“How about   having   dinner with me? I’m doing hamburgers, baked Mac and Cheese,  and broccoli for the kids .   Of course, you'll be filled with a desire to be bored by your  ancestors between the food and the kids who will give you stimulating   conversation and  energy . Does that sound   first - rate ?”  “Sold.”  *  She relaxed after the dinner and missed the noise level of Rachel’s children and the  stimulating ,   honest   discussions. She turned   h er   computer   on ,   opened the tree program ,  and logged into the   website.   She groaned   because   it did   not maintain her last search .  She   typed in the information on her parents and grandparents ,   hit search ,   and cracked  her knuckles as she waited.   Her mouth hung open twenty minutes later ,   and she stared  at the screen.  “ Wh at?   Where did you come from? I don’t recall you being there   the last time .” She  jotted down the information   on a notepad   and switched to vital statistics for Maryland ,  and she found the woman she would swear was not on the tree before. However, she  read it   on the screen   again   and felt weak and sick.  {{MARK family name?}} “ Cherie   Pandora Waterman ,   born January 25, 1882,   in  Denton, Maryland.   Mother,   Shannon   Evelyn Dudley - Waterman . Father,   Har vey Joseph  Waterman.   Cherie was delivered   at home , and the birth   was   re ported   to Vital Statistics  by   the   father on January 28, 1882.”  “Son - of - a - gun! I don’t believe it! I know for certain that entry has never been there  before! No way in hell!   How can she be my great - grandmother, and I only find that out  now? Wrong! If you ’re messing with me, Stella, I’ll track you down and feed you to Rex  after beating the crap out of you! ”  She shivered as if she   had   left a window open in winter, erased all the names ,   and  started over.   Twenty minutes   later,   she   was breathless and   gave in t o   Cherie being   on  the screen again.  “I see it, but I don’t believe it, but I guess we must.   And I know   my mind did NOT  manufacture this   to mess with me. It’s   scary   and downright frightening, but I didn’t  cause it to happen.   Wonder when and where she died a nd where she’s buried?”  She   jotted   some more notes and questions ,   shut the computer   off ,   and stretched to  relieve pressure on her back.  “Well, I guess that cinches where I go this weekend. I’d rather go to New York, but  I’ll go to Denton with   Ariel . Are yo u happy now, Karma and Stella?   I   want   to smack you  both with a big hard stick,   but I’m the one who opened my mouth.”  *  Robin and Ariel set off for Denton, Maryland, at nine o'clock Friday morning .   Robin  drove ;   Ariel   rode shotgun and babbled about how she   would cast a spell on the slot  machines , how many jackpots she would win,   and what she would do with her   winnings .  Finding a quality boyfriend   remained   the   number one task after   securing riches .  “What will you do with your   winnings, Robin?” ","“Oh, something   useful. I’ll wait until you have your quality   man,   and then I’ll take  him from you and marry him like you don’t want to. And we’ll send you Christmas cards  with   children 's   photos every   year, so   you can remember how you almost had it made.”  “You prick. Som etimes ,   I don’t know why I keep hanging out with you. I swear. You  prick.”  Robin grinned and slapped the wheel. “But I’m a cute and faithful little prick, so you  have to love me. Right?”  “Right, and I will until something better comes along. So there.”  *  They checked into the   hotel,   and   Ariel   was excited about starting h er gambling  spree.  “What are you   going to do first , Robin ?”  Robin jumped on one of the beds and flopped around. “First thing ,   I’ll nap like I  can’t at the office.   Afterward,   I’ll take a   st roll on the   boardwalk.   I can’t believe the casino  built   one   along the river . F ind a greasy dive for some decadent fries, then sit on a bench  and display my   attractive   body for any available man   to notice .”  “Sounds like a winner to me.   Look me up   in the cas ino ,   and I’ll join you for that  outing.”  “Ten - four, good   buddy.”  Robin saluted   her,   got comfortable without   undressing, and   slept before   Ariel   closed  the door.  And she dreamed:  She drove the streets of Denton, looking for clues to her roots ,   and stopped b y the  cemetery. She never made it inside the entrance before she   slammed on the brakes.   A  tall man dressed in black stood in the middle of the road, holding a huge chef’s knife  that dripped blood   and made a bone - chilling sound as it scraped across a   sharpe ning  stone in his other hand.  “Come on ,   Robin.   I’ve been waiting for you. ”  Scrape, scrape,   scratch .  “ Let me a dd your blood to the pool. There’s always room for more of th at   delightful  red juice.”  S he screamed ,   jerked the gear shift into reverse ,   and hit th e gas.  The car did not move ,   and   she scrambled out the door , panicking to flee from him at  full speed .  “Come on, curious bitch .   Do y ou want to open Pandora’s Box? It’s waiting for you  here ,   and so am I. I’m inside ,   and when you succeed, I’ll cut you ,   and y ou’ll bleed   out  faster than you can breath e , but you’ll never scream   as   you   wish .”  He laughed and swished the knife around before him. “Come on, curious bitch. Let  our first date be the   best and the   last.”  She ran ,   her lungs ached for more   air,   and she hea rd him close behind her. She saw  a family at a picnic table in the distance   and   screamed for help as best she could.  She stumbled and fell face down on the pavement when the sharpening stone  cracked her skull. She remembered being picked up with one hand a nd   laid   on the  tabletop   with cups and plates scattering and breaking with her body’s impact. She ","screamed and opened her eyes ,   and all around her sat a family of vampires, smiling with  anticipated pleasure.  She screamed as the father moved his face toward   her neck to take the first drink of  her blood.  She   awoke   from a violent spasm   when she   fell from the bed   in   a flash of lightning  and a clap of thunder that shook the   whole building . She swore it demolished half of the  building , crossed the floor with catl ike steps to pull open the curtains with trembling  hands,   and felt   a wave of   rel ief at the sunshine and people strolling   on the b oardwalk by  the river .  Then she dropped them and stepped back as she saw his face   hovering   over the  water   on a brown stem with   dead leaves .  “Oh, and if you’re   intrigued by me , once you join me, I can cut you as many times as  I   want,   and you can’t stop me or die.   Doesn’t that sound like fun? We all need a pet to  torture.   You’re mine, curious bitch.”  She turned with   the intent   of ru nning to the bathroom and fell when she saw him  standing in front of the door, still wielding the huge knife   that was even bloodier .  “Going somewhere , girlie ?   You didn’t wait for Ozias to say you could go pee.  Naughty girl.   You do nothing without my permis sion. ”  Her wide eyes still stared at the dripping knife and the   blood pooling on the floor at  his feet.  “Yeah , tenderhearted me   cut up a few boardwalkers on the way to the hotel. I had  the urge to practice so I could   cut   you better.”  He lunged forward ,   and   she fainted.  *  “Hey, sweetheart. Are you okay? Hey, girl. Wake up. What happened? Are you  pregnant?”  Robin opened her eyes to see   Ariel   sitting beside her ,   and the pregnant question  snapped her back to reality.  “What? Pregnant? No   way, girlfriend.   What   happened?”  “You’ll have to tell me. Looks like you missed your fries,   walk, and   body  advertisement. What happened?”  She sighed and struggled until she sat.  “It started with a nightmare and ended when the same figure st ood   before the  bathroom door with a kn ife ,   and he tried to cut me. That’s when I hit the floor   in a  faint .”  “Is this coming from Stella’s prediction?”  “I think so.   This isn’t my normal   state, and it’s getting me exasperated . Of   course,  you know that without asking.”  “ The   friend   side of me need s to say this :   you need to talk with someone about it and  what’s happening to you.   I'd recommend a priest or maybe   a psychologist.   Otherwise ,  latch onto   anyone   in authority   whom   you trust and talk it out. I don’t want to see you  dead or sitting immobile an d drooling from drugs to keep you alive and little else.”  “I’m not trying to worry you, but it’s starting to worry me. I   promise I’ll do that as  soon as we   return   to Seaford .   But, m an, that scared me. ” ","She checked the time on the clock radio and shook her   head. “I missed a lot today.  I’ll do lunch and drive around all   six   blocks of historic Denton ,   and I think I’ll feel better.  I’ll do the boardwalk tomorrow morning or later this evening and watch the sunset.”  “That sounds   wonderful , but yo u need to shower   first. I’ll wait for you ,   and we’ll  have   lunch together.”  *  The lunch was fabulous ,   and afterward ,   Robin spent   a half hour   playing the slot  machines with   the   $25 that   Ariel   gave her. She won   four   $100 jackpots and one for  $1270 ,   which   excited her.   Ariel   joined   her to cash in her winning tickets ,   and she put the  money in her purse and left the casino to drive as she   planned .  Denton   proved to be   larger than six blocks, but according to the map from a  convenience store, she covered all the streets of import ance and saw a sign for Oil City.  With visions of refineries ,   many   oil   storage tanks,   and smoking towers, she followed the  signs and found an upscale housing are a   instead of an industrial area. She admired the  houses   and   the   area for   twenty   minutes before   returning   to   Denton   and the hotel. Her  route took her   past   the Denton Cemetery. She waved a timid hello to Paula’s husband ,  entered   the   deserted   place ,   and stopped beside the only building she saw. It   proved to be  the office/administration building ,   and sh e tried both doors and gave it up for being  closed. She read a small   placard   on the door above the lock and called a number for  assistance.  “Hello, this is Roxana Perkins, secretary   of   the Denton Cemetery. How may I help  you   on   this   delightful   Denton day ?   Do you wish to purchase a   pl ot   for the burial ? Do you  wish to prepay your burial expenses? How may we help you?”  “Uh, no to all that. I’m Robin from Seaford, Delaware ,   and I'm   researching   my  ancestry . I hadn’t planned to stop here first, but I did. I w onde red   if you have a directory  of   plot owners   or something that shows where people are buried? Is a list of names  available to the public, like me?”  “ I can help you with that . What ’s the name ,   or who are you looking for? I can tell  you if they’re buried there .   I’ve worked there for so many years; it seems like I know  everyone who died. ”  “Cherie Pandora Waterman is the woman I’m seeking. She’s   listed as   my great -  grandmother, but I don’t know where she’s buried.”  “Oh shit!   Screw   that!   No way!   Call us back when t he office is open. We’re closed for  a   ten - year sabbatical starting yesterday ! ”   T he   receiver   slammed down   with another  curse.  Robin stood   shivering and   listening to the dial tone for a   few   minutes before the  phone beeped ,   and she hit the end call   button .  “N ow ,   that was weird.   Ariel   thinks I’ve got problems .   I should have recorded that  call to play back for her.”  She pressed the green receiver key for   the   last numbers called and redialed the  number.  “Hello, this is Roxana Perkins, secretary   of   the Denton Ceme tery. How may I help  you   on   this   awesome   Denton day? Do you wish to purchase a   plot ? Do you wish to  prepay your burial expenses? How may we help   you?” ","“Hello, Roxana. Can we try this again ,   and you   w on’t hang up this time? If you   don’t  help people, don’t a dvertise your number. Do I make sense?”  “Yes, you do, but   no ,   if   you want the same information . I can’t help you. You need to  call back later. I’m the   lone   person here ,   and I’m not getting involved in stupid , useless,  underhanded, evil bull shit. I won’t!”  “Can you just tell me if she’s buried here? If she is, I’ll look for her grave on my own  and leave my number for someone else to call me.”  It seemed like hours before Roxana spoke again.  “She’s there ,   and I wish she w as n’t.   I wish it w as   in Oakland, Calif ornia ,   instead.  Bette r   yet, maybe   the moon would be the prime   spot   for that… .   Never mind!   Dam m it!  T ake the right drive from the entrance.   Drive u ntil you   must   stop   and park the car.   Walk  back toward the entrance and count when you do.   On the east side, she ’s on the 23rd  plot , which will be   on   your left. And if   anything   bad happens to you,   even if you stub  your to e ,   I never talked with you, you never called!   I don’t want to be dragged   in to  something evil.   Got that?”  “I got that. Thanks. Sorry to have bothere d you for public information.”  All she heard was another   receiver slam,   beep ,   and dial tone. She shivered   from the  icy response,   moved to the east side of the building ,   and looked back   at   the right  driveway.  “That’s a long way back to the end.   It seems to   run forever, but I don’t see how that’s  possible. Every cemetery has its boundaries and limitations.   S ince we’re here, let’s go  and try to keep Roxana out of trouble while we do. Naughty, Self. Cause her to curse ,  and she doesn’t even know you. We don’t wa nt her fired   because of searching for a   dead  relative , do we?”  She checked the distance ,   and it was   just   over 3/4 of a mile to the end.   So,   s he  turned in the generous area and parked facing the front. She counted plots on her left  side , with the gravel cru nching and shifting   as a solitary sound under her feet . She  stopped when she reached 23 and stood looking at the plot that   appeared   different from  its neighbors. It took a moment to figure that the grave site had grass that had not been  mowed, bu t it was a   uniform height and   taller   than   the rest.   An   impression   flashed  across her mind   of someone cutting it with   scissors and   doing it   every day   to keep it  looking spiffy.  She looked at the plain tombstone   with   Cherie Pandora Waterman, born  01/25/1882   and   died 0 1/26/1976.   Under the last date ,   someone had scrawled with a  black marker, BUT NOT SOON ENOUGH   FOR THIS BITCH .   A dried bouquet of flower  stems lay on top of the stone ,   with another stone holding them in place .  Robin   shook her head and looked sadly at dried   weeds that appeared to have rested  there forever.   It boggled her mind how they could have   lain   for   m aybe   forty   years or  more and still be that intact, just dry and without flowers, leaves, and green color.  She wondered what flowers they were when fresh and   stepped forward to remove  them.   A thorough inspection of her area revealed a barrel marked TRASH near   where  she   parked,   and she held   it   in her hand for a moment and said a prayer for her   just  discovered   relati ve .  “I never knew before today, but I’ll remem ber now. I’ll be back tomorrow with some  fresh   flowers,   and I’ll   return   once or twice a year to keep your grave looking loved and  cared for; I promise you that.” ","She blew the grave a kiss from the gravel and walked   towards   her car, feeling   noble  and right   about herself and her visit under extreme difficulty.  The cr ies   of some birds reached her when she dropped the stems into the   trash can,  and she looked   towards   the entrance. Above it and somewhere inside the cemetery  limits, a crow flew in circles and   made   sharp darting movements. It appeared to be  flying in fear for its   life,   and   it did not take   Robin   much time to locate the threat .   A  falcon flew about 100 feet   above   the prey   and on the same course but not circling and  zigzagging. It maintained a steady   pa th   until it   squalled and   dropped like an arrow .  Feat hers   flew,   and screeches filled the air as th e crow stopped and spiraled down to   hit  the ground.  “ Damn, what   a rough way to die.   Sorry for your luck, buddy,” she said , moving  toward the car.  The falcon sq ualled   again,   and Robin turned to see it flying toward her ,   and she  knew she was the next intended target.  “Uh, bull shi t!   You’ll not get me like you   demolished   the crow .   I’m not your prey! ”  She hastened toward the car when the falcon squalled again like i t killed the crow.  She felt relief when she had her hand on the door handle and   jerked   it open. She paused  long enough to see it dropping toward her new location   in an   apparent   attack maneuver ,  and she scrambled inside and locked the doors. She started the   engine and looked  through the   windshield but   could not see it.  “Just leave , dummy !” she shouted.  She did not have the car   in motion before the falcon hit the driver’s glass and the  ground, leaving a streak of blood and more feathers. She squealed and lean ed to the left  to see   it better .  The falcon flopped   a few times   and then lay still, but for Robin ,   her last thought   o f  him was the wickedness in the one eye that faced her.  It   said to her , “You’re mine, Curious Bitch. I’ll get you somewhere and someday. Yo u  belong to me   in this world and the next.”  “Get the hell out of here!” she yelled at herself and drove toward the   front of the  entrance as fast as prudent.  “What the hell happened there? Was that because of me? Or was it   some spiritual  alarm system that g hosts use for their protection? Whatever it   was ,   it   got   my   attention,  and I’m sorry for lying, Cherie. I don’t think I’ll be back to see you and bring   fresh  flowers. You lack   good   graces   and social skills in   receiving guests and   relatives . Wow !  W hat a demo nstration to say   get   out and leave me alone.”  She stopped outside the entrance and called the last number. Instead of   Roxana  answering, it went to voice mail. She waited and left the message, “Roxana, this is  Robin. I’m sorry. I should have listened, but I ’m family ,   and in Seaford, everything, even  cemeteries ,   is   peace and love. Please call me. Yo u   have my number on Caller ID, I’m  sure. I need to talk with you about this, or if you can’t ,   give my number to someone who  can and will. After what happened to me , I can’t turn my back and walk away. If you  w ere family, I’d not do that to you. Please call. Goodbye.”  *  She returned to the hotel ,   and   Ariel   waited   on a sofa in the lobby ,   looking nervous  and peeved , with   her fingers   drumming on   her purse. ","“It’s about   time you showed up! Where have you been? I   think I’ve died a few times,  thinking of you stranded in horrible situations where you shouldn’t be.   You   wouldn’t  answer the phone!   Did I make a mistake in bringing you along?”  “I’m sorry. I’ve been out   touring   D enton   and   in a jam ,   and I was so busy surviving I  neglected   to call you . S orry.”  “Surviving? Was someone trying to kill you? Why? What did you do?”  “Nothing! Let’s go to your car ,   and you can ask questions there.”  “Never mind. Let’s go.”  At   Ariel ’s car, sh ock took over at the sight of th e driver’s window. “What the hell is  that?”  “Falcon blood and maybe some poop. I don’t know how f ast he was going when he  hit me,   but I’m grateful that the window didn’t shatter. If it had, he’d have taken my  head off! No do ubt about that.”  “And where did that happen?”  “In the cemetery   where   I found Cherie’s grave . I   tidied it up a bit ,   and I guess I upset  someone or something. The falcon killed a crow and then attacked me. And I chose to  get out of there pronto.”  “And Cherie   is who?”  “Oh, my   great - grandmother , from Denton no less.   H ad that   incorrect   when I denied  it   for so long. I just took a chance she would be   there,   and the office confirmed it and  told me where to look.”  “Did they warn you against falcon attacks?”  Robin gr imace d   and turned her face away. “Uh, no , but   she warned me to go home  and forget about her,   even if   she was a relative .”  “And ,   of course,   you didn’t.”   Ariel   sighed and hugged her. “I’m sorry I got angry with  you. I know you’re trying to do right, but some times, sweetheart, you   need   to let things  go. You know where she’s buried ,   so let your quest stop there concerning her. Do you  think you can do that?”  “Well, I’ll try. That scared me.”  “ Excellent . Do you need to freshen up, relax,   or   lay down a spell? What ’s your  immediate need?”  “I need food. I’m hungry.”  “When are you not? Oh, when you’re sleeping. Okay, let’s find a   car wash   and a   place  to eat.   From the looks of Denton, that will be the   sushi bar here at the hotel.”  *  They finished their evening tasks   and   relaxed in their room when Robin received a  call from Roxana.  “Do you have any plans tonight? If   not,   I’ll be at your door in about   four   minutes or  less . ”  “You’re in the hotel now?”  “ Of course, y ou’re not hard to find since you’re from Seaford and have   no clue about  relatives here. Is it okay to come up?”  “You’re not here yet?” ","Robin opened the door for her. “Uh, this is a surprise. I expected someone younger,  not middle - aged.”  “You can send me away.”  “No , t hat was a compliment. Your voice sounds   young   and strong   on the phone .  Come in.   T his is my partner,   Ariel   Wright.   Ariel ,   Roxana Perkins. Have a seat. Do you  want something to drink?”  “No thanks. Maybe later.   You look a little ragged.   Y our voice sounded it on the  phone. So, I take it you had an experi ence at Cherie’s grave?”  “Experience?   While awake, I called it a nightmar e , so   I apologize for not listening to  your advice. Have you seen it? I mean her grave.”  “ I saw it once.   Were you hurt or   scared ?”  “I was frightened. I can handle a lot of fear, but n ot that much in a short time. ”  “What happened?”  “I took a bunch of dried flower stems from the tombstone ,   and a falcon killed a crow  and then attacked me. I got inside the car   and out of danger , but it killed itself on the  window trying to get me.”  Roxana   shook her head. “I told you to let it go, didn’t I?   Y ou’re lucky. Did it cure you  about returning for more pain?”  “I’m not sure of that part yet . I’m still considering my options.”  “Oh, just wonderful news!”   Ariel   said. “What will it take to get   the   point   across? Will  an arm or leg ripped from the socket be   a strong   enough   message ?”  Ariel’s caring input touched Robin’s heart, but she ignored it   to gather   more  information.  “What happened to you , Roxana ?   Y ou did get hurt, didn’t you?”  “ I got hurt, big time.   M y brother Robert, his friend Jeremy, and   I   went to the  cemetery at night two   weeks   before Halloween. Before we   went,   we shared some  marijuana and some rum and c ola   drinks. We were high, crazy, and stupid   even to go,  but we thought it a grand idea. We walke d through the graves and played tag and hide  and seek. We lay on a few   graves,   and then we reached Cherie’s   plot,   and our fun  upgraded to   a   nightmare . We began to challenge each other to do different things on the  grave.  “I challenged Robert to l ie   down an d pretend he was having sex with her in the  coffin.   So,   h e did that and moaned and   groaned,   and we all laughed.   But, h ey, he got her  dead   cherry.  “Then Jeremy challenged me to p ee   on the grave. I didn’t want to, but   with some  coercion,   I did.   That was a bi g mistake ,   but I did.   I was   nearly   naked,   and Jeremy went  crazy then. He wrestled the   rest of my clothes off and slapped   me until I stopped  fighting and let him have me on the grave. I don’t know what Robert did during that  time. He was   quiet,   and I know h e never attempted to stop what happened to me.  “Jeremy finished what he had to   do,   and I just lay there and cried for a few minutes,  looking for   Robert   but not finding   him .   Finally,   I   pushed myself up to a sitting position  and chose to clear   Jeremy's mess ,   and he sat a few feet away, just watching me with a  dazed look in his eyes. I found my panties and   wiped   myself,   and things went to hell  swiftly.  “It   was   like one   hand; an enormous   hand grabbed my chest and knocked me back  onto the grave. A second hand ja mmed inside of my   vagina,   and I screamed something  fierce. Jeremy   turned   and gagged ,   and   from   somewhere ,   Robert   call ed   for God to stop it! ","Nothing stopped it. It felt like my insides were ripped   asunder, and   I   blacked out from  the   intense   pain.  “When I   bec ame aware again ,   police and ambulance lights flashed , and three  helicopters landed . Jeremy was bent over her tombstone without his pants .   M aybe   a  four - inch tree   or bigger shoved inside him,   limbs   and all. Blood and intestines were  splayed all around   him,   a nd both arms lay crossed on the ground   near   his feet.  “For me, my uterus was gone and laying on the ground ten feet from me. Robert was  never found.   However,   a visible trail of blood led   to   the entrance where we   parked,   and  then it disappeared. The car was   smashed. It looked like a car crusher got hold of it and  destroyed it.  “I was air evacuated to Baltimore to their shock trauma center. I was in ICU for  twelve   days, but   I recovered. It took   fourteen   months to rehab myself and let the ripped  muscles   heal,   and the damaged nerves learn ed   to work and allow me to walk again.  “Poor   Jeremy   hung there for   six   days until the authorities contracted out of state  because none of the local morgues or morticians would touch him before maggots set in.  It   was a huge disas ter for what was supposed to be a fun and adventuresome night.”  Ariel was on her feet and   waving at Robin.   “ Do   you think you can do something  against that? Just stop and give it up ! ”  Again,   she ignored   Ariel’s frightened   plea. “What’s your personal opinion   on what  happened   to Robert?”  “I think he was inside the car, but the police chose to call their big - rig haulers and  deliver it   to We - Chip Auto Destroyers   in Pennsylvania . It sat there for two months ,  untouched,   and   afterward ,   it was ground up and sold for   salvage. And no one checked to  see if he was there. They just hauled it and let it be destroyed.”  Robin closed her   eyes   and   could   still   sense   Ariel   begging her to stop and walk away.  “That’s a   probable   theory.   Of course, i t’s hard to   di spose of a body wit hout a trace ,  but that would work   fine .  “ Now   for another query , Roxana . This   might make you think a bit, but who lives in  the house   at   the back of the cemetery? I noticed a house when I turned around there  today. I   thought   it was empty, but   smoke rose   from   the round chimney.   Do you have a  clue on that?”  “That’s an easy on e , honey. The man is Clarence Hunter   Lowbottom . It’s a strange  name   and   goes with a   strange   man, but he’s a godsend for the cemetery board of  trustees. He performs maintenance on the graves , for which   a cleaning fee is applied  toward   the funeral cost. If not, he cuts the grass on c e   every month   and removes ba d  flowers and vases at least every two weeks to keep the place looking nice.”  “Except for Cherie’s grave. The flowers there looked to be   a hundred years old.”  “Well, he might avoid that on e for   a   reason.”  “Do you think he   would talk to me?”  Ariel interrupted with a shout.   “Oh, give it a break already!   W hy   should you   risk any  more fear or damage to yourself? Please let it go, Robin!”  Robin   still looked for an answer from   Roxana. \"Do you think he would talk with  me?\"  “Yes , I believe he would .   I would say he’s lonesome   because people   believe   he’s  strange, but he’s not. He’s different and   doesn’t fit in well, but he’s kind and  hardworking . Park   in the turnaround again and walk to the hedge. Look close   to the line,  and you’ll find a small   zig - zag   maze inside. That will open into his   front   yard.” ","Ariel screamed   in   frustration.  “Will you please stop helping her?   Can’t you tell she’ll not back down   on this? If  something happens to her, can I sue you for   helping   her ? The   whole situation is so  stupid it’s unbelievable! Gah! Both of you ,   stop! ”  She stood and grabbed her door card from the nightstand   under the silent gaze of  the women .  “I’m out of here f or a bit. I need some fresh air. Call me when your new friend is  gone!”  Roxana pointed to her with a thumb. “Are the two of you lovers?” she asked   lowly .  “No,   we’re   just very close.”  “Go ahead! Trivialize everything I say. I’m not important! We’re not impo rtant. Call  me when she’s gone ! \"  With   that, she   slammed the door.  Robin shrugged.   “Sorry about that,   Roxana.   She’s been hypersensitive   for   a day or  so . I’ve asked if she’s pregnant ,   and she gets snippy. It could be a long - term PMS. I don’t  know.”  “Don’t wo rry about it. She’ll live through it. If I can live through a non - surgical  hysterectomy, she’ll live through your investigations.”  “I believe. Why do you think Clarence will be helpful to me in what I want?”  “He’s   Cherie’s   former spouse , now a widower .   L et   him tell you ,   and you can figure it  out. ”  “Is Lowbottom his real name?”  “Yes, and it’s not because his ass is low to the ground or his legs are short. He comes  from a long line of them, but they all live and die   within   ten   miles of t his area. They  don’t l ike traveling at all. And if they can fin d   a way to get you to shop for them, they get  excited and do backflips. They’re homeboys in a real sense of the word.”  *  Roxana left   by   giving up her personal cell phone number ,   and Robin called   Ariel  back to the   room.  “Aww, man. You’ve been crying over that?”  “Yes, I guess I have. Maybe I love you too much. Maybe I want to be your lover. You  always end up with losers and   miserable slobs. I’m not any of that.   Maybe I care too  much. Maybe I should ice my heart a lit tle and never care what happens to you, but I  can’t do   i t. ”  “I’m sorry.”  “ You’re a   fine   person   and   deserve a lot of peace in your life. I guess the real culprit is  you take too many risks . It   appears you don’t care what happens to you   or how your  death wou ld affect people who care about you . You need to start loving yourself. That  might make a difference in your behavior.”  “You’re right, of course. I do take risks when other   sane   people stop and walk away.  It’s just that I’ve discovered Cherie ,   and if she’s   put a blight on the family name, I want  to clean it up if I can.   But, u nfortunately, n ot all actions , words, and thoughts are  chiseled in stone for future generations to discover and then accept as   okay .”  “You’re right also.” ","“Get ready for bed ,   and I’ll   give you a Robin Red Breast massage that will knock you  out in the end.”  *  The   following day , Robin called   Ariel   when she   felt   safe   and   parked in the  turnaround in the cemetery.  “Good morning,   sexy sleepy voice .   Are y ou still in bed?   It's t ime to wake up   and  tackle the day. Time to cause slot machine bandits   to   cower in fear because you   will  lighten their load.”  “Mmm, yeah. Wonder if you can have one delivered by Room Service   to   play in bed?  Man, I enjoyed that. And I’m talking about the massage and the s leep afterward. Thanks  for your love and kindness.”  “You’re welcome. It’s been a few years since I saw you   almost   naked. Am I blind ,   or  are you more curvaceous than before?”  “How about   you have   been blind   while m y body and mind have matured over the  last t wo to three years. You just failed to notice it . Y our mind is so   often   locked on some  mission that will lead to your or our greatness.”  “Well, all I can say is, Wow! You’re beautiful.”  “Thanks. You’re not here; are you in the cemetery? Are you using my car   again?  Don’t return it with any blood this time. Have you found the zigzag entrance yet? Have  you been attacked by anything yet?”  “I’m here, but all is calm and peaceful. I just found the entrance, so I’m going to stop  now.”  “That’s what you said last   nig ht,   and I told you not to, but like always, you didn’t  listen. Come home safe, okay?”  *  Robin returned the phone to her belt holder ,   glance d   at   the grave   sites one last   time,  and stepped into the entrance of the thick hedge and a   peaceful   world. She coul d hear no  birds, insects, or dry twigs crunching beneath her feet   but   smelled the leaves being  disturbed   and   nothing else. It struck her as an alien world and   unwelcome d   like   the day  before .  “Get over it already.   I need to find this   Clarence Lowbottom and   learn   his part in  this mystery.”  She made   four   right turns ,   five   left turns ,   and a half - circle to the right side ,   and then  the path straightened to take her to an opening she could see in the distance. She  thought it a long   distance, but   soon she found her self   in   a   considerable   round area with  a small house   needing   repairs, a shed, a small barn, and   untamed   wheat and   soybean  crops   or forests   for miles in all directions west, north, and south. Behind her, to the east ,  was the hedge as far as could be seen in   either direction. She ignored   everything   and  devoted her attention to the man who sat in a rocking chair on the   house porch. She  knew he stopped rocking when she stepped from the hedge   and   scrutinized her   even if  he did   n o t move.   So,   s he stopped a few fee t from the porch and   assumed a similar  stance . ","He wore a white, long - sleeved   shirt and denim bibbed overalls. He had no cap or  hat ,   and the top of his head was bald, surrounded by   a circle of   white and black hair.  Below his pant   legs, ankle   work boots   in   d ire   need of polish   completed his wardrobe.  He moved and stood akimbo without warning   as his eyes pierced her   scornfully .  “Can’t you read no trespassing signs? How about the ones that say stay out?”  She was shocked at   his sudden   move but   maintained her   quie t position .  “Well, since you   have demonstrated that you   can’t read, do you understand common  English, like leave before I shoot you? How about that verbal sign?”  She shook her   head but   did not move. “I’m looking for Clarence Lowbottom . Is that  you ?”  “That’ s obvious since I’m the   man   who lives here ,   and no one comes here unless  they’re looking for me. And furthermore, you don’t have to introduce yourself. Your  stupid face   reeks   of Kirby. Without   your mouth   saying it, your face says, ‘I’m a Kirby.  I’m a Kirby . I’m a Kirby. ’   Look around you. Take a vote. See how many plants, animals,  birds, and humans care if you’re a   Kirby who   has   arrive d   from the Hades side of the  world to   bug   me! Who   i s your mother?   Or are you too stupid to know? ”  The dissertation shocked he r.   “Uh, she’s Anita Smallwood ,   who married Daniel  Kirby.”  “Anita, huh? Then you must be Robin Jacqui Kirby. I hope you turn out smarter  than her. I guess she learned how to have sex and deliver a child. What are you doing  here in Denton?   Did   Delaware get t ired of you and spit you out   like sour milk ?”  “Uh, wow! Are you always this rude?”  “ I am w hen people encroach on my territory and think it’s   just peachy keen and  nothing bad will happen to them.   When did I last come to your house and want to visit  you?”  “U h, never.”  “ Then w hy   can’t   you   return the favor? And can’t you start   one   sentence without ‘uh’?  You sound like a scratchy record. Uh, uh, uh, uh! ”  “Yes, I can   talk plainly, but   I’m just   shocked . People have told me you are   pleasant ,  but I don’t see this   gr eeting as anything close   to their description .”  “I’m as   friendly   as I can be. Friends don’t kill   withou t cause, so you’re still alive ,   and  I’m   welcoming . What do you want?   Tell me and then get lost, Kirby Girl. ”  “I want some conversation. I’m doing some re search on my   ancestors   and Cherie  Pandora   Waterman. I found her on the internet site ,   and yesterday ,   I found her grave.”  “So, that was you who killed the falcon . ”  “I didn’t kill him. I minded my own   business,   and he went into an attack against  me.”  “Falcon s don’t attack humans without just cause. You did something to   make him  angry   and   want   to kill you. What was it? What did you do?   Confess instead of looking  stupid and guilty. ”  “ All I did was take   the dried flower   stems from   Cherie ’s tombstone and put them   in  the trash. They looked too   tacky   laying there under a rock. I keep my mom’s and dad’s  graves clean and respectful ,   and I wanted to do the same for her.”  “Then that’s why he wanted to kill you. It might have been better if you had let him  do that yester day . It wouldn’t have hurt for long   and maybe a lot less than it will later.”  “That’s crazy!” ","“Not as crazy as touching something that you don’t understand. The plants were put  there for a reason . They   were meant to stay there until they disintegrated and   turned to  powder. And   silly ass ,   you just had to touch it and screw it up beyond all imagination! Be  gone before I shoot you r dumb ass !”  “Tell me who I can talk with about her and what   happened,   and I’ll go. Just make  sure it’s someone who’s not angry for   no reason.”  “ You are   a   mindless ,   stupid   Kirby bitch! The plants placed there were hemp, milk  thistle, and sage.   T hey were held there by a   sand stone to prevent wind from removing  them. They interfered , preventing   her spirit from returning and causing havoc   in this  community! She was a witch of the highest order possible! She offered to pay people in  Denton $2.5 million   in advance of her death   to remove them if they were put on her  tombstone!   No one took her up on that offer because they knew what she was and   didn’t  want   her to   return . Now you’ve done it without understanding   and   opened   the   door   to  hell   that should have been left   closed !”  “Well, maybe it would help to not keep that a secret! Did you ever think of that?”  “Yes! And there are too many busybody pe ople in the world for that to work.   So,   y ou  did it by accident! Others would have done it just to see if it w as true ! And guess what,  Kirby Girl,   the result   is the same!”  “Well, I’m sorry! I just wanted to help her!”  “She’s dead! How is a spiffy grave goin g to help? What will it help , h er reputation?  Will it fill her heart with joy? No! It will make her happy   because now she can screw  with people again.   That was one of her favorite pastimes! ”  “How? If she’s dead, how?”  “She’ll be back before sunrise tomorro w. It will start with   five   tornados followed by a  hurricane.”  “The forecast calls for nice weather, not even rain .”  “Then ,   after the first tornado hits, make sure you come and tell me it never  happened.   Lie your way out of it if you have the nerve to try!   Good bye,   Robin   Kirby! ”  “What can I do? If I did it, can I correct it?”  He paused ,   and his   evil ,   penetrating   gaze made her feel sick.  “You’re named after a bird. Birds fear cats. Lose your fear of pussy and come back in  the morning.”  “Hey! That’s not fair!   And it’s not right!”  “ You wish to tell me w hat you   accomplished   in the cemetery is fair to the whole  community of Denton? When the death toll goes up, remember this :   Kirby Girl, you  asked what could be done to stop it. That’s the first. Do it or suffer th eir wrath because  I’ll   tell the villagers   who did it and why!   I refuse to take the blame for it! ”  She turned her back to him and screamed. “Fuck!”  “That’s what most people call it.   Do y ou hate it?   So   did   Cherie . She put curses on  more than one and screwed   up their lives. Overcome your fear. It will serve to add a bit  of armor to your war chest.   You started the war; you   must   finish it.   Try to look stupid  and innocent and walk away if you don't want to .   J ust understand that you’ll never leave  Denton until   you   win   or   you’re buried beside her. You don’t want to hear or believe that?  Stop by the Court House and check her will. You’re in there, Kirby Girl.   I’m a Kirby. I’m  a Kirby. I’m a dumb - ass   Kirby   training to change my own diaper.   Oops!   It w asn’t quite  fast e nough that time.   See you tomorrow or in the Obituary   later this week.” ","She found the path   in record time ,   and the return trip went   smooth ly   but   was  depressing . She sat in the car   momentarily , enjoying the cool air from the vents and  pondering   the   moves   tha t would   take   her deeper into   danger   rather than   get   her   out.  “What’s that expression ?   ‘ You can’t win for losing. ’   That’s me. I’m a Kirby Girl ,   and I  lose everywhere I turn.   So,   stop turning, dummy.   Stand firm, but don’t look pretty. Look  mean   as   tarantula   piss   and determined to win something in your   gutless   life.”  She paused before   Cherie ’s grave. “I was going to talk with you, but why? I’ll pay the  price to get where I want to be. However, if you can find a way to get the $2.5 million to  me   that you promis ed anyone else , I’d appreciate that. I have   a   suspicion I’m going to  earn it   anyway. Toodles   from lots of poodles ,   great - grandmother . ”  *  Robin sat on the edge of the bed in the morning and   inventoried   her clothes   around  the floor.   Finally, s he covered he r face with both hands and flopped back on the bed.  “Is there any   further   down that you can slide, Kirby Girl? Will you stop that   label ?  He didn’t use it or mean it   as   a positive.   So ,   could you not take it upon yourself to  continue?   You’ ll   need all the pos itives you can find, muster, buy, stumble over,   and   win  in a psychology lottery you can acquire. And   never touch anything you don’t understand  for the rest of your life .”  She looked   toward   the   ajar bathroom doo r   and heard the water running in the  shower. S he shook her head and groaned.  “Why didn’t she at least resist or fight a little? That was too easy. What are you going  to do now, Kirby Girl? What is your next trick? How about   doing   it on the Boardwalk  and   hold ing   up a sign that reads, ‘Please whip my as s?’”  She sighed ,   picked   up   her wallet from her purse ,   and regained her seat. She opened  it to a picture of her mother and father. “I’m sorry, guys. I’ve let you down in a huge way.  You both gave me   sage   advice . You said,   ‘Don’t worry and cling to the past,   ours or the  families .   Instead, b uild your own life based on the honesty and goodness that you are  and will be.   The Kirby   bloodline s are   not   pure, but they can be   corrected . Don’t dwell  upon   the past ;   don’t open doors that should remain closed ;   don’t take   unnecessary risks ;  don’t involve yourself in lesbian relationships. You can cleanse the bad, the evil, the  wrongness out of this family   by living righteously . ’ Now, look at where I am and what  I’ve done. ”  The water   stopped,   and she closed her eyes and will ed herself to put on a happy face  when she wanted to cry and scream. She   smiled   but   could not prevent some tears from  leaking. She wiped them, but not before hot hands rested on her shoulders.  “Hey, what’s wrong? Why   the tears? Are you hurt over what happe ned?”  “No , it ’s   not that, but   there are   many   things I don’t need in my life right now. I’ve  not been   perfect,   and I’m about to get chastised. Sometime s ,   when   I m ake mistakes,   I  can’t get away from the   pitchfork   in front of   me   or   the rabid pit bull behind m e . There’s  a   cliff on   my   left and   a   whirlpool   on   my   right. And as if that’s not enough, there’s a huge  storm cloud over   me, only   me , and two more steps ,   and   I’ll   be inside the cr evice   left by  the earthquake.   That’s what it’s like when   my   number’s up , and   r ight now, mine is.”  “Hey, that’s too negative for   you. Just   stop your suicidal course. I’m   here,   and I’ve  got your back now. Just don’t hide from me and hide information from me. I like to  know who holds the pitchfork, where my gun is for the pit bull, whe re my lifesaver ring ","is for the whirlpool, and where my lasso and horse are for the earth crevice. I love you as  a friend, a lover, and an adventuresome leader. You don’t have to face   an y fight alone,  ever.   I’m   Calypso,   and I’ll shield you until all the Ho unds of Hell are exhausted and  chained again , and your sword is dripping blood from every enemy   who’s foolish enough  to test your mettle .   Got that?”  Robin made a soft fist and tapped her left jaw. “ I got it, honey, and wow!”  “Yeah. Did that sound   like a sp unky statement? ”  “Just a tad ,   and   I love it. Thanks.”  Ariel moved her face in for a   kiss,   and the sky turned pitch black ,   and green  lightning flashed   in   the room. She moved her mouth   away,   and screams   could be heard  around the hotel as power failed and   sev eral   windows shattered on the   river   side.  ‘WOW! Did I do that?”  “I wish it   was   you instead of our   enemy, accepting   your spunky challenge.”  The p ower flicked back   on,   and all the clocks flashed   at   12:00   noon.  Robin moved her aside and stood.  “ Let’s go and g et some breakfast in the   restaurant,   and we’ll   dine   i n the boardwalk  seating   area. The enemy isn’t going to wait, so neither should we.”  They risked the elevator to the ground   floor,   and they were 50 feet   under way when a  man hailed them.  “Yo! Wait up there ! Are you Robin Jacqui Kirby? Hold up, please!”  She turned to see a man in his 40s hurrying to catch up with the m , accompanied by  a much younger man w earing thin - framed glasses and carrying   a briefcase.  “I’m Robin. What can I do for you? Hurry, please. I’m   hungry and late for  breakfast.”  “So are we. I’m Walter Arrington ,   and this is my new partner, Shayne Wolf. We’re  both employees   of   the Denton City Government. Let’s order   from   the restaurant and  dine on the boardwalk tables. We need to talk ,   and due to th e circumstances  surrounding our problems, we   should   not wa it   too long .”  “Our problems? Are they mutual, as in Cher ie   Waterman?”  “The same, Miss Kirby.”  “Then let’s do it. This is my partner, Ariel Wright.”  They ordered and sat at a table for six on the boa rdwalk ,   and Walter started.  “No need to wait, Robin. I’m from the Recorder of Will s   section ,   and   Cherie’s   will  mentions you   twice. Once very   precise ly   and once again conditionally. The specific  portion is that   you’re to receive the deed to a parcel of land   adjacent to the Denton  Cemetery during the final processing of her will. That parcel   is occupied by Clarence  Lowbottom , and i ts current valuation is   $1.3 million.  “ The   second   part is her bank accounts and stocks and IRAs. Their total is   around  $2.75   milli on.   Then comes the conditional part. Part one is   that   you must find her grave  without provocation. Part two is you need to perform   reprehensible   acts with a feline.  Part three is strange. It says that you must restore what you destroyed with the silent  hel p of Lupine.   Finally, p art four is the strangest. It says that you must restore what  Roxana Perkins lost through foolishness. And that’s all you have to do.”  Robin cast a quick glance at Ariel.   “And when I do those impossible parts, what  happens to me or f or me?”  “When you do them and can be verified,   you’ll have $3.7 million for your use ,   plus  accruing interest . In   addition, you   will have lease income   and 50% of any business ","enterprise that happens to be constructed at the intersection of William Street an d  Danube Avenue.   If   the property is empty, it goes to you to do with as you wish.”  She puffed out a   significant   volume of air.  “Coolness. Is there anything   built   there at th is moment in time?”  “Yes, Miss Kirby. This   luxury   hotel and casino was constructed   on that parcel of  land.”  She dropped her cup of tea.  “ Are y ou   kidding   me ? Does the owner know that clause exists   in her will ?   Does he or  they know about me? ”  “ I’m not kidding you, and yes , Miss Kirby. The   corporation   had to get   several  building   permits fro m the   city . That knowledge had to be revealed as   a part of the lease  agreement   when it got to our department . The property is still yours ,   and the lease   was  $200 thousand a year for a contract of   ten   years   with renewal options at that time.   Plus,  you   still   have 50% of their   stock and   profits.”  “And   where are the   monies as of now?”  “In the same institution as the $3.7 million, just in a different account for tax  purposes.”  “Of course,” Robin said , smiling   at   Ariel ’s stunn ing   face .  “And if you’re interested,   that   account holds $200 thousand for the lease and $200  thousand for a security deposit.”  “Well, dear   Ariel , it looks like I ’m going to   be busy for a short time. However, at the  end of my job, I think we can retire and enjoy life. Say what?”  “Say, I love i t, but some of that’s impossible and unachievable . ”  “We can take care of part s one and   two right now with plenty of witnesses, including  our waitress refilling coffee cups.”  “Sex with a cat?   Come on , Robin?”  “Yes.   Happy I’m not allergic to fur. I’ve b een t here   and   done   some of   that .   I found  Cherie   Pandora Waterman’s grave yesterday o f   my own volition. And last night ,   I had  sex with a feline. Ariel’s name means Lioness of God. I’m sure God di sapproved   of   our  actions , but she was a lioness when we made love l ast night.”  “ I know about the grave from talking with Clarence Lowbottom,” said Walter. “What  about part t hree , Ariel? Is that tru e ?”  Ariel gave a   weak   thumb s   up. “Yes. We’ve come close before ,   but last night we did  it.”  The waitress tapped   on   Robin’s   shou lder. “ Hey, Miss Kirby ? You did her last night?”  “Yes , I did. W hy? Do you have a problem with that?”  “Yeah, I do. I was about to make her an offer. Damn my luck. That would have been  a forever tip. Never mind now.”  “ Well, t hat covers part s   one and two. Wha t about the rest?” Walter asked.  “That will require some thought.”  “What was lost that you must restore?”  “I do believe that was the dried stems on her tombstone.   Unfortunately,   I was  attacked by a falcon when I removed them.”  “ And number   four ?   What did Ro x ana Perkins lose?”  “Her uterus. Some demon, or witch ,   pulled it out as punishment   for being naughty  on a grave .” ","Walter stared deadpan at her. “And you think you can restore her with a new one?  I’ve never heard of a transplant for that organ. Are you sure ?   You   seem certain,   but  that’s very   farfetched . ”  “ I feel confident it can be done . Don’t ask me   for   the details yet, but I’ll do it.   It will  rise from where it is ,   and   Thunk   will   reappear   all snug   in her abdomen.   I love being  creative ,   and the   money   will m otivate me to succeed. Thanks, gentlemen. You’ve given  me a   huge   task. Thanks.”  Walter shook his head and stood. “Shayne, get your eyes and dick back in your body  and let’s go. We have some work to do instead of you drooling over Robin.”  “I wasn’t doing th at.”  “Spare me. If you two were alone, you’d   both   be committed, she’d be pregnant, and  you’d be passing out cigars   in advance . Move it ,   boy.   Get her pregnant on your own  time.”  Ariel snickered ,   and Robin winked at him. “Have a wonderful day, Shayne. Keep  d reaming. Much greatness has come my way by never stopping   my   dreams. See y ou  later.”  He nodded   somewhat   and blew her a kiss. “I’m certain we will, Miss Kirby.”  *  Robin modeled   poses   in the mirror in the bedroom. “What do you think, Ariel? I  think I need   to find a bookstore and see if they have a self - help book on how to be a rich  bitch and love yourself while the rest of the world hates you.”  “Oh ,   gag me already. How about one on   h ow to be almost a rich bitch and live   a  gracious   life   without suici d e?”  “Wh at? You have no faith in me?”  “I have faith in you. I just don’t see you winning this one.”  “Then I’ll add a book   for you   about having   faith in your partner and friends until  they win with exuberance .”  Ariel laughed and surrendered. “Okay. I’ll watch you a nd see what happens. Either  way, I enjoy watching you.”  “So does Shayne. Do you think there’s a way to collect money for that? If you want to  look at me, give up some cash. What do you think?”  “I think you need a kick in the ass or a hug and kiss. Which wo uld you prefer?”  “Wow!   I t took a lot of talking around it to get what I wanted. Shayne won’t. I feel  sorry for him. Working all day with an erection has to be difficult to painful.”  Ariel laughed again and threw a pillow at her.  “Hush! But   let’s get   seriou s ,   sweetie ;   I’m having fun seeing this side of you that  never comes out in Seaford. I love it.”  Robin   sat beside the bouncing woman and clutched the blankets with both hands.  “So, how are we going to handle this? I   can’t   do all this in one day, meaning tod ay.  This is Sunday ,   and the weekend is over.  “Do you want to stay? You don’t have to go back to Seaford until the will is settled.  Then you can buy it and close it down. Does that sound   like a plan ?”  “It sounds   like   the best.   So,   I think I’ll call   Brandy   t omorrow morning , take a sick  day,   and negotiate for some extended leave time, which I have. I’ll do what I said, but it  will   take some time to   initiate,   and then I can take a day here and there and commute ","here to get things done. I don’t like abandoning y ou, but I don’t see any other way right  now.”  “What   do we do   to get   me to Seaford?”  “I’ll drive you tonight or ride with you and pick up my car. I need wheels ,   and I  won’t   ask Shayne, even if he   jumped   at the opportunity.”  “ Very well . I’ll pack while you e xtend the room   for   a few days.   You may as   well keep  this one, my   queen ,   on the rise.”  She took the elevator to the lobby and strolled to the   Registration Desk as several  men in suits came and went.  “Hi, I’m in suite   501,   and I’d like to extend my stay if   that’s alright with   you   and if  it’s possible . My partner will be leaving, but I’ll   return   in the   morning,   and I like the  place. Is that   move   okay?”  “Yes, Miss Kirby. How many days will you require it?”  A man stood beside her and interrupted   the transaction .  “ Top of the   morning ,   Miss Kirby. I’m pleased to hear you like the rooms and wish to  stay longer. Charles, extend it as she desires and   simultaneously void all the charges  against her card . She   has   it free gratis ,   compliments of Denton Casino,   and she can   have  it   anytime in the future with a phone call   at no charge .”  He turned to her again. “Does that suit your fancy, Miss Kirby?”  She did a double - take and then sighed. “Uh, yes , but w hy?”  He handed her a business card from the counter. “I’m Daniel Everett,   manager of  the Denton Hotel and Casino. I also represent Fantasy Fulfillment   Incorporated ,   wh ich  arranged the birth of this   excellent   facility.   We   are aware of   you   and   wish to make you  feel at home whenever you   desire   to grace us with your presence. We fe el it’s fair to you  and to us.”  “Wow! You knew about me, but I didn’t know about you. Amazing. And you want to  be   kind   to me? You don’t have to, but thanks so much.”  “Your credit card, Miss Kirby,” said Charles.  She handed it to him. “You have a   pleasant   f acility   here,   and I’ve slept better than I  have in a long time. So, I might take you up on that offer   sometimes .   However,   for   now ,  it’s only until next Friday. Then it will be   haphazard   as I need to be here.”  “I understand, Miss Kirby. I’m happy to have me t you. We considered sending you  an invitation, but it seems to have worked better this way.   Do take care and enjoy the  remainder of the   day.”  Charles handed her the card ,   and Daniel watched   as she   walk ed   away with a light  stride.  The gesture surprised Cha rles because he found her too haughty. “She’s not too  readable to me, Sir.   Do you think she’s   going to cause   trouble ?”  “I don’t think so. However, if she   does , there are plenty of plots left   in   the cemetery ,  and if not, we can make one a   double - decker   or g ive a plastic bag and a donation to the  ASPCA. I hope she stays   ignorant   and wrapped around Shayne’s dick. That will keep her  occupied forever.”  * ","The news dazed Ariel.   “Are you for real?   Will you stop or   slow down between  transitions and breaking news f lashes?”  “That’s what he   said,   and he sounded sincere.   Anyway,   Walter told us the   builders  and owners   knew   me and   Cherie’s   will.   So,   I won’t look at it as a bad thing. I’ll look at it  as a partial owner - perk.”  She stuck out her tongue at Ariel. “So there.”  Ariel shoved her down on the bed and jumped on top of her.  “You’re a mess right now, but you’re a rich   mess,   and I’m happy that it’s me with  you versus some other stranger from Delaware.”  “Me too. Thanks for the wild weekend.   The pleasure has been   enjoy ab le .”  She returned the kisses until she struggled and sat on the edge of the bed.  “Are you ready? Let’s go and get this   done   so I can come back and relax a bit.”  “Oh, so that’s how it is, huh?   You’re rich.   The weekend’s over. You r   libido is   gone .  Now it’s   p ush ing   me away ,   and let’s go?   Three words come to mind :   f ickle , disloyal, and  too picky now. ”  “You got it.   If y ou want more, open your purse and start counting   bills   until I say  stop . ”  “I’ll let   Shayne do that in my place.”  “Yuck. Don’t go there.”  “I   won’t , but   he will.”  “He’s not hot ,   but   I don’t like him.”  “Liar. He’ll make a pass ,   so   play with it once.”  “Play with   wha t?”  “ Come on, now.   I mean h is erection. It won’t hurt you. You’ll both   like it. I have no  claim to your body, sweetie.”  Robin considered he r and nodded. “I’ll buy that for now, but we’ll come back to that  later.   Pack, girl. I want to   take   you home and get back.”  *  Robin drov e back to Denton alone and accomplished   the first item on her list :   tak ing  a bubble bath to soak away the stress of th e last few days. She sat on the bed drying her  hair when her phone rang. She c hecked the number , recognized   it was from   Maryland ,  and chose to answer.  “Hey, Robin. Shayne here. Are you back in Denton yet?”  “I am. How did you get my cell phone number? I tho ught I had some privacy in  that.”  “When you work   in   a law office, you can get a ton of things that other folks can’t.  However, in   this case, I got it from your partner, Ariel.   Assistants do network and help  each other at times.”  “I’ll have to thank her for   that , along with a kick in the butt .”  “Are you angry? I won’t abuse it or sell it on the Internet. Promise.”  “I believe you. What’s up?”  “You. I can’t believe the casino built a boardwalk   beside   the poor excuse for a river  and swamp, but it’s well - used   an d   a rather enjoyable stroll i n the evening when it’s  cooling down. Would you like to walk with me tonight? You sound   fascinating ,   and I’d ","like to know you better.   But   u nfortunately, t here aren’t too many interesting people in  Denton.”  “Does that combo come   with Boardwalk Fries?   I promised myself that   delicacy   all  weekend and failed. ”  “We can do that.”  “Then   it’s a date ,   and you’ll find out how boring Seaford people are compared to  Denton’s worst. I’ll meet you in the lobby at seven when the sky   darkens,   and   the   lover  lights come on.”  She hung up the phone and recalled Ariel’s predictions and encouragement.  “Yeah, right. I don’t think so, but we’ll see after some seductive fries. Wonder if I’d  get that invite without him knowing about the will? We’ll see abou t that also. Right now,  get dressed.   Eating   fries on the boardwalk with only a towel is not proper etiquette.  Undoubtedly,   y ou’d be popular, but we can live without that   fame .”  She met him at seven ,   wearing denim shorts and a button - style   pink blouse. She  paused to view him ,   and they laughed because h is   clothes   were the same color, but he  wore   a   pink polo   shirt.  “I see we   were thinking   ahead. Cool.”  They stopped at the first restaurant shack ,   and he bought the fries . He   winced as she  dribbled vinegar on he r   fries   and   added   some   seafood   seasoning.  “You never tried anything risky?”   Sh e held her cup before him. “You’re risking a  walk with me. Risk eating just one. Promise you won’t hurl in public. Come on, chicken.”  His frown and resistance faded to a grin as   he took one, twisted it in all directions ,  and then put it in his mouth with closed eyes .  “Should I stand upwind while you get ri d of it?”  “Smart butt. I never thought that combo of flavors would taste   delicious, and n o ,  you don’t have to stand upwind. I’l l be okay.” He turned and picked up the vinegar  bottle.  She shouted and did a dance   maneuver .   “Hah!   “Got another convert! Yahoo!  Welcome to the 21st century, newbie.”  “You’re as loud as you are bad . ”   He   sprinkled on some   seasoning   to match hers .  “You wante d the date, man. You   must   deal with the whole package to get what you  want. Let’s find an unoccupied bench and deal with this flavor heaven first.”  They sat and talked while eating since she approved that discretion.  “What   will you   do with all the w indfall   money you have coming?”  “I haven’t given that much thought yet. I’m still trying to accept that, BAM, there it  is,   and it won’t go away. I’ll wait until I settle down from my challenges to worry about  that.”  She devoured a fry. “What would you do with jus t a million of it?”  “ The f irst thing I’d do is buy or build a shelter for the abused women and children in  the Denton area. And I’d   hire a staff of   the meanest sons of bitches guards I could  recruit .   T he kind that would just as soon rip your head off than   explain why you can’t  talk to your spouse until you’re in prison on death row and behind a shatterproof  shield.”  Robin paused with a   French   fry headed for destruction and felt chilled at his  response. “Wow! I guess you’ve   considered t hat a lot, huh?” ","“Yes!   And it’s personal   to   me. My father beat my mother a lot until   I picked up my  ball bat and broke his right arm and left leg one day . He threatened to kill me, but when  the police were finished with him and the courts were finished, he was so lucky to be  al ive that he forgot all about it.   But u nfortunately, m y mother wasn’t lucky. She died  from complications on the last   punch in the head,   and I was left alone in the world. So,  yeah, I’ve thought a lot about that.   So, t he second thing   I would build is   a   food   kitchen  and shelter for the growing homeless.”  “Sorry to hear that bad news, but those are   first - class   plans.”  “Thanks. I’ll ask you again in a few months. You’d better have some plans ready by  then.”  “I will. Promise.”  “Wh y   are you   h ere in Denton doing al l this about   Cherie   Pandora Waterman? Did  you know about the money and decide you needed it?”  “I knew nothing about any   relative h ere ,   her,   her   will, or the money. I thought my  whole   family   came from the boats to Newark, Dover, and Wilmington, Delaware. No t  until a fortune - teller told me I needed to go to Denton and my   ancestry   program told me  that at least one deceased relative was born in Denton did I ever want to find this place.  Since Sis ter Stella , everything is a   surprise ,   shock ,   huh ,   and hey .”  “What   about me? Am I a good surprise?”  She grinned and fed him a fry. “I knew nothing about you until now, but I like what  I see so far. How about your   adoptive   parents? Do they like you so far?”  “Huh? What? You got me, joker. I reckon they do. They told me   four   years ago that I  didn’t need to move out, but I found an apartment and moved out so they and I could  have some privacy. ”  “I’m glad to hear that.”  “What about you?”  “I’m sure they would approve if they could. My mother worked at Nanticoke  Hospital ,   and she   died one day when she fell   five   floors in an empty elevator shaft. The  doors opened when they   shouldn’t,   and she   landed on the   top of the car with all the  cables and pulleys. She lived   two   weeks in pain and misery before she passed on. My  father got kille d by a runaway truck when the driver died of a heart attack.   Dad was  dea d ,   five other people in a crosswalk ,   and   nine   more   were seriously injured.  “I don’t think.” She stopped and turned to look around at the boardwalk and the  people walking   together . “I d on’t think they’d approve of my friendship with Ariel. I  don’t think they’d approve of my being here and digging into my past. They wanted me  to leave it alone and build my own history. In the cemetery on Friday, I wish I’d listened.  I’m not sure if they’d   approve of you or not. On the surface ,   you’re okay, but what about  beneath the public front? I guess I’ll find out   how strong your mettle is under   pressure  later . If you want to get to know me, I don’t think you’ll be able to avoid that testing.”  “Wow! I   date a string of losers ,   and   then   this   big - eyed, beautiful   waif from Seaford ,  Delaware ,   with a negative complex drops into my life and gives me hope for her and  humanity. Cool, Miss Robin Kirby. You said you’ll do it whether I like it or not, so  proceed wi th pride. Test me. I can take it.”  Her eyes   danced gleefully . “What?   Do y ou want me to   test you on purpose?   I   never  thought you’d figure it out, but the first test i s   now, buddy.   So f eed   me   your last fry with  a   sincere   smile.” ","He looked at his cup and the   fry on the bottom. He picked it up with his fingers and  held it before her   lips .  “If this is the fry that tips the scale   even   one - half pound, I don’t want to hear it.”  She snickered and regained control. “Promise.” She took it from his fingers with her  mou th and caught the hand to hold it against her cheek. “ Delicious.   Let’s walk now.”  She kissed him goodnight in the lobby   but   did not let him go until   they   were on the  elevator headed up.  Charles placed a call to Daniel Everett. “Hey, boss man. Miss Kirby a nd Shayne just  disappeared on the elevator to the fifth floor. Is that the news you   wanted? ”  “You   got   it. I love it when love decides to help you ,   even if it’s lust tonight. Love it  when women are predictable. Thanks, Charles.”  *  Shayne left the bathroom   in the morning, looking for his shorts as Robin talked to  her supervisor.  “Hey,   Brandy . Yes, this is Robin ,   and I have a problem. I need to take a sick day  today. Well, I’m   sick   of Delaware. Yes, I’m kidding. I need it, though.   Here is a   quick  rundown for   you. I came to   Denton   with Ariel   for a weekend at a new casino and  stumbled   upon   a forgotten dead family member. She left a   staggering will , but   I need  some time to straighten out the bulk of it and then handle the rest a day or two at a time.  Yes, lots o f money. No, I’m rich ,   and it’s beyond a few thousand. I’ll explain it in private  when I get back. Yes. I need today and tomorrow ,   and then I’ll swing by to fill out a leave  slip to keep us both out of trouble. Yes. Thanks so much,   Brandy . You’re the best  supervisor I ’ve ever had. Roger that. I’ll call you tomorrow and se e you on Wednesday  morning. Okay. Goodbye.”  She disconnected the   call   and   laid   the phone   on the nightstand.  “Good morning. You’re not dressed yet?”  “Have you seen my shorts?”  “No. Do you ne ed them? Can’t you live without them one day? Men want me to do  that for convenience, can’t you?”  He blinked and then shook his head. “I guess I could, but if I   c an avoid it, why not?  And I don’t think I’d ask you to do that. I’d rather not follow my fathe r’s tricks and  antics.   For example, h e trashed all mom’s underwear one   garbage   day. She had a hard  time until she bought   something   new ,   and she ended   up   with an infection that nearly  killed her. So, have you seen them?”  “Well, since you put it that way and   can’t go naked one day to please me, try the love  seat   or that area.   That’s where we started and got carried away last night. They’re there  somewhere.”  He scratched the back of his neck. “I guess that came out a little tacky and bitchy,  huh?”  “A   wee   littl e, but hey, we’re not half bad for a short time of knowing each other. I’m  not complaining   about   this learning curve of a date.   Last night, I added another shock to  myself , but I’m cool with the results.”  When she left the bathroom, he had collected all he r clothes and   stacked them  beside him on the bed. ","“What’s up with that , sir ?”  “ I’ve waited   for you to come out. I’ve never done this before, but I want to dress you  instead of   undressing you .”  She shrugged. “Well, since no one is watching, I guess it’s oka y.   Wow! What first?”  “Panties   go on   first. You don’t have to be so nervous.”  “I’m not. Well, maybe a little. You’re different than most men I’ve met. I’m nervous  because I can’t predict what you’re   doing,   and I don’t know how to behave.”  He laughed and adj usted her panties. “You’re behaving properly. Did you mean you  don’t know how to act?”  “Yes , t hat’s it.”  “You shouldn’t act on dates like this. You should be yourself, always. Save your  acting for the theater or playing games with your children later in li fe.”  “Now ,   th ere ’s a   grand philosophy I can relate to.”  When he had her dressed, she rested her hands on his shoulders. “Thank you,  Shayne Wolf. You’re quite a different breed. Do you know you’re lupine?”  “I know that.”  “So,   will you   help me restore   Cherie ’s grave?”  He snapped his fingers. “Darn. Now comes the unpleasant part where I kiss you  goodbye and   walk away   as   the   music plays ,   and you cry and look like your heart has  been ripped out.”  Her face went blank. “What?”  He laughed, kissed her   forehead,   and   turned her toward the door.  “ Of course,   I’ll help you. I’ve learned that if you don’t help women, they get  headaches, migraines, ingrown toenails, and any of those shut down their libido system ,  and it   isn’t enjoyable .   So,   l et’s go to breakfast ,   and you ca n tell me what you want ,   and  we’ll do as much as we can so you can make it back to Seaford and take care of matters  there tomorrow morning.”  He gave her a nudge. “And don’t forget your room key. I like   dependable   women  who don’t have to ask and beg for hel p when it can be avoided by being responsible.”  “Sir ! Y es Sir !   Understood, Sir ! Will comply, Sir! ”   She ran to the door and jerked it  open.   “Already have it in my pocket. I’ll wait at the elevators if you don’t take too long to  figure it out.”  “ So,   what do   we do first?”  “We need to restore the bouquet stems that I removed in error. I learned it was  placed there and held by a sandstone to keep her spirit from returning and creating  chaos in the community.”  “ Preventing chaos is always a   tactful   thing   when dea ling with   witches.”  “ Did you know   she was a witch ? ”  “ Of course, along with the rest of Denton .   H opefully ,   she’s the last. She was the last  accused, tried   illegally,   and executed as a witch in Maryland.”  “ Did that h appen here in Denton?”  “Yes. You didn’t kn ow that?”  “There was nothing on the Family Tree about that. Clarence mentioned she was a  witch, but not the rest.”  “Then you might want to ask him about her. It’s rumored he lived with her for quite  a few years.” ","“I’ll do that this morning. Where did that   happen? I mean her execution .   Was it i n  jail   or in the pu blic square?   Do you have a ny clue?”  “Try the back part of the cemetery where Clarence lives. It was supposed to be  private, like out of the public display.   I’ve heard that   it didn’t happen that way ,   and there  was a huge audience. Put that on the list of things to ask Clarence.”  “Hey ,   why does he want to live in the house if that happened ther e? W hen she died,  was the house there?”  She looked at his face and whispered, “I know.   Ask Clarence. Did they b urn her?  Never mind. I know what to do.”  “ Well, w hat was the bouquet made from?”  “Hemp, milk thistle, and sage. I guess it was fresh when whoever put it there. It was  almost   powder when I moved it.”  “Does it have to be hemp? Marijuana is in that family.”  “ Make it original. Hemp, milk thistle, and sage, okay? Don’t try to change centuries  of trusted   anti - witch   recipes.”  “ Yes, dear . The hemp will be difficult, I think.   I know where to get the other two .  What about quantity?”  “I don’t know. Just trust your own   judgment on that. Whatever   seems to   restrain a  witch ’s ghost   should be   satisfactory .”  “It will be easy then. Store my phone number ,   and I’ll contact you later today. ”  They separated after a kiss ,   he   requested,   and she went to her room to get her purse  and   car keys.  “That promise to Ariel sure lasted a long time, huh?   S he told you what he’d   do   with  you ,   and he did.   So j ust shut up and go to work.   Clarence Lowbottom ,   prepare for  another visit from a Kirby, a Kirby, a Kirby.”  She parked her car at the end of   the right   drive,   and it did not take as long through  the zigzag path as the first time.  “That means   I’m   getting familiar with it ,   and   I’m not sure if that’s positive or  negative.   Just w ork fast, work hard, and get back to boring Seaford.”  He sat on the por ch in the rocking chair again ,   and she wondered if he ever sat  anywhere else. He stood when she got near.  “I’m back,” she said.  “Thanks for telling me. I thought I smelled you when you left the cemetery, but  sometimes I’m wrong. What brings you here today? ”  “I want more conversation about   Cherie,   and you seem to be the only one who  knows the truth.”  “Well, I guess that’s my   curse,   huh?   I wish the busybody had been promiscuous   so  you could spread the   batter   around. What is it today?”  She was on the   porch , lo oking for a chair and finding   none.  “Sit on the floor. I don’t anticipate   guests,   so I have one chair for me.   I can’t sit in  two.”  She shrugged and sat , leaning   her back against a   railing .  “ S hayne Wolf   is   working with me to hopefully correct my mistakes. D o you know  him?”  “I reckon I do. He’s the son of Victoria Rose and Noah Brewster Wolf. He’s quite a  good man. His father is the   asshole   of all   assholes   in prison for life. His mother is  deceased. What’s he doing for you?” ","“Right   now,   he’s looking for the p lants to go back on the tombstone. I thought that  was   the best   place to start corrections.”  “You thought right   this time.”  “He told me she was tried and executed as a   witch? Where was she executed? Do  you know?”  “Damned sure do! Bloody cowardly jerks!   Rott en bastards and bitches! ”  He stood and stepped from the porch. “Well, come along,   youngling .   I’m not going  to carry you.”  She followed him around the back of the house ,   and a pproximately   a hundred feet  from the rear porch stood a post about a foot in diame ter and around ten   feet   high. The  upper portions had many black   soot   spots burned into the exterior. She stopped a few  feet away and imagined the pain and terror she must have felt before she fainted from  the shock. She covered her mouth, turned her back t o the post ,   and   wiped some tears .  His hand on her shoulder   caused her to   jer k.  “They were frightened of her. They thought her inhuman , but they   were the  inhuman beings who tried and killed her. And yes, it was horrible. She screamed for  around   fifteen   minu tes before she couldn’t and then collapsed. The   winds whipped the  smell of smoke and burning flesh   that day ,   and buzzards and vultures were thick as flies  on a cow patty. They couldn’t wait ,   and some got burned t o try   to feast before it was  over. Then it w as   over,   and the honorable citizens drifted away without nary a word of  regret or sorrow.”  “Where were you?”  “Handcuffed and tied   to   a chair on the back porch where I could watch and see what  would happen if I picked up where she left off. Fools! All of th em. Cowards! Imbeciles! If  you feared her, you could have left the area. That was another option!”  “And that’s why you don’t have a chair on the back porch. I don’t blame you for that.  I wouldn’t want to see this reminder. Why do you leave it?”  “Because I   can’t touch it ,   and I can’t pay anyone else to   handle   it.   W e used to enjoy  the view back here. There was a garden where the post is now. We grew our own  vegetables,   surrounded by a n incredible flower garden . Everything   Cherie   touched was  beautiful, includi ng the town, until the school bus accident. She saved   twelve   children’s  lives and   two   of them with CPR , which   was a crime for the hicks of Denton.   T hey’d   have  preferred to bury   their young instead of keeping them around.  “She got hurt in the process, but t hat didn’t matter to the citizens. They mounted a  crusade against her and wouldn’t stop until they killed her. Idiots! Uneducated  buffoons!”  He said nothing   more but   left her and walked around the house and out of sight. She  took one last look at the black   burned spots and followed him.  He sat in his rocker with a glass of something like lemonade. Beside him sat another  smaller chair and a glass beside it.  “This was her chair. Sit down. I have no anger for you but a lot   against   the idiots in  their fine city . I don’t want to be found treating you with ill intent.”  She sat and picked up the glass. The lemonade smelled and tasted   fantastic .  “So, when the will is processed, am I going to be evicted?”  “Do I look that cruel?   Of course, y ou can live here until you   die, but I hope that’s a  long time ,   and I hope it’s in a friendlier environment than it is now. Is that fair?”  “Most fair, Kirby Girl. Thanks.” ","The smile wrinkled his face ,   and   he did not look mean or bitter for a moment .  He sighed and sounded tired of peo ple,   life, living, and   losing.  “Shayne will help you   with   what you want to do. However, watch your back. You’ve  been marked as   Cherie ’s relative ,   and some believe that blood and DNA never cease  until the whole family is destroyed. Your intentions may be pu re, but it will mean  nothing to   their   small minds.”  “Who told them? Never mind.   I’m known b ecause of the will and that lawyer, Walter  Arrington.”  “ Also, Roxana   Perkins , the town crier whose mouth   has been   often big enough   for  nine   people . You told her who   you were and what you   were seeking . Just be careful  about what you do and ,   most of all, how you do it.”  *  Shayne met   Robin   in her hotel room and found her   soberer   than the night before.  “Well, I had a pretty productive day. I located and picked some wild   milk thistle. I  also found some sage plants that were tall and annoying to the gard e ner.   I helped him  pull them all and have both in the trunk of my car.”  “That’s   wonderful   news.   What about   the hemp plants?”  “Difficult as I expected. Most people think it’ s marijuana and avoid it like it’s evil  and will ruin their lives.   So,   I made   some phone calls and located some in a   privately -  run nursery in Wye Mill. I’ve arrange d   to go and get some tomorrow. He told me they  were tall and   gangl y , and I said fin e . So, ou r bouquet will be complete tomorrow. How  about you?”  “I found where she was burned to death for being a witch. She brought two children  back to life with CPR ,   which   was enough for   punishment to rain down on her. It  happened in Clarence’s backyard while he   was handcuffed and tied to a chair.”  “Wow! No wonder the guy’s a recluse. I’d be that and pick them off one at a time to  eliminate the wasted flesh. I was always   curious, but   I was told he   wa s   weird   and  different. Now ,   it makes sense. Poor man. ”  “Roger tha t, and he warned me to watch my back and t ell you the same whil e  working and hanging out with me. So be warned of pending danger.”  “So long as pending sexual romps are part of the combo, I’ll buy a dozen.”  She giggled and mock - slapped him. “Some things are   better left implicit instead of  voice. You got me for a spell, my man. Just live right ,   and the spell can   continue   for as  long as we live.”  “Got that. ”  *  When morning arrived, the couple split up again.   Shayne   left for Wye Mill and  Happy Gardens Nursery ,   and   Robin   visited   Clarence with a request he did not like.  “I’m against it, Robin. Things like that can get you into more trouble than you can  get out of alive. You don’t need to burden yourself with that!”  “I’m not burdening myself, Clarence. Look, I un derstand that some of your   concerns  are   related,   like you’re my great - grandfather ,   and something is holding you captive here  on this beautiful spot of ground.   I don't like that, be it hell, Cherie, or some other ","demon .   But r ight is right ,   and wrong is wron g ,   and for this Kirby Girl, there will be no  shades of gray   in   family matters. I’m the only one left outside this place ,   and you and I  won’t live with the burden of a stubborn   Cherie   Pandora Waterman’s spirit   hanging  around to annoy people.  “I need to deal   with her, whether I like it or not ,   and I don’t.   H owever, I need a  common ground for negotiations ;   her book of spells will do that for me.   Afterward, I ’ll  burn it at the stake to stop this nonsense. Is that clear enough?”  He nodded with a deep frown and r ubbed his chin.   “Roger that, Robin. So, against  my better judgment, come inside ,   and I’ll let you into them. I’ve not touched them since  she did last.”  He took the   large   book from a chest in the living room and   laid   it on the kitchen  table. He opened three   windows to let plenty of light in ,   and   Robin   sat by herself and  began to read and understand   Cherie ’s Book of Tomes.  A phone call from Shayne broke the spell of the spells ,   and she rubbed her eyes as  she looked around the dim kitchen.  “Huh? Hey, Shayne.   What’s up?”  “Us. I’m back at the hotel ,   and you’re not here. Are you still in the enchanted  forest?”  “That’s a   snazzy   name for it , and   I am. It’s been a long and exhausting day.”  “Are you coming back to the hotel?”  She located Clarence in the living room.   “Clarence , do   you think it would be okay for  me to crash here tonight on your sofa? I didn’t realize it was so late. Would that trouble  or inconvenience you?”  “It won’t bother me at all. You look too tired to drive anyway. You need a safe place  for tonight   anyway ,   and here is the best place. Stay.”  “What do you mean by that?”  “ I mean ,   t he first tornado will hit tonight. Tell Shayne to stay in the hotel and sit it  out.”  She relayed it to Shayne. “Oh, there will be   five   tornados and   one   hurricane because  I di sturbed her grave. I guess so. She   must   show off her anger ,   and that will do it.  Anyway, r ide it out ,   and I’ll see you in the morning.”  “You’ll see me after you deal with a visit to your   workplace   to arrange the vacation  time you need.   So,   you better s nap   up and pay attention,   girlfriend.”  “Dang. You’re right. I’ve had so much   fun I   lost track of time. Thanks for the  reminder. I’ll call you on the way back. Is there anything you’d like from Seaford?”  “Just a woman name d   Robin Kirby. If you find her, bring h er butt back with you. I  like it.”  “Ten - four. I’ll see if I can hook you up. Bye. And do something constructive while  I’m gone.”  *  At 1:34   a.m. , a clap of thunder   shook the ground, rattled windows, and   jolted Robin  awake. She heard the wind howling ,   and   she huddled on the sofa and clutched a cushion  tightly.   At length, she exchanged   the   couch   for a   chair in the dining room . She sat   and ","watch ed   the tornado and its effects on the forest. Trees shivered   as   she did in flashes of  lightning. It wore on for   fort y   minutes and ended as abruptly as it started.  Lightning continued without thunder for several minutes ,   and she enjoyed the  strobe effects on the dark clouds that   slowly   disappeared.  She was still in the chair when Clarence woke her in the morning.  “Aweso me storm, huh?”  “I enjoyed it after the first thunder that happened inside this house. It was   exciting  but such a waste of time   and energy .”  “Agreed. Do you want some coffee?”  “That sounds   delightful   right now.” She   performed   some stretching exercises to  r elieve cramped muscles.  “Did she do that often?”  “Often enough for me to understand what was going to happen. I also learned that  t his house was a safe house for me. No matter what chaos happened outside, nothing  bad happened here.”  “Well, I’m glad of that . I hope Shayne survived it.  *  When she reached her car, she was damp from water dripping from vines and trees  in the maze . That did not deter her. She turned on the A/C with heat and knew she  would be dry   when   she   reached   Seaford. She slowed at   Cherie ’ s grave and saluted it.  “That was an awesome tornado, grandmother. Is that all you can do? Just beware  that I’ve sent a letter to Hades to see if I can enroll you in Anger Management Classes.  You can lay there, all dead, angry, and think you’re untouchable , but   I don’t think that’s  the truth after yesterday . You can run over   uneducated and plain ignorant people , but  not everybody. I’ll be back to see you later, and so you know, I’ve got work ers   coming to  add a tag line on your tombstone in advance. It will   read,   ‘ She’s still a sor e loser. ’  Toodles   and poodles, grandmother. ”  She drove through Denton,   resisted the urge to   check on Shayne or give him a call,  and   c hose to let him rest and have faith that he was okay.   Instead, s he listened to new s  programs about   the sudden and unforeseen tornado s, the failure of the Early Warning  System   in Denton ,   and   fourteen   reported deaths, 102 missing , and   more than   10,000  still without power. The last tidbit that had her whooping was   that   the Denton Hotel and  Casino had opene d two floors and converted three ballrooms to emergency shelters for  the homeless, anyone the storm displaced, and a nyone without power.  “Step out. That’s wonderful Public Relations as well as a humanitarian move. Keep  it   up, and   keep   my income stream flow ing!   I love it.”  *  When Robin   pulled into her apartment parking lot ,   her phone rang. She let the  Bluetooth answer as she opened the door to step   from her car .  “Hey, Miss Kirby. How are you? I missed you r presence   when I   a woke this morning.  You’re quite a ddictive .”  “ Yes, I   am. Did you like the impromptu tornado?” ","“I did enjoy it. I like storms anyway, but that one was a humdinger. I counted 132  lightning flashes after I woke up. You said more are coming? Will they be the same?”  “Don’t get too excited over   storms. Save that for me. Yes, they’ll be the same. Not  sure of the hurricane, but most pass us by. This one will not ,   and I   feel it will   be a  ballbuster.”  “Ouch! Can you give me a few minutes '   warning   since the weather station can’t?”  “If I   can, I   will.”  “You in Seaford yet?”  “Just got to the parking lot. I’ll call you later tonight. I have to pee right now.”  She disconnected with a kiss and locked the door when she heard a shout from  above.  Rachel waved at her wildly.   “Robin!   Stay where you are and call m e!”  She frowned but made the call while leaning on the car hood. “Hey, Rachel. What’s  up? Make it quick. I have to pee.”  “Then come to my apartment. Stay away from yours. We need to talk first.”  Rachel had the door opened for her and closed it behind her.   She waited ,   and when  Robin exited, she beckoned with her right hand. “Balcony. Silence until we get there.”  Robin frowned at the strange greeting , followed the woman,   and enjoyed her hips  swaying inside tight red denim shorts and exposing   attractive   sunta nned legs.   She  compared them to Ariel’s pale skin and longed to stroke Rachel’s   skin   but set her control  in place.  Rachel motioned to the   chaise and   sat in a chair. “It’s not safe to go to your  apartment yet. I probably shouldn’t involve myself, but I can’ t see you involved in an evil  mess. The police were   in your apartment for   seven   hours yesterday. They responded to  an anonymous tip ,   and I don’t know all the particulars, but they dismantled a large meth  lab ,   and they’re   looking for you big time.”  Robin fe lt as if she would collapse to the floor. “What? How the hell did   they do  that? I don’t use, buy, sell, or otherwise traffic drugs. What the hell?”  “That’s my belief, but they stayed longer and hit every apartment in this building for  a cursory inspection   for drugs or paraphernalia.   They arrested   three   people with  unregistered   handguns   and one   with   a collection of machetes and some pipe bombs.  And they have a warrant out for you ,   and they asked us not to tell or warn you, but  you’re an okay woman ,   and I don ’t want you to walk into it blind.”  “ Screw   me to tear s !” Robin said ,   and her Bluetooth chimed.   She held up a hand and  answered.  “Hello?”  “Hey, Kirby   Girl, b e careful. Start treading water so you don’t drown in the   Cherie  bowl. And do be careful when you st art working out messes. She’s not the pushover she  might seem.”  “Thanks, Clarence. I appreciate your advice and warning.”  The earpiece went silent ,   and she sat immobile and silent until Rachel touched her.  “Are you okay? Please don’t tell them I told you.   Are you going to run?”  “I won’t tell them. I’m not going to run. I’m going to fight because there was no  meth lab in my apartment. I’ll just have to teach the police that they were wrong ,   and  I’m a good girl and innocent of all they think I did.”  “How are   you going to do that? Did something happen in Denton?” ","Robin sighed and rubbed her face. “Yes. I touched something evil ou t   of love and  kindness. I wanted to make my great - grandmother’s grave look nice and loved. I didn’t  know she was evil and loved it dar k , eerie,   and dreary.”  Rachel gasped. “Oh, no! She was a   witch, wasn’t she?”  “You win the prize ,   and I hope   your   prize is peace and protection. Anyway, now I  have a choice :   run, give   up, or fight. I choose to   fight,   and I   will   ov ercome. I want peace,  respe ct, and love attached to my name and memory. And if it calls for divorce   from my  family , then so be it.”  “ Grandition!   How did the meth lab get there if you didn’t do it?”  “Through a witch’s helper. My great - grandfather   allowed   me into her books ,   and I  inha led them yesterday. Now ,   I’ll use them to fight against the evil that wants me  disabled, disfigured ,   or   dead . Give me   ten to fifteen   minutes here on your balcony alone.  Close the doors and pull the curtains. When I’m done, I’ll leave. Lock the door behind  me and let as many people as you can do the same, stay   in   their rooms, and   get some  fresh diapers   ready .”  Rachel jumped up   from her chair and   fearfully   stare d   at her.  “You’re serious, aren’t you? Never mind. I can see and feel it. You’re acting strange,  bu t it’s a   wonderful,   loving   strange ,   and it makes me want to obey you instead of calling  911.”  She winked and patted her shoulder. “Thanks, Rachel. You’ll be okay in the mix.”  “Rock on. In a way, this is exciting for me ,   and   now   I have the   crazy   desire to k iss  you, like   a real kiss . Is that okay?”  “Lay it on me and go. You’re okay. We’re both okay.”  Robin   sat by herself on the chaise . S he turned to face the front of the building and  the   fancy Draper King Apartments entrance sign .   She   savored   the kiss and the   feel of  Rachel’s desirous mouth.  “Wonder where all this woman magnet stuff is coming from? Is it part of her  highness’ assault? Oh well. I won’t let it bug me either way. So there, evil. That’s one  more blank shell in your six - shooter’s cylinder.   Give it   a spin ,   and let’s play. ”  She relaxed ,   closed her   eyes ,   and called up a page in   Cherie ’s Tome in her mind and  re re ad it.  “Okay, spirits and forces that work where the common er   cannot see or know listen  to   me   and bend your will to respond to mine. I ask not   with force but with   the  desperation of desire. Bend the veils around me and bring the evil for me to see and  command ,   be it desired or not desired.”  She moved her hands back and forth across her face and then let her fingertips  touch. She opened her eyes t o see   several   layers of color shifting and rolling toward her  and away from her like ocean waves. She remained immobile with fingers together ;   the  rolling motion   stopped,   and the   everyday   environment of the apartment building  returned. She gazed at the hed ge along the chain link fence to her left of the entrance ,  and soon ,   a   massiv e   dog with mottled hair,   fuming   red eyes,   and   drooling pale green  slime   from its mouth stepped from the hedge and raised its   wicked   eyes to meet hers.  “Greetings, Jaded Willow. Ar en’t you just the brave and   commanding   one? You can  work such destruction in people’s lives when they are absent, but you’re impotent to do  it when they’re present.  “You have no right!” ","“Spare me   your boring supplications ! You will speak   the   truth in my   pr esence   and  be mostly silent because   the truth   hurts you too much.   R emove the evidence   from my  apartment and   leave correction waves. I’m asking now, so I’d suggest doing it before I  make a demand because you will not like it . We   both know you don’t like to   receive pain ;  you only want to   give it. Hear me?”  He growled and shook his head as slobbers flew in all directions , hissing and  sending green puffs of steam skyward when   they   hit the ground .  “I hear you! I’ll obey and wait   for your screw - up! Then I’ll enjo y my reward.”  “You do that.” She picked up her phone and called 911.  “Yes, this is Robin Kirby from Draper King Apartments.   A few moments ago, I came  home,   and my apartment   wa s taped off by the police   as a crime scene . Will you send  them   to remove it? I   mu st   use the bathroom   soon . I   need a police car   to pee in   since I  can’t use my   bathroom .”  She dropped the phone in her pocket and stood   facing the slobbering dog .  “I know I’m not the one who usually calls you out, but   you will obey me in this cas e.  Then and   only then will you tell   Cherie   what transpired. Hear me?”  “I hear you, foolish woman. You’ll never be close to her!”  “That’s a given. I don’t wish to be like her.   I’d rather be like me.”  She walked downstairs ,   borrowed a chair from a ground apartment porc h ,   and  placed it at the inside end of the entrance sign . She   got   comfortabl e   while waiting , and  soon s he counted   seven   police cars screaming past her ,   surrounding her car ,   and racing  across the lawn with weapons out and shouting orders.  She laughed and wal ked to the main door when they were all inside.   Then, s he  walked up the stairs ,   turned left toward her apartment ,   and cleared her throat.  “May I help you , gentlemen ?   Is there   a   terrorist hiding here or what? Are you selling  tickets to the Seaford Police Ca rnival next month? This is a strange marketing plan if  you ask me.”  “Who are you?” demanded the closest officer. “Why are you here?   Clear the hallway,  now! ”  “I’m Robin Kirby, the one - woman - army who called for you to show up and correct  your mistakes. You m ade a boatload of them ,   and I want to send them on a long cruise  and never return to bother me again.”  “Get your hands up!” he shouted and waved his weapon at her.  “Spare me! Open my door and show me the meth lab and all the evidence of my  criminal activit y. Do it   now, or   get out!”  He signaled another ,   and the door was opened. They all went   inside,   and police  officers scratched their heads and mumbled.  “Well, where   are   the l ab and the   other   evidence?”  “These dolls wer e not here yesterday.”  “ Yes, they   were.   They’ve   been here for   many years.   I collect porcelain dolls. It’s a  hobby I’ve had since I was thirteen. They all have names. Would you like an  introduction?”  “This is impossible and crazy! I know it was here! And these frigging dolls weren’t!”  “Hey, watc h your language, sir. Some of these dolls are under   thirteen ,   and I don’t  want them picking up bad habits from supposed   responsible   adults!” ","He raised his voice to rage level.   “There was a meth lab, a big meth lab, right  HERE!”  She winced and covered her e ars. “No way! The meth lab was next door. It’s in 3 - c,  not in 3 - e.   And   if you removed it, I   am grateful for   your work . I don’t like my girls being  around low lives like that. I   want   them   to be   as pure as possible until they mature and  get married. Then it’ s okay.   Do y ou know what I mean? Do you have young girls at  home?”  “Shut up! Randy, check that out. I don’t believe this   kooky   bitch. Anyone so deep  into dolls   like this   can’t be trusted.”  Robin rolled her eyes. “You’re deep into the police force ,   and I tr ust you. I trust you  will not   make mistakes   as   you did here.   But   I also trust you to be a real man and admit  the mistake when you find it . Then you need to   correct   it   so it won’t damage innocent  people like m y girls and me .   And stop looking at them like th at. This is not a house of  sin! ”  There was a commotion from next door ,   and soon Randy returned looking sheepish.  “She’s right, Captain. That’s where we were yesterday. I recall the ocean painting on the  living room wall, pizza boxes in the kitchen, and the   evidence of the   lab anchors   on   the  floor and   the wall .   And   there’s   also….”  “Never mind. That’s enough.” He turned to Robin. He shook his head and glanced   at  the dolls and back to her. “I’m sorry, Miss Kirby.   Unfortunately, i t appears that we made  a terrib le mistake.   I promise I ’ll correct   it   so you won’t be separated from your girls.  They’re too   innocent   to throw into the foster care program.”  “Thank you , sir . You’re so kind. May I use the bathroom now?”  “Of course.   We’ll be gone when you get back ,   and I’l l close the door behind me.”  Robin stepped inside   the bathroom , turned on the light and fan ,   and covered her  mouth to suppress the laugh.  “Self, that   was so cool to experience so much power ,   and I’m sure it was very low -  level.   B e careful ,   and don’t get ad dicted to using it for   the   wrong purposes. Remember,  you are allergic to stakes and fire ;   even an EPI pen won’t save you from that . Don’t go  there. Still, that was damned cool. Yes!”  She went back downstairs to the front of the building and looked to the r ight of the  entrance.  “Jaded Willow, I now release you back to the Netherworld. And even though I know  it hurts you, thanks for your   brilliant   work today. And give   Cherie   my best regards.”  She   returned to her apartment, cleared   the remainder of the police   tape,   and called  Rachel.  “All clear, my friend.   The cops   are   gone,   my apartment is restored to me, and I’m no  longer on America’s Most Wanted Criminal List.”  “Wow! I’m sure happy about that.   But   m ay I ask, would it be   in appropriate to ask  for another real   kiss?”  Robin locked her door behind   the longing woman . “Can you wait until I get done  with my workplace? I’ve got several things I must do before   going   back to Denton. I’ll  call you when I get back, promise.”  “ You’re not joking?   You’ll let me?”  “Yes,   I’ll   let you kiss me.   However, I need to settle some other matters first. Then I’ll  make time for us.” ","*  Robin felt better as she approached the State building where she   worked,   but   her  entrance card did not   register .   So,   s he turned to the receptionists and a sked them to  open the door for her.  Shelly studied her and shook her head.   “You’re Ro bin Kirby, right?”  “Yes. I work in Motor Fuels Tax. Brandy Welch is my supervisor.”  “And she asked for us to call her so she can escort you.   So,   s ign in and have a seat ,  a nd I’ll call her.”  “ Sign in? I have a card.   There must be some mistake.”  “The only mistakes are the ones you made. Have a seat or leave the building.   It’s  your choice. ”  Brandy   arrived and   sat beside her with   a   cold   and quiet air.  “Hi, Robin. I heard about   the tornados in Denton. I’m glad you made it back safe.”  “So was I until now. What’s going on? Is there a problem with me?”  “Yes. I called the police ,   and they told me they were through with you and that you  were cleared. Are you?”  “If they told you that,   yes. I can’t believe all this crap is happening to me. It’s getting  on my nerves and   making me angry ! ”  “Sorry to hear that, but   you're not cleared here even if you’re cleared t here. We’ve  had several complaints about improper sexual conduct with your cust omers.   The  accusations are s erious enough to be discussed   and investigated .”  Robin glanced   at   the two receptionists , witnessed their false busy work,   and wanted  to slap them.  “Must we discuss this in a public place?”  Robin followed her   into   the Farmington   Room and sat exhausted in a chair b y   the  door.  “I can’t believe any of this. What’s the trouble here?”  “F ive   customers have reported you offering sexual favors   in return for making  adjustments in their records to save them money and taxes.   Three have said   you  accepted financial bribes   for   the same service, and so far ,   three   customers   have been  verified by   an   external audit. So, did you do that?”  “No. Do I look like the kind of woman to do that? I can’t believe all the crap that I’m  being hit with. It’s not   me. It’s not me!”  “What happened on that sudden vacation to Denton?”  “Ariel went to gamble. I went with her to help her driv e   and locate a relative I never  knew existed. I found her grave and tried to make it look loved , but   I don’t know. Maybe  her spirit   didn’t like that. My life has been dragged through a septic tank since then. And  I barely get time to straighten on e   before another   one   stomps into my path.”  “What did you do   with   the grave?”  “Threw away a bunch of dried flower stems from her tombstone. I   w ould   replace  them with fresh ones and   return a few times a year to change them . I guess she didn’t  like that. I found out from my great - grandfather that she was a witch and was burned to  death right outside the cemetery at her home. I guess she’s after   m e now.” ","“Robin, if anyone else but you told me that, I’d recommend you get psychiatric  counseling. I can believe you ,   and what you say might be true, but   you are on  Administrative Leave with pay until the allegations about your conduct have been  investigat ed . If there’s anything personal in your cubicle that you wish to take with you,  let’s go and get that now ,   and I’ll take your access card . We’ll surrender your pass at the  reception   desk,   and I’ll   contact   you   as the case progresses .”  *  Robin did not rem ember driving home   and   did not know she called Rachel on  arrival. She entered her apartment ,   sat on the floor before the love   seat, and   made an  unknown intense inspection of the carpet between her legs. She became aware when  Rachel’s worried voice reached   her ears and her body warmth pressed against her in a  hug.  “Hey, Robin. You don’t look well. Do you need to lie down?”  “That wouldn’t help .   You smell like oranges ,   and I love your warmth now in my cold  world.”  “Yeah, I made fresh orange juice for the kids ,   and the smell lingers on my fingers for  a long time.   So,   w hat happened to ruin your   festive   mood?”  “Life ganged up on me as usual. It just can’t stand for me to be   so   happy for too long.  So,   I stopped at the Donaldson Administration Building to arrange so me vacation time  and   learned they had that waiting for me already.   They placed me o n Paid  Administrative Leave pending an investigation from some of my customers. It seems I’m  a bad girl with tendencies   to   accep t   bribes and/or be promiscuous with them and   help  them avoid excessive tax payments. ”  “Oh, that’s   bullshit !”  “ I know that. It’s a continuation of the attack on me by   Cherie ’s spirit. However,  even if I don’t like it, the Administrative Leave   came   at a convenient time   because it  gives me lots of free   time to work on a   solution to help myself out of this mess.”  “You’re making me feel bad. What if I kiss you now?” She did not wait for an  answer ;   she just did it.  “Um, that helps. At least I feel connected to the earth and alive.”  Rachel kissed her again.  “You smell like oranges, but you don’t taste it.”  Rachel pulled her face back. “Look at me. Open your eyes. Are you cool with that or  this?”   Her hand began to explore Robin’s breasts.  “If I weren’t cool with it, I’d slap you and make you feel bad. Where ar e your  children?”  “In daycare. They like it ,   and sometimes I let them go   to   have a moment of quiet in  the daytime. And it also lets me get used to Frank going to kindergarten next year and  Susan the next. Thanks for worrying about them.”  “Then I’m cooler w ith you kissing me now.”  “Have you done this before?”  “Once with Ariel after the attack started. How about you?”  “Never considered it before this morning when you called and stopped by.”  * ","The cell phone   a woke her later ,   and she crawled around the   floor   to find her purse  and stop it.   But u nfortunately, s he could not find her purse   before it stopped.  “Where did the bus come from that hit   me   and knocked   me   into next week?”  She got to her feet, got her   bearings,   focused on her next task ,   and stumbled to the  bathroom. She returned to the living room ,   and the phone rang again.  “Hello. What’s up?”  “I don’t have to ask if you’re okay or not. I can tell you’re not. Do you have any plan ,  or are you running around scatterbrained and hoping to make plans on the fly?”  “Wow !   Thanks, Clarence. Leave it to you to cut through all the fog and slap me  alongside   the head. I’m not okay ,   and I’m having problems. I had trouble   with   the police  when I arrived home. I got that straight. I went to work ,   and I’m on Administrative  Lea ve for some stupid and dreamed - up charges against me. And I seem to be a chick  magnet, attracting them to me and   un able to say no to what they want. Does that sound  like   it’s coming from   Cherie ?”  “ It s ure does. Would you like some   insider information and a dvice without adding to  your problems?”  “Lay it on me ,   great - grandfather . I’m awake and listening.”  “You need stability more than anything right now. You’ve been hurt   and   lost a lot ,  and you can sound as brave as you want .   But   i t   has   hurt you and   more than   skin - deep.  You’re untrustworthy in the eyes of many peo ple in authority ,   and that’s bad   news   for  you. Who was the last woman?”  “How did, never mind, Rachel Gibson.”  “Her status?”  “ She’s   single . Her husband went to Afghanistan and is MIA. He disappeared an d  hasn’t been   seen for over   two   years. She has two children, Frank,   four, and Susan,   three,  and has never seen her father .”  “Strike a deal with her and take her in as a partner for now.   Then, a miracle will  happen in her life ,   and her children will find un expected care when you do . Do that   and  bring her with you when you   return   to Denton. Just her presence   in your life   will be a  benefit for you.”  “What about Shayne? I   liked him a lot. ”  “Shayne is Shayne ,   and he’ll be here. You need stability, not someone on   both sides  of the fence ,   whether he knows it or not.   He can't devote to you when he’s in a lawyer’s  pocket   when you’re not proven squeaky clean. Do I make sense?”  “Wow! Yes, you do. I never looked at it that way.”  “Because you’re too emotionally attached   to him ,   and that’s okay, but it’s not what  you need now. You need stability ,   and you need someone to watch your back. She’s there  for you .   So,   s trike a deal and don’t worry about using her. That is a form of love, even if  idiot psychiatrists want to argue   that it’s cruel and detrimental to the used   one . They’ve  never encountered it in their own life or from a witch’s   boredom - solving capacity.”  “And she won’t hurt from it?”  “She might hurt from it.   So,   what? She might get hit by a bus tomorrow.   So,   what?  Do   it and stop the negatives.”  “What about Shayne?” ","“He will be around.   But   h e needs to grow up and learn how to make decisions ,   and I  think that’s coming with his loving you. Are you on the way to Denton yet? You could  have been   ten   miles down the road with   all this jawing turned to driv e .”  “Clarence,   thanks for   y our words of wisdom.   I’ll be on the road   soon .   But   f irst,   I  must   find out what happened   to Rachel and finish packing. See you soon.”  She disconnected the phone and kissed it. “It’s   delightful   to have   salvation at your  fing er tips. Thanks, Clarence Lowbottom.”  She found Rachel standing at the open French doors by the balcony. She made it all  the way to touch her before she was aware.  Rachel whirled and had a hand clu t ching her breast.   “Man, you scared m e! I heard  nothing at all. How are you? I thought you might be dead or at least unconscious. Sorry ,  I went so crazy on you. It’s been a long time since anyone has touched me or, you know.”  “I survived. I   a woke feeling like a truck or bus   had   hit me. And th at’s okay. It’s a sign  of success anyway.”  “ You can’t hide some things, girl.   You need to go, don’t you?”  “Yes. Nothing will get done here except some more playing with you. I don’t look  forward to going into the coming battle, but I must or   else   dig a hol e for myself and wait  to fill it .”  “I understand.   Are y ou packed yet, or did you even unpack yesterday?”  “I did a little, but not a lot. I didn’t plan on being here too long.”  “Then go do that ,   and I’ll make a quick breakfast.”  “ Thanks, I   will , b ut   I need   to ask you something before I do . W ill you come with  me?”  She left the question at that and waited to see what would happen.  Rachel never broke eye contact. “Uh, why? Is there no one else waiting there for  you? Or is that the reason? Or is it something els e?   Did last night?   No, never   mind. Now  I’m back to why?”  Robin grinned and   pulled down   her lower lip.   She enjoyed the white teeth and   the  nois e when she released it , smacking   the upper one .  “I like that   problem - solving   solution. One, I liked it. Two, I wan t more. I ’m   a baby  superhero   emerging ,   and I need someone to watch my   back   so I don’t get killed in the  first two minutes of the battle.   As a baby, I also need someone with motherly instincts to  kiss all the boo - boos   I get. Five, I   need stability ,   and you   can provide th at.   Y ou’re a  mother   with   internal strengths to help me where others would fail me.  “I did flip out over a man there, but he’s deep into Denton   and   works for a law firm  and the city government.   That puts him on the wrong side because   the citiz ens of  Denton executed my   great - grandmother. The government officials turned their heads  and did nothing to stop it or   prosecute the killer mob afterward. She was a witch.   They  burned her and went   back to work. It’s okay. It’s no big deal. No one will ever   care or get  hurt by it. ”  “Wow, you talk a lot when you get wound up.”  “ Right, so t o that I say, ‘Simpletons! Educated nitwits! You don’t do something like  that and think it will go unnoticed or unpunished. I’ve opened the door ,   and I guess I’m  next to be   burned ,   so your problems will   disappear !   Let the earth open and swallow your  whole city ,   which will solve the witch problems   you didn’t have to start with.   But, at the  same time, it will remove a vast stupidness from the face of the earth. ” ","A smile worked   across Rachel’s face. “Step out, tiger. It’s a pleasure to see you react  when a little anger is cranked into the mix of   your   life. ”  She moved closer to Robin and lay a hand on her neck.  “That’s an interesting offer. I like you ,   and I get pleasure from just   being around  you. However, w hat will I do about Frank and Sue while I’m on a crusade with you?”  “ You would have to ask that.   I don’t know. We can’t take them with us. Do you know  anyone safe enough   who would care for them ?”  “Not offhand , because m y parent s don’t like Roger or anything about him ,   and the  children are his. My parents never ask to see them, visit them, or have them over for a  weekend. It’s like they don’t exist. The only one who might   at least   consider it would be  my sister, Charlene, who has n’t spoken to me in about twelve years.   I don’t know if she  would   talk to me   now.”  “Why the   breakup   for you and her ?”  She shrugged and made an odd face.   “Silly   stuff . She liked Roger and dated him  twice before he asked me out and cast his lot with me. She   thinks I stole him   to hurt her,  and she let me know what she thought of me in public ,   and then she’s been an iceberg  ever since.”  “Where does she live?”  “ She rents an apartment in t he sprawling metropolis of Milton.”  “Oh, gag me. The place where all queens   in the world   are made and trained. Give me  five minutes   alone   on the balcony,   then   bring me your cell phone and her number if you  have it.”  “What are you going to do?”  “Send her a pair of   crotchless   panties so she’ll be easier   to touch   in the future.”  Rac hel laughed. “You’re a nut , b ut   I’ll do it   to see what happens .   Are y ou going to  touch her?   Never mind. ”  “Can I   super size that order to include a cup of coffee and a tiny kiss?”  “You got it.”  Robin got comfortable and faced west toward Denton. “I know you   think you’re  doing things   properl y, but you’re not. It’s improper for such a widespread and lengthy  punishment over something that could have been avoided. I’m coming back. You might  close your ears to the rest of the world, but this itty - bitty piece of fl esh will be heard. I  love you ,   and I won’t stop until you feel it and return it.”  *  Rachel appeared, set the coffee on a small table,   kissed her , and handed   her   the   cell  phone.  “Her name is Charlene. Her number is on the screen. Just press the green call  button and   bon appétit . ”  “Wish her that   idiom . I already know the outcome.   She’ll gag and try to spit me out,  but I’ll be stuck to the roof of her mouth like gooey peanut butter.   Good luck on getting  rid of me. ”  “I’m starting to love you a little bit. Is   that okay?”  “Ask her that when I’m done. Better yet, wait until after she kisses my feet and then  ask her.   Then, s he’ll be much   humbler and more willing   to answer. Now sit and be  quiet.” ","She pressed the call button and waited. As soon as she answered, she   pressed the  Speaker button.  “If I remember right, this is Rachel’s number. What the hell are you calling me for?”  “ I ’m not Rachel. She’s busy   now , kissing my feet . She’s first. You’re next. Get your  butt   up   here to Seaford ,   and don’t take too long ,   or the   State Police will escort you. I  don’t have all day to wait for your whiney crap.”  She hit the end call button.  It rang almost immediately.  “ This is   Queen Robin speaking. How may I help you?”  “Who the hell do you think you are? There are no queens in Delawa re ,   and I’m not  kissing your feet!”  “I’m Queen Robin , in your sister’s apartment . You WILL kiss my feet   o f   your own  free will   or   be   tied to a chair while I shove them in your mouth. And how it happens is  no ,   never mind to me.   But f eeling your   lips on my fe et does matter ,   and it will happen.  Are y ou driving yet?”  “Who the hell are you? Where is my sister?   G et off her   phone and   let me talk to her!”  “Why? You   haven’t talked   to her for twelve years, why start now? Oh, I get it. You  know she’s kissing my feet ,   a nd you’re jealous. You wanted to be first. Well, tough titty,  Charlene. You’re second best, but   I’ll give you a critique after you're don e. You might  make   the front cover of   the Foot Kisser Monthly Gazette.”   She hit the end call.  It rang   again.  “ This is   Qu een Robin speaking. How may I help you?”  “What are you doing?”  “Sitting her e   minding my own business, feeling   delighted   while she washes my feet  with her mouth. What is your problem? Why are you annoying me? If you keep it up, I  might sue you for invasion   of privacy.”  “You can’t do that! I want to talk with her! Put her on the damned phone!”  “Man, you are   hardheaded , just like she said you were. Will you promise to come to  Seaford   when   we disconnect and kiss my feet? If you do, I’ll let her talk with you. I f not,  she’s on the next plane to Portland, Oregon ,   to   be held in   some gypsy camp   for  indoctrination for two days . Then she’ll be somewhere in the Middle East in a brothel ,  and you’ll never have that chance again.   And to top it off, honey, it will be your   fault  because you have a   hang - up   about kissing feet. ”  “You’re sick!”  “You don’t know me well enough to make that judgment. What is your answer? Will  you come and kiss my   feet,   or will you sacrifice your sister and her beautiful children?”  “Gah! Gah and Fuc k! Okay! I’ll kiss your damned feet right before I kick your ass  into the ocean! Now put her on the phone!   Do you think   I’m hardheaded? Take a vote  for   yourself, bitch! Miserable ass woman! Queen? Queen of what? Queen of   the A ll  T oilets   Fall F air?”  Robin h anded the phone to Rachel with a huge grin and a blown kiss.  “Hello, Charlene. How are you doing these days?”  “I’m fine! Who’s that crazy bitch? Is she sane or an escaped mental case?   Do I need  to FEDEX you a   straitjacket   for her? Damn! ”  “She’s a queen ,   an d I was kissing her feet. I’ll kiss more than the m   when we hang up.  She wanted to break the ice because I   sincerely   need your help. I’m coming out of the  closet, sis. I’m in love with this woman   and   leaving Seaford with her. I wanted you to be ","the first to   know because even if you hate me, you’re still my sister ,   and you need to  know.”  For a few dreadful ,   silent moments ,   the whole world stopped turning, and nothing  would ever move again,   breathe   again, and no heart would beat again.  “Oh ,   b rother ! You’re not   joking, are you?”  “No ,   I’m in love ,   and I must leave with her for a time,   and in leaving, I have a huge  problem. I’m going into a battle with her ,   and like Roger, I’m not sure if I’ll make it back  to Seaford alive.   There’s a good chance for a return in a   body bag   and a plywood casket .  So,   I need someone to watch over my children until they can stand   on their own . And  even if you’re angry with me,   you’re   t he   one   person   I ’d trust to do that for me.   But   I  must   go, and I can’t morally put them in danger   with m e . Will you overcom e your anger  and take care of them   for me?   Even if it’s for their sake and not mine? ”  Charlene   breathed heav il y on the line until she spoke with a   much - subdued   voice.  “Gosh, Rachel! What a shock. What a surprise!   I n that case, I’ll be gl ad to take care of  them for you.   How are you doing, other than preparing for a battle? What battle?”  “I’m doing as well as I can without Roger. It’s   difficult ,   and men keep sniffing  around the widow’s lair. And it’s a pain in the ass because no one can rep lace him.   So,  t hen I cry and stop and go on with life.   But   t his unexpected angel   appeared,   and I  c ould n’t say no. I’ll take a risk with her ,   and   she’s going to fight in the battle .   It scares  the piss out of me just thinking about it, but I MUST go.   I can’t   sit her e   and let her go  alone. ”  “Wow! I never   expected a phone call like this. Where are the children right now?”  “In daycare. I take them there sometimes to get used to being alone in the day.  Frank start s   kindergarten next year and Sue the next .”  “Ouch!   They sure grow up fast. The battle?”  “The battle is with a dead witch who can’t accept th a t she’s dead. She’s   almost  destroyed Robin   and Denton, Maryland,   and   I don’t like that. So, I’m joining her.”  “You still live in Draper   King   Apartments?”  “Yes ,   I   hav e lived   in the same place since our last accidental phone call.”  “I’ll be   there   to see you after   six tonight. Does she   truly   expect me to kiss her feet?”  “Yes, she does ,   and it’s not horrible. She does wash them and keep s   them clean.  She’s not a gross quee n.”  “Okay. I’ll suck up my irritation and   kiss   one for the team we are.”  “Thanks so much, Charlene. I look forward to seeing you.”  Robin burst out laughing when she disconnected.  Rachel laughed with her and wiped   her   tears.   “You’re a   serious   nut case , girl .   Selling  me into White   Sex   Slavery .   Wow!”  “Hey, it worked .   C’est l a   G uerre! This is war ,   and anything goes to help you win.”  “ Wow, did   it work !   Thanks so   much, and   be prepared. I know her. She’ll kiss them  first thing.”  “ Then both of us will benefit from   that loving gesture. ”  Robin’s   cell phone rang.  “Hey, Ariel. What’s going on?”  “You are. I heard you got fired over silly   bullshit . Is that true?”  “It’s not true that I’m fired.   I’m on   administrative leave with pay until the  investigation is over. It’s not   true that I’m a sex y   slut like they think. They’ll find that out  on their own.” ","“Are you home? Can I stop and see you?”  “Sure. You know where I live. Come on over after work and visit.”  *  Ariel arrived first ,   and Robin let her inside.  Robin hastened back   to the sofa ,   where Rachel stretched out ,   laid   her head against  her chest ,   and got comfortable.  Rachel fed her grapes by first putting them in her mouth, getting them wet, and  then moving them to Robin’s mouth , sometimes with a kiss .  Ariel did a double - tak e and looked confused a moment before seating herself on the  love seat. She watched the transaction through five times ,   and each was followed by  giggling and kissing. She cleared her throat ,   and suddenly she was recognized.  Robin sat up and   laid   her left a rm on Rachel’s legs. “Hello, Ariel. You   look well. You  know Rachel ,   I believe. She lives on the second floor in the center of the building.”  “We’ve met before but not formally. Hi, Ariel. Glad to have the time to talk with  you.”  Ariel collected her scatter ed thoughts and emotions.  “So, Robin, how long is your suspension? Did they say?”  “Brandy went with me to empty my cubicle of personal items and turned in my  access badge at the desk on the way out. She   said she’ll be in touch with me , but she  never put a   time limit on its ending .”  “Bummer .   When are you going back to Denton? Or are you going with the paid leave  in progress?”  “I’m going back , and   Rachel is going with me to help me this time.”  “Oh. When is that?”  “ I’m trying for   tomorrow.   So much   of the timin g hinges on Charlene, Rachel’s sister,  getting the children organized and gone or moving in enough to release Rachel.   I h aven’t  worked that out yet.”  “Oh.   S ince you’ve got everything under control, I’ll mosey on home , and best of luck  to you guys. ”  She wal ked toward the door ,   and Rachel poked Robin and motioned for her to  follow.  Robin caught her by the door. “Hey, Ariel. I’m sorry. That was tacky to let you down  that way.”  “ Let me down ? I hadn’t noticed from inside my bag of dog food. Why didn’t you just  t ell me on the phone?”  “Ariel, I didn’t think it was serious on your side. It didn’t hit me until I heard you r  disappointed ‘oh ,’   and it was too late. I’m sorry. Anyway, I don’t know how   long   I’ll be  with her ,   and I did hook up with Shayne ,   and wow ,   is he w onderful! I can see us being  together, but I need her for the moment. She’s in a current no - win situation ,   and I   see  no   way   out for her, and she won’t hurt if I pull away and go with Shayne. You would. Am  I right?”  “You are. You still suck, but you’re righ t. I guess it’s better to separate now instead  of killing you later.”  “There you go. Can we still be friends? I don’t want to lose you all the way.” ","“We’ll see on that one. For right now, let me go. Good luck ,   and that’s for real. Call  me when Denton is se ttled.”  *  Rachel met   Charlene   at the door ,   and their first hug was awkward but welcome.  Charlene held Robin’s attention and went straight to the sofa. She knelt and caught  one foot and removed her shoe and sock. “Hmm, doesn’t smell too   bad,” she said and  kissed the top above her toes.  “Sorry for my behavior on the phone, but you caused a lot of that . ”  She   removed the remaining shoe and sock. She kissed that foot and put it on the  floor by the first one.  “Well, does that satisfy the queen? I’m not going to   get kinky for your pleasure.”  Robin wiggled her toes ,   placed   her feet on Charlene’s shoulders ,   and   rubbed   her  head   with her toes .  “That works for me.   Of course, y ou can do that any time, but a simple hello will  work.”  Charlene   placed   them on the floor aga in after a second kiss.  “Keep them clean like now ,   and I don’t mind.”  She glanced   at   Rachel. “I argued with myself all the way here about your sanity, but  now that I see her   and taste her feet, you made an awesome choice. Welcome to the  family, Queen Robin .”  “You can drop the queen nomenclature. I did that to   make you angry .”  “It worked, my queen. Are you really going to fight with a witch?”  “Yes.   Cherie, the witch, was   my   great - grandmother , but that doesn’t make what  she’s doing acceptable or right.”  “And   could   it turn into   danger?”  “No doubt about that. She’s   almost   had me arrested on meth lab charges ;   I’m on  admin leave with pay while the State investigates my bad   financial and   sexual habits  with customers. Then there was that tornado in Denton. There wil l be   three   more and  then a hurricane. After that, who knows.”  “Wow! I have faith in you and   my sister . Have you sampled her sexually   yet   at least  once?”  Robin frowned ,   and Rachel cleared her throat.  “Oops. I guess I don’t need to know that. Sorry. It was a   n atural curious response  from me. ”  “That’s my sister.   She’s vividly   brash.”  “Hey,   Rachel,   you'll never know if you don’t ask .   That’s what you   always told me.”  “ You’re a trip,   Charlene.   Yes, we   have done that once. It knocked me out for a few  hours. She’s   got a lot of sexual tension   from   being without Roger for so long. I can deal  with it. I’ll take   knock - out sex over boring   hand jobs   any day of the week.”  “Awesome! That’s my sister. So, Rachel, where are the children?”  “Downstairs with Renee’s trio. They w ere still pretty wound up from   daycare,   so I let  them run free with her. She has a mountain of strength and patience.”  “Well, let’s get them up here. Should I come and stay in your place until you’re  resolved,   or should I take them with me to Milton?” ","“Tha t’s up to you. They’re adjusted here, but they’re not in school yet. They would  maybe make different friends at your place ,   which   might   be   good. Just take them to  Milton. We’ll pack their clothes for a month and play it by   discovery after that.”  “Then that ’s settled. Do you want to   help , Queen? Or do you have a nail  appointment?”  Robin stood and stretched. “I like you, girlfriend.   So,   l et’s go and get the hyperactive  bundles ready for a new journey   and life experience .”  The children liked Aunt Charlene and   were excited to leave with her. They kissed  Rachel goodbye ,   and   silence   settled onto the couple left behind.  “So, what do we do now?” Rachel asked.  “I have no clue. Why don’t you call your mother and see if she has some  suggestions?”  “ I’ll do that.”   She h ad the cell phone in her hand before she shook her head. “No.  Whoa ,   on that! I know what she’d   suggest,   and I don’t want to hear it. How about we  watch some television and go to bed later? It will be cool sleeping with you for one  night.”  *  Morning sunli ght failed to bring light and happiness into Rachel’s life.   Instead, s he  sat at the kitchen table, hunched over her coffee   cup,   and star ed   at the clock   on   the  stove.  “ Sobering night ,   wasn’t it?” Robin asked and used her fingernails to run around her  back a nd shoulders.  “Yes , and y ou weren’t kidding about the possible danger . ”  “No   need to kid over that . Are you having second thoughts about going with me? It’s  okay. I understand ,   and I won’t blame or hate you.”  “Hah! You might   not, but   who would you take to b e your sidekick if not me?”  “I’m not sure about that. I   imagine I would   ask Ariel to accompany me.”  “Screw that! I’m better for you than her. The love I’m starting to feel ,   and   t hat  wonderfully comfortable connection with you is too much to ignore. I might   have second  thoughts. I might have third thoughts. However, when I’m there by your side, thoughts  are all they will be. I might think   to   haul ass, but my feet will remain solid.   So, no more  asking if I want to abandon you ;   I don’t ;   I won’t.”  “And if you h ave another nuclear grade nightmare and pee the bed? What then?”  “If you can get over it, then so will I. That was more embarrassing than frightening.  I promise I’ll get faster on sorting out attacks and accidents. When you were bantering  with Charlene in   phone tag, you said C’est l a   G uerre. I guess it is war ,   and   she will use  anything she can do to diminish or stop us . ”  “Yes.”  “And what can we do against her?”  “Not a whole lot   yet . I’m sure she has a weakness ,   and I’ll have to find it.   W hile I’m  looking fo r it, I’ll find ways to stop the minor to major attacks that serve to wear us out  and keep us disorganized, which helps   and thrills   her.”  “And while we’re doing that, we’ll explore ourselves, I mean each other. We need to  be stable and trust each other in   all matters. Is that a fair statement of a plan?” ","“That’s why I asked you to join me ,   and I’m happy the rest of us is working well. The  trust is working because we can’t have sex without trust, and we can’t say I love you  without it. ”  “Alright, so what do   we do today?”  “Have a small breakfast, do some shopping, and drive to Denton before nightfall. I’d  like to be   at   Clarence’s house before the sun   goes down . And we’ll have to backpack in  what we buy. There’s no road access, just a path through a thick hedge   line.   It’s not a  long distance, but enough for your legs to notice a workout. ”  “Sounds isolated.”  “It is, but Clarence told me it was very well protected also. I’m counting on that to be  true   for us also . It’s a   perfect   location for our base of operations .”  “Oh, I just love the way you use military terms. C’est   l a   G uerre, battle, base of  operations , and nuclear grade nightmares, all   turn me on. Do we have to go shopping  now?”  “Yes.   Control yourself. You can get turned on later.”  “Okay,   spoilsport .   What is   y our small breakfas t ?”  “A toast ed   sandwich with one egg, one slice of cheese, one slice of   tomato, two or  three slices of   avocado, and some hot sauce drizzled on one piece of bread.”  “And I reckon you have all that here in your kitchen?”  “If I didn’t, I’d   have said something else. You’re not cooking yet?”  “Oh, I’m   cooking,   and you’d better hope my damper opens in time or POW!”  “Like ,   I’m scared. I’m going to change clothes; you can work as - is. I’ll be back in a  bit.”  *  The   two women made three trips with   the groceries they bought and   prepared   for  the fourth and final   hike   from   the   car to   the   h ouse .  “ Your   grandfather seems lik e a very nice man.”  “He is, but I don’t understand how. I don’t think I could live with someone or  something so evil for so long that   it didn’t influence me to some degree.   Do y ou know  what I mean? If your parents were like mine, after time ,   they   started acting or behaving  alike in many situations.”  “Now that you mentioned it, I recall that. I just never considered it important.”  “Under   normal circumstances, it’s not, but   I’m not so sure under the present  situation .”  Rachel caught her shirttail and stopped her. “What do you mean by that? Do you  think Clarence is helping her?”  “That’s not what I said or meant. I   mean, that’s   why I want yo u here   to   be   the eyes in  the back of my head when I’m otherwise distracted. Doing one thing intentionally and  doing the same thing out of habit   are   two different items. One is thought out and  planned . The other is a way of life and   rarely or   never reaches   conscious level . ”  “ This is interesting, so c an you give me an example of that?”  “ Last night ,   you intentionally slept with me. You hugged me and played with my  nipples,   ears ,   eyelashes, and mouth. However, when sleep took over, you were on your  right side ,   and I had your back presented   to me . Until the moment of sleep, you acted  consciously. Afterward, you   succumbed to habit,   as you’re used to doing alone.” ","“So, my love was not strong enough to override what I’ve done without knowing for  so many years. Cool.   I get it, and it’s not a problem. However,   since we’re dealing with  powerful forces, Clarence might have a problem . His habits might work against us if  we’re not aware of   them . Well, pleased to meet you, Robin Kirby. My name is  Consci ence ,   and I’ve got yo ur back.”  “Wonderful. That’s all I can ask for   now . Do you like the house?”  “I love it. Is it going to be yours someday?”  “As soon as I get   Cherie   Pandora Waterman resolved, I’ll go from   a   pauper to   a  wealthy woman.   Then,   I’ll bypass the rich bitch part of   the   money and enjoy life.”  “ Will y ou do that? How will you handle not helping people?”  “Oh, I’ll help them, but I won’t dole out money without recourse.   I f you want help,  I’ll help, but you’ll commit to helping yourself first. Just give you money with a s mile ,  n ope. I’ll give you money with so many strings you’ll walk away broke or make  something of your life.”  “That’s awesome   if you stick to that. You’ll have a better kingdom than any other  millionaire queen.”  Clarence opened the door for them on the las t trip and watched as they put away  groceries and carried two suitcases to the   bedroom,   which   he showed them. Then they  all sat on his front porch with Rachel on the steps.   She relaxed and broke the silence.  “You have a beautiful place, Clarence. How long   have you lived here?”  “Fifty years, give or take a few months.”  “That’s nearly a lifetime. Wait a minute !   Something doesn’t compute in that.”  She turned to view him and blinked several times as she thought. “Just how old are  you?”  “I’m 85 right now. I’ll b e 86 in   nine   months if I live that long. Is there a problem  with that?”  “I’m not sure, but you and this place are out of sync. You’re older than you look ,   and  the place, the yards, the hedges, the house   feel   older than that. It’s bugging my copasetic  nerve s enough to keep me on edge.”  “Are you okay, Rachel?” Robin asked.  “ This happens to me when Frank and Sue try to   put something over   me.   I’m fine,  but Clarence and this place   are   not. I’m here to watch your back ,   and I will.   However,   I  never said I’d watch   his   back . You can’t store a glass of water on a board   tilt ing   at   a  thirty - degree   angle. It   won’t work unless   the board ’s sitting   straight and level .”  “What’s that got to do   with him and us?”  “It’s not straight. It’s tilted , and   Clarence   i s tilted more than   the house and land.”  She stood and   f ace d   him. “There’s something wrong with the math. When were you  born?”  “I was born on December 15, 1881. ”  She hooked her thumbs in her jean pockets and leaned forward. “No. If you were,  then you’d be 134 years old right   now.   So, why do you   say you’re 85? You’re very tilted,  Clarence.”  Robin was on her feet ,   rubbing her arms as if chilled. “That’s not right, Rachel. You  have to be wrong.”  “He just spoke and told us when he was born. Is he a liar? Wake up. I’ve got your  ba ck. Run with it.” ","Robin straightened and studied his worried face. “She’s right. You say you’re   85   and  will be   86   in   nine   months , but   th at   ninth   month   never comes ,   does it? Roxana told me  that Lowbottom   folk s are for real homeboys. I don’t know about the r est, but you are  one. You’re stuck here. You can’t leave.   Cherie   did something, maybe put a curse on you ,  and you’re sitting here waiting to die, but you can’t, and you can’t leave. Is that tru e ?”  “ Well done, Ro bin Kirby! With   Rachel’s   help ,   you cut right   to the bone on that one.  Yes. I’m stuck here. It was 1916 ,   and the government was drafting people right and left  for the war in Europe. I was in love with   Cherie ,   and   when my number came up, I wasn’t  so hot to go . She wasn’t hot about losing me either. ”  “D id you know   she was a witch?”  “No.   Her daddy had this   place,   and he gave it to her when she asked for it. I didn’t  know what was different about her, only that I loved her. She invited me to spend a  weekend with her ,   and   I accepted. She asked   me   to be h er   husband and liv e   on the land  with her. She promised me protection from the government and all prying eyes if I  would stay with her past the weekend. And like a fool, I did it without thinking. I didn’t  understand her protection for about   four   months when I   tried to leave. I couldn’t. I  asked ,   and she told me she co uld not protect me from anything evil if I crossed the  property's borders . And I couldn’t. I tried several times ,   and each time she grew more  frustrated ,   and we   argued,   and she told me   she was a w itch and proved it.  “It took me some time to accept it, but   I adjusted, and I enjoyed life when I did .  Until the accident ,   and then the vigilantes burned her. They didn’t do me a ny   favor s . I  was still stuck ,   and after a while ,   I realized I wasn’t   growing o ld   either . It sucks ,   but I can  do nothing about it. I should be 134   and   buried   long ago,   but I’ll never see it.  “On the bright side, I can go anywhere on the 62 acres I want   to   and go into the  cemetery on the one stretch of road to her grave. And I have. I ’ve gone there and cussed  her out for what she did to me.” He shrugged. “It changes nothing, but it makes me feel  good for a while.”  “That’s not right, no matter the reason it was done. I’ll add that to my list of wrongs  to correct. It’s not that I don’t l ike   you, but   living forever runs against nature to o   great   to  ignore. That’s not a punishment , torture,   or burden   I’d wish to bear.”  “Don’t fret about correcting that error because I’ll go without a fight and be happy  about it. I was ready to do that 85 yea rs ago.”  Robin turned her attention to Rachel. “How are you doing? Are you ready for bed ,   or  are you still energized like your children?”  “Energized. What’s on your mind?”  “Clarence, are   your   guests included in the protection of this house an d   area? Since   I  can go and come   with ease , where do I fit in the protection plan?”  “It should work because you’re inside the dome or whatever she created. Once  you’re beyond that, eh, I don’t know. I’ll repeat Rachel’s question, what’s on your  mind?”  “One, I want to go   and visit her gravesite. The second and stronger tornado should  hit us between midnight and 2 : 00   a.m.   I want to be on the front porch while it happens.  I want to see how she does it. Since it’s abnormal, it   must   be created, and if it’s created,  it can be t erminated. Knowledge gained is a   positive   thing in this case. The more I know,  the more I can resist and   bring   back in a fight.”  “Amen to that . Yo u’re far from the   dizzy   child you were when you first got here. You  should be protected there.   It would have t o fail everywhere, and I don’t think that’s what ","she had in mind for it to fail there . That would be too simple and release me from the  trap she laid so well.   Watch and learn.”  He stood and yawned with a wild stretch of arms. “With that said, I’m going ins ide  now. Be careful ,   and I’ll see you in the morning.”  “Rock on , Grandfather .   Rachel ,   you call your children and let them know mommy’s  okay ,   and then we’ll go to the cemetery.”  “What are you   going to do   there?” Rachel asked.  “ Play   lawyer. I’ll tell the jur y what I’m going to do, then remove the glove and slap  her   to start the duel . I don’t want to drag this out another 85   years   or more.”  *  Robin enjoyed the chat between Rachel and her children and then her sister.  Finally, e xcessive kisses were exchanged ,   and then it was over.  They walked to the cemetery   together   and stopped at   Cherie ’s grave. She smiled at  the bouquet of plant stems without flowers l ying   on the tombstone under a   sandstone .  “Hey,   Cherie , your   granddaughter’s   back. Did you miss me? I missed   you.”  Rachel watched her in silence and   often   looked behind her, half expecting to find  something dreadful lurking. She   scold ed herself for being foolish and taking up with  Robin on a whim   and a rush   of affection versus logic . However,   overall   comfort aro und  her kept her holding on to see what happened next in life events. Like she told Robin  before departure, her thoughts of leaving   were fleeting and never acted upon.  “I guess you had   a   remarkabl e life before you died, huh? I’ve had time to   think,   and I  d on’t see you as a witch from birth. I can’t see your mother holding you on her lap and  telling you that you are different from other women. You’re a witch and will wield  immense power over all other humans in your life. And when children are born, they  wil l carry the genes of witchery into future generations for all the time   that   people   will  populate   the earth . That didn’t happen   to   you. You never had a family meeting wi th your  parents and friends and came out of the closet and declared yourself a witch. Pe ople  with sexual   tendencies   do that today. You did not.”  Rachel gasped when the sky became darker than she imagined possible. And the  snowstorm   that accompanied it with   gale - force winds had her   freezing   and struggling to  rub her arms and move her fingers.   She attempted to move closer to Robin but found  her shoes frozen to the ground. She stepped from them and shivered more than before  as her feet touched the icy gr ass .  “This is impossible! It can’t happen!”   She   took two steps toward her goal.  A huge calamit ous noise diver t ed her attention ,   and her heart stopped at what her  mind said was more impossible than the   snowstorm .   An   armor - clad knight on a  massive ,   enraged   steed, with black smoke and flames discharging from its muzzle,  charged   from   the entrance and d own the drive . The entire presentation of man and  horse w as   cloaked in resolve, and   a   flashing steel   lance lowered to destroy his   target ,  Robin,   at all   costs .  “What the hell?”   S he   forced the words   in a scream that motivated her and freed her  to move. She r an and lunged to grab Robin and jerk   c lear as   a passing gust of   wind  slapp ed them with a stench of sweaty horseflesh and   burnished   steel.  Robin   exerted   a great effort to remove Rachel’s clinging hands and got   both   to their  knees. ","“What? What happened?”  “Yo u didn’t feel or hear it? Incredible! Look. It’s going to take a second shot at  destroying you.” She pointed   to   the parking spot   where the knight turned his horse .  “Oh, crap!” She scrambled to her feet and kicked the tombstone. “What is wrong  with you? Do   you think that’s   proper ? I wish I could do something to you , in turn,   to let  you suffer some for your wrongs, but I can’t. And even if I could, I have the common  decency to choose NOT to do that. But you go right ahead,   Cherie . Do your best to kill  me and   destroy all around me. If you succeed, then what? What will you do when there’s  no one left to   harass   and kill? Will you take it to Satan and start on him? I don’t   think so.  He wouldn’t put up with your crap more than a minute before you became nothing.”  S he picked up the bouquet from the tombstone and   removed   one stem of sage. She  helped Rachel stand and hugged her.  “ I’m s orry you got involved in this ,   but   I need your help now. Just please trust me.  Please, dear Rachel.”  “You’re wild and crazy, girl! What   do you need?   Speak it ,   and it’s done. ”  “Stand on   top of   her grave and be a target for the knight. Close your eyes,   stand  facing him,   hold your hands behind your back and trust me.”  “You’re nuts! Trust you? I want to slap you silly right now!   Just t ake all   your  witchery and get the hell out of my life!”  “Please help me, Rachel. I wouldn’t ask it if I knew you would die from it. I can’t do  both things I need to do here. Come on, girlfriend. Trust me.” She gripped her arms and  kissed her.  “Okay. If it doesn’t   work, you r   ass is haunted forever. Hear me?”  Robin grinned and turned her around to face the drive. “Hear you. Hands behind  you. Close your eyes. Grand. Don’t move.”  The ground   and her body   vibrated from the pounding hooves ,   and Rachel did not  lik e the fee ling they instilled in her mind   or the fear of not knowing what   would   happen.  She imagined the lance cutting her in half or being tossed and crashing into tombstones  all over the place.  “Stop it!   Shut up, mind!   I d on’t need this!”  She tightened her eyes, l istened to the   swell   of hoofbeats, and prayed to see the  morning sunrise   and her children again .  She never   imagined   such an enormous horse could   bellow, but   the one charging  toward   her   did   so.   She could not see it stop so   quickly   that the knight   sailed   ove r her  head and broke two cement angel tomb markers. She could not see the horse standing  on his hind legs, pawing the air against some invisible creature.   However, s he did feel  the blood and intestines when it was ripped   asunder and   cast aside like lint du st. She  screamed, peed herself ,   and fainted.  “Hey, sweetheart. Come back to me now. Rachel? Come on. Let the fear go and  come back to me. Come on. You can do it. You’re okay.   You were safe then.   You’re safe  now.”  Rachel returned and scrambled up with Robi n’s help.   The first thing   she did was  slap her.  “Safe? You say   I’m   safe? Who the hell can be safe anywhere around you?   I need to  go to San Francisco , join a free - love colony,   and never see you again! Be a target for you?  I hate you right now!” ","“ I’m s orry y ou feel that way , but I don’t blame you . Do you want me to leave?”  Rachel grabbed her and hugged her like a teddy bear. “Leave? Don’t you dare do  that to me !   That was horrible, but I’m alive ,   and I just love you   a little   less than I did an  hour ago.   Howeve r, I’m strong enough to bring that back to normal soon.   Damn! That  scared the piss out of me. And I mean that for real. ”  “I know. I think I’ll start carrying around a web camera and see if I can sell a few of  those accidents on the Internet. Might as well   make a profit from it if I can.”  “Do you see me laughing, demon clown? Just stop that thinking and think about  how to stop   everything   before it starts.”  “Yes, dear. I’ll do that. Can you make it up on your own now?”  She stood with   little   help and turned to   view the cemetery. The horse was in two  pieces ,   and entrails   were   scattered in all directions, hanging from tree limbs and  tombstones.  “I need to shower and get off what hit me.”  The knight stirred and ,   with   great   difficulty ,   made it to his feet.  “Robin,   do you see that?”  “I see.” She moved to   Cherie ’s grave and crossed her arms   over   her chest. “Look,  great - grandmother , it’s v ulgar   and downright impolite to interrupt   the conversation   and  try to kill people speaking to you.   So,   m ind your manners and don’t d o that again.  Instead, s end your knight packing back to where you found him. If one piece of   sage   can  do that, I’ll shove the whole bouquet up his backside and really mess him up. ”  The knight refocused on the women and advanced again, on foot and with his   sword  drawn and ready   to mete out death .  “Robin , h e’s on his feet and coming again!”  “Stand still and don’t pee again unless it’s on his helmet.   Cherie , you need to pay  attention. You kn e w I was not a witch from birth ,   and you also kn e w that I would find  y ou and   end   the silliness. When you’re wrong, you’re wrong ,   and all the death and  destruction you   implement or   call out will not make it right. Leave Rachel alone and  send him away to his proper place!”  Rachel watched her and the knight and heard   the birds   before s eeing   the m .  “Robin! From the entrance! Five falcons headed for us ,   and it’s not to share their  love!”  Robin looked at the grave with sadness. “You should be ashamed of yourself,  Cherie . ”  She kept her eyes on   Cherie ’s name and snapped her fingers on   her right hand.  “Sorry, falcons, but I don’t like you all hard and crunchy. I like   falcon   meat, but only  when tenderized.”  She formed a picture in her mind and lowered her right hand.  The falcons went into attack mode and dropped toward s   her. They all st opped and  appeared to crash into an invisible wall with an expenditure of speed, blood, guts, and  feathers. They all fell to the ground around the knight. Abject silence   engrossed   the  cemetery ,   and when it   vanished as   swiftly   as it started,   so did the knig ht, the falcons,  and the horse. The evidence of their encounter with Robin, the destroyed and damaged  tombstones and trees   with hanging entrails   remained, but nothing else.  Rachel hurried to her and clung to her like a lifesaver.  “Girlfriend, you’re a mess   and scary to hang out with, but your love is worth it.  Thanks for saving my butt several times tonight.” ","Robin picked a few leaves   from   her hair. “I’m rather glad I’m alive t o   hear that.”  “Do you think I’ll be able t o   sleep tonight or ever again? That sca red me   senseless .”  “I think you will.   Let’s go back to the cabin now. We’re done here until the next  round. I want to get some sleep until the tornado hits. Then it will be time to work again.  Can you handle it?”  “Like I do with my kids when they’re sick.   I clean up vomit at   one   in the morning  and again at   three   and then rock them to sleep.   Then I’m up at   six   and headed for work  by   seven   if they’re okay.”  “That’s   interesting   to know, but I hope I can do this without vomit. ”  “Me too. I can deal with it, but   I’d rather not.  *  They reached   the   house ,   and   Clarence   waited for them on the porch .  “Encountered a spot of trouble, I see. You both appear physically okay but kind of  rattled emotionally.”  Rachel bowed. “You’re good at picking that out, grandfather. How ever, you never  follow up with a fix. Say what?”  “Say the solution is for you to shower. If that wasn’t on your mind, just stand  downwind from yourself ,   and it will sink in with cringes and yucks.”  He handed her a white garbage bag. “Now that we have that   settled ,   strip off your  clothes and then walk gently to the shower and handle it. You’ll feel better when you get  all that horse innards   off   you.”  “Strip here?”  “ Yes, and   say goodbye to them. I’ll put them in my garbage burn barrel ,   and you can  start off f resh.”  “Strip here?”  “Will you get over it ?   You possess nothing that I haven’t seen   before,   and I didn’t  suggest it so I could get excited over your naked body. That was not a horse   from   this  world. You need to shed it here and not try to carry it inside,   and you need to get on with  it because every minute you delay will allow it to build to a   volatile   state and whomp  you.”  She nodded and dropped her clothes into the waiting bag. “Will you go with me,  Robin?”  “Sure thing. I’ll help you out when you need it. ”  She turned the girl toward the door. “Thanks for your patience, Clarence.”  “You’re welcome, and you can call me grandfather if you will or want to. You have  her courage and determination, but nothing else.   Are y ou going to be up   to witness   the  tornado?”  “Wouldn’t miss it for the world. The fight is on ,   and I want to win.”  “ I like that, and my   money   i s on you this time around.   So,   t ake care of your sidekick ,  and I’ll see you both in the morning.”  *  Robin and Rachel lay in bed and talked little, wanting t o sleep as much as possible  before the tornado hit. ","Rachel snuggled against her. “You keep smelling my hair. Do I smell   better ?”  “ Healthier   than with that gnarly   out - of - this - world horse innards. Does that bother  you?”  “ Roger used to do that   on   occasion whe n   he was home.   He did that a lot on the last  night we spent together. It seemed that he was loading up because he knew he would  never have the chance to do it again.”  “Want me to stop?”  “No , I was simply   remembering .”  “What else has you   acting   deflated and   distant?”  “ It’s just that until tonight, I didn’t understand the reality of what you said to me  when you invited me to join you in this battle ,   and I agreed . I didn’t know or understand  that I could respond to someone of the same sex   as   I did with you. I   scared myself by  even asking to kiss you. I kept waiting for the slap that never came and hung up on the  go - ahe ad.”  “Mmm. So, do you want out? Hold that comment. Sorry for my memory loss. You  might think   it, but   you never will. ”  Rachel sighed and rubbed he r   head   against Robin’s shoulder. “Love that self -  correction. I’ve bitten off a lot, but it won’t choke or kill me. I’ll get over the  uncomfortable feeling that I can’t give as much of m yself   as I might need to in this  battle. I feel a bit inadequate for th e position I   must   fill, but I’m a fast learner.   You   must  be with two children under ten ,   or else they will rule you until Kingdom Come.”  “ So,   I’ve heard. I hope Charlene is a fast learner. And there goes the sleep   state . One  Rachel’s backside   is   a silent r oadblock to anything else tonight. Goodnight,   s weet   t hing.”  *  Robin’s eyes snapped open to a sense of dread and doom. She slowed her breathing  and   fine - tuned   her hearing ,   and all she could recognize was Rachel’s steady breaths. She  twisted   her head   until   she could see the clock ,   and t he digits told her it was 1:55   a.m.  She yawned and wanted to stay snug under the covers, but she kissed the nape of  Rachel’s neck and rolled over to sit on the edge of the bed.  “What’s up, Roger?”  Robin smiled at the sleepy v oice and gave her butt a smack. “Wrong partner,   s weet  t hing.”  “Huh? Roger used to do that when he had an erection that wouldn’t quit otherwise.  Sorry. Why are we awake?   Do you want   me again?”  “No , m y internal clock woke me because I want ed   to be on the fro nt porch when the  tornado start ed . Remember?”  “Oh, that tornado. Give it two of Roger’s titty twisters and wake me in the morning  while it’s groveling for help.”  “Wow! You’re fun to wake up in the middle of the night. I’ll have to set my clock on  occasion   just to record the responses.”  “Yada - yada - yada. It would help if you   went   inside the bathroom and create d   s ome  dry - heaving sounds. That will work faster than anything else.”  “Until now.” She jerked the covers down and smacked her butt   somewhat   hard.  “Let’s   go.” ","Rachel sat and gave her best cross look. “If you keep that up, you’ll learn to eat  pillows, clown. ”  She raced to the bathroom and passed her in the doorway on the way out. “Want me  to make some coffee?”  “That’s up to you. I don’t know how long it wil l take. The atmosphere is twisting and  bending into shape for   a   start right now. I can feel that much.”  “Just my luck to fall for a Storm Lover. I’ll bend and twist some coffee out of the pot,  and I’ll be on the front porch if you’re not there first, slowp oke.”  Robin sat in the   wooden   swing when Rachel arrived. She had a blanket wrapped  around her and exchanged one with Rachel for the coffee.  Rachel sat and watched the sky   to   the west. “ The t hunder head   is forming there,  huh?”  “Yes, and it’s going to be a b ig one.”  “It must be a male. They all claim to be big when trying to win a night with you.”  “In this   case, it’s   right since Cherie is assisting it. See the storm clouds from the  north and south? Normally they would not be present or rushing to add their we ight to  the storm.   And even the main   storm   cloud is stronger than it would be.   So,   t his would be  an ordinary heat - lightning event without the externals.”  She shifted positions and closed her   eyes, and   recalled a chant from Cherie’s tomes .  Three times she   r epeated it and opened her eyes to a world outlined and filled with  colors instead of the   standard   textures.   It took a few minutes to adjust   to the computer -  like graphics , but when she did, the formation of the tornado fascinated her. She  followed the heat   and cold and the   air lines   flowing and twirling.  A   lightning bolt   flashed from the cloud, seeming   angry   over being watched. It tore  across the distance and destroyed a tree at the edge of the   western   clearing, splitting it  in half, setting it to blaze, and   knocking it down to rip up the roots.  Robin caught her breath ,   and   her face   looked dreamy. “Awesome! I dare you to do  that again.”  Rachel viewed her and the destroyed tree. She blinked as   the wind   blew a mist onto  the porch, just enough to   feel .  Moments   l ater,   the tornado formed and touched the earth a few miles beyond the  cemetery and Denton.   Then, i t began a slow and steady path, growing wider, growing  stronger, shrinking, and weakening, causing the appearance of a demonic   heartbeat   or  breathing cycle.  “ Okay, grandmother, I got it. You’ve become what you hated most in life. I promise I  won’t be that way with you, but you will learn to stop this form of retaliation. What’s  done is   done, and what's   past is past. And nothing that’s   done   or past can be change d or  even destroyed. Once   it happens ,   the mark appears   unforgetta ble, but you can erase it  with one thing   that you forgot, Love. ”  She turned and winked at Rachel as she held up her right hand.  “My darling woman, I love you ,   and I love the ignorant , the edu cated, the innocent,  and the guilty   people who make up Denton’s population.   So,   t ake my hand and don’t let  go, no matter what you see, hear, or feel.”  Rachel grasped it with her left ,   and a   mysterious ,   electrically charged atmosphere  surrounded   them . ","“Gran dmother, I love you also ,   and all the games you play, fun ny   or   fatal , will not  change or stop that love. It won’t stop, even if you kill me. Would you care to reflect on  that or take any bets before   continuing   tonight?”  The air grew thick and deathlike ,   an d the tornado doubled in size and strength.  “Somehow ,   I didn’t think so.”  Rachel   dared to look at Robin and witnessed her skin glowing and changing colors  from white,   red, orange, putrid green,   and back to white.  A thought   snapped into her mind ,   and she tu rned her head to see a herd of   twenty -  five   Tyrannosaurus   Rexes charging   full speed   toward   the porch.  “ Oh, why   did I ever want to kiss this woman?   Oh, why   did   I ever promise   to go into  battle with her?   Oh, why   did I ever leave my two children to have the jo y of being eaten  by dinosaurs? I need to have my head examined soon, like last week!”  She shuddered at what it would be like when any of them bit her in half and how  long she would feel the pain   before death .  Then the thought hit her again. “Love? That’s w hy I wanted to kiss her. That’s why I  promised what I did and left my children. I love them ,   and I will see them again.   The  pussy d inosaurs are   imagination products . I love them and all their   charming little  quirk s.   Therefore, I love them, and   they will di sappear because they’re in the wrong  place   and time . Goodbye, buddies. The   Lowbottom R estaurant is closed for cleaning   the  restrooms .”  She shut her eyes anyway ,   and sparks of static   electricity raised   her hair and  crackled up and down her body ,   and the sme ll of   overheated   motor oil had her near the  point of vomiting . Still,   when she opened her eyes, everything was   typic al   of   what she  wanted to see.  She turned her attention to Robin and shifted her position to let her move up her  right hand and add it to the   lifeline already there.  “Hey,   girlfriend, you’re okay. I’m okay. Cherie is not okay for whatever reason, but  that’s her problem. Right now ,   you’re my problem. I love you ,   and that matters a lot here  in this place of hatred and vile condemnation for the wr ong reasons. Open your heart  and love more. You can do it. I do it for   Frank and Sue , and I   can do that for you. It’s  easy. Open your heart and let the emotions compound beyond all imagination, like the  hatred for the tornado. Come on, girlfriend. You can   do it. Open your heart and let   it go  like cupid’s arrow straight into the coldness that should know better. Warm it with love,  the ultimate spanking to stop a tantrum or hateful scene.”  At first ,   she   was uncertain   if she reached any part of   Robin, who   stil l sat as rigid as a  concrete statue.   However,   the disappearance of the hungry dinosaurs told her that  something was working ,   and   the color transitions in Robin’s face stopped and returned  to   normal .  The woman let go a huge sigh and shivered. “Thanks for be ing Cupid’s arrow, sweet  thing. Don’t let go yet. Just fetch a mop and get busy.”  Rachel shook her head and relaxed as the stress of the situation left her feeling  lightheaded. One   round   of lightning bolts hit the dome ,   and then the final  demonstration of   anger hit them.  The chains holding the porch swing melted from the heat of the lightning ,   and the  whole swing flew backward to crash into the side of the house. It broke into several  pieces and dumped the women onto the porch in a heap with the swing and a ny  available loose furniture piled on top of them. ","It took them several minutes of struggling and working together to extract  themselves from the mess and stand. The storm clouds   and   tornado w ere   gone. The  winds were back to a s light   breeze ,   stars   were in   the sky ,   and insects returned to their  serenades.  “And the sore loser loses another round. ”  Robin put an arm around Rachel and pulled her close.  “And this warrior   thanks   you for your assistance. Your love and input did a lot to  help pull me back from that   evil vortex . She   almost   had me incapacitated until you went  on your love spree.   Thanks,   sincerely .   It’s still beating because of you.”  Rachel giggled and leaned into her.  “I had to do that. We were about to be the appetizer for a herd of T - Rexes ,   and love  wiped them out. Do you know they smell like motor oil when they disintegrate?”  “Never knew that, but I’ll file that away for the next impromptu trivia game.   Phew!  Are you going to sleep now? Can   you, after   all that excitement?”  “Roger could put me to sleep   anytime with this neat little game he played. It started  by   undressing me and   . . .. ”  “Well, I’m not Roger, but I’ll see how it works   for me . I think the next trivia game  will be a little spicy for the players. I hope they can handle it.”  *  Near noon,   t he girls woke and managed to get dressed and leave the bedroom.  Clarence   sat   in the kitchen reading a book when they stumbled in and sat heavily on  chairs.  “Looks like something that lost a fight with the cats. Did you two have a rough  night? From the look s of things, you did.”  “We did.” Robin yawned and stretched her back with hands joined behind her.   “ I  feel like a train ran over me.”  “It did, and it was a very long train.”  Rachel went to the cupboard and took out two coffee cups. “Sorry about the mess,  C larence. Have you been outside yet?”  “Yes. It   will   take a little time to put everything back in place. What melted the swing  chain?”  “Lightning from the sore loser. She didn’t like her special storm petering out, so she  put us in our place with the rest of   the garbage and dust mites.”  Robin grinned and gave   him   a thumb up.  “We’ll help you after some breakfast, grandfather. That took a lot out of us ,   and we  need to get some strength back.”  “No doubt. That tree was over 200 years old. I guess it won’t be rest ored, but I’ll get  over it. I’ll   maybe   have to get some help with it. Do you think you might handle that task  and ask around town for me?”  Hearing him ask for help   pleased Robin. “Yes, I can do that. I’m sure there are tree  removal services in Denton or th e nearby cities. I’m certain Shayne can be of assistance  there.”  Rachel sat a cup of steaming coffee before Robin. “Who’s Shayne?”  “He’s a lawyer working for the City of Denton. He’s Walter Arrington’s sidekick,  learning to be a for - real lawyer. And Walter   is working   Cherie’s   will for   her   estate.” ","Rachel sat with her cup, blew across the top of the   steaming   liquid,   and sipped.  “Then why am I here?”  “You’re here to help me against Cherie. We went over that in Seaford. I told you he  was on the wrong side of t he problem.”  “As if that would make a difference.” Rachel turned her attention to Clarence ,   who  stared at Robin.  “Grandfather, didn’t you say last night   that she disliked   lesbians and put a lot of  curses on them?”  “I said that. Why?”  “ Robin, i s that why yo u made a move on me and okayed me kissing you? You didn’t  want to, but you needed some   female   at your side ,   and I just happened to be handy? Is  that it? Thanks a lot for your   dis honesty.”  “Hey, Rachel.”  “Let it rest now!” She shoved her chair back and pick ed up her cup. “I’m going to the  isolated porch by myself.   I’ll keep myself company for   the rest   of the time I’m here.”  “Hey Rachel, you don’t have   to   be like that.”  She kicked the chair back into place   with a caustic gaze and voice.   “Stop the hey ,  Rachels !   L eave me alone!”  With that said ,   she turned and stomped out the door, muttering to herself.  “Wow! That went well. Wouldn’t even let me get a word in.”  Clarence broke a faint smile. “Is it true?”  “No ,   I let her in long before   I thought   of her coming with   me. Your insistence that  she   should j oin me just firmed the decision to open all the doors to her while trapping  my objections behind them. I did not coerce her to come with me. I figured Shayne or  Ariel   would be better, but they couldn’t stand up to the   pressure from Cherie like she  has.  “And I like her a lot ,   and I love   how   I’ve made her laugh a few times.   She’s had a  lonely and rather painful life on her own ,   and I loved   how   she accepted my offer without  arguments or coercion being applied.   True, she   wa s high on lust at the time, but it  wasn’t on my side. I   just   love being around her.”  “Hmm.   Well, y ou can build a dome for her and keep her inside, no matter what.”  “No thanks. If she doesn’t want to be around me, I’ll let her go. I’ve told her that a  few t imes ,   and she said she never would.   So,   I’ll let her chill a few moments ,   and then I’ll  try to talk with her. And, if I can’t win her over ,   she can go.”  *  Rachel sat hunched over her knees on the front porch steps when Robin sat beside  her and draped an   arm across her shoulders. “Hey there, sweet thing. You forgot this  when you stormed out. You should go nowhere without a hug from your favorite fan.”  “You’re not funny.   Go away. ”  “I’m being truthful, not funny. And you’re angry and wanting to maybe rip my   head  off   without thinking things through.   You’re letting your emotions run wild and seeing T -  Rexes instead of a   Greek   maiden   holding a cupid heart box . Are you listening now?”  “Go ahead. I’m not running away yet. I will when I get bored.”  “A little over a   year ago,   Ariel   opened her heart   and exposed herself to me. She  pleaded her case for both of us ,   and she tried several times to seduce me. I ignored her. I ","wanted nothing to do with that lifestyle. After the fortune teller at the State Fair threw  us togeth er in a distant place called Denton, I did give in to her come on, one time ,   and I  must   admit I enjoyed it. Then you warn ed   me about the   police,   and I watch ed   you  dressed down in your apartment ,   and you wanted to kiss me. And after my recent romp  with   Arie l , I said okay, because I wanted to do that then.   Your tanned legs and sweaty  skin   increased   that desire. All that happened before I ever asked you to join me. I  figured Shayne or   Ariel , but not you. ”  She paused long enough to squeeze her and kiss her hair . “And now that I’ve  experienced you and saw you hold up against the nightmares, I say, Shayne ,   who? And  Ariel ,   who? Are we straight on that?”  Rachel sighed and glanced to her face   that was close   and then away to ward   the tree  line. “ I’m s orry to have buste d on you like that. We’re straight. I’m straight. What next?”  Robin stretched and yawned. “I ne ed ed a day of rest after that adventure last night,  but we need to go into Denton proper and see what damage   the tornado did   before I  unraveled it. And we need t o pin   down Roxana and question her about Cherie’s   history  and see if any old folks still exist that might have known her way back   t hen. That would  be helpful, but if not, I’ll work blind until I get the right information to wrap things up  here.”  “And find   someone to cut up the tree   back   at grandfather’s house.”  “That too.” She smiled and kissed her forehead. “It’s nice, but weird hearing you   call  him that. Don’t stop.”  “I won’t. Do you   like   being around me?”  “Yes. It felt weird at first, but you grew on me   quick . I like it when I can make you  laugh over something. Your face scrunches and lights up ,   and it’s just so cool.   You ’ve got  a symbiotic comedian   and   super chick girlfriend working hard to become a   superhero .  So p lease   learn to deal with it.”  She stood   and pulled Robin up with her and hugged her while pressed against a  railing . “Can we finish breakfast now   and then   get busy ? I don’t know about you, but the  mother me says go to work and worry about a shower later tonight.”  *  The duo’s   first stop was the   cemetery office ,   and as Roxana liked to complain, she  was alone.  “Oh boy! Just when I think I’ll have an easy   day ,   double trouble walks into my life.”  Robin smiled and waved to her. “Good morning back at you , sunshine . I’m so happy  that I could brighten u p your day so you can do your job.”  “I’m sure. We’ve been open   for   fifteen   minutes. How may I help you so you can leave  last year ?”  “I need to talk about Cherie Waterman. She’s the reason for my being here.   So, the  sooner I get her resolved, the sooner I c an be out of Denton and out of your hair. Then  you’ll have peaceful days and only your yellow butterfly hair clasp to deal with.”  One hand went to the clasp to touch it. “Thanks. So, what do you want or need  today?”  “Do you know if she w as   bullied in schoo l?”  Roxana gave her a deadpan stare. ","“I   know   for certain   that she was not a witch all her life. Being a witch is not genetic.  It’s something you want   to be. Maybe you could get   trapped into   it out of foolishness,  but   you’re not   born   that way . So, I’m tryin g to find out her background and see if I can  find that one thing that set her off on the wrong path. Hence bullying came to mind.”  Roxana’s face scrunched in thought. “Hmm. I never considered that, but I can’t  answer your question. She was before my time. ”  “Darn the luck. Well, do you know if there are older folks around who might have  gone to school with her?”  “That’s asking a lot, you   know.   Let me think. Uh, you could try the Wilson  Retirement Center. The two I can recall are Thelma Ritter and Diane Hart . Thelma is  pretty much a vegetable. Diane is   sometimes here but mostly gone .   One day   she’s   alert  and in her 30’s ,   and   the next day ,   she’s like Thelma. Other than   those two , no luck.”  “Darn. What about diaries folks might have kept? Do you think there’s a   chance on  that?”  “Good luck finding the pine needle in 100 acre s of   grassy   meadows . If it comes to  that and we can’t get you to give up, I can put out the word   about   what you’re looking for  and see what happens.  “ Just a word of caution, though. The more yo u ask about Cherie Waterman ,   and  they understand why   you’re asking , the deeper the hole is dug for your remains.   So j ust  keep that in the back of your mind ,   and don’t whine that no one   warned   you when it  happens. Leaving is always an option.\"  “Ten - four, Ro xana. Thanks for your concern and advice. How do we get to the  retirement center?”  She gave them directions ,   and they stood to leave.  “What about a tree removal service? I   nearly   forgot about that. Lightning took out a  200 - year - old   tree at   Clarence’s   place   last night. Can you help us there?”  Roxana gave her classic “you’re kidding” look again. “ H ow do you propose to get any  equipment   into   his place? Some other Good Samaritans and I take him groceries  sometimes, but we   must   carry it   on   through the hedge. No   one can drive straight   into  the place.”  Rachel shook her head and   slipped into   her   mother's   voice.  “Roxana, it sounds like you’re afraid of Clarence and his property. When you let fear  control you, you may as well help dig your own hole in the ground. Woul d you like to  borrow a shovel?”  “Then what do you propose?”  “How about a company that   owns and uses   smaller equipment, like Bobcats and  Kubota   tractors   and the like? And for transport, ATVs will fit through the maze path.  How about that?   I’ve got something   to counter every fear that paralyzes you . I’m a  mother ,   and I need to be ahead of my   children ,   so they don’t turn out like you.   Someone  hiccups   loudly,   and you’re shaking like a leaf.”  Her face flushed ,   and she snatched up a ball pen and a small notepad f rom her desk.  “Fine, smart ass. Here’s the number for Festus Dalton Landscaping and Tree  Removal Service.”  She h anded   it to   Rachel, then took it back . “Never mind. I’ll call them. They’d  probably ignore you anyway. I know the one tree you’re talking about.   It’s the closest to  the house . A re there any others?” ","“I think there are two others, but much smaller. They were out farther, by the path  entrance. I didn’t check the back of the house, though.”  “No problem. I’ll get Festus on the job ,   and I’ll tell him t o check with Clarence about  any others.   Have a large day   at the Retirement Center .”  *  Thelma was   not helpful . Most of the time they talked, she never looke d at them   or  made any sign of hearing or understanding them . However, Diane appeared to be  waiting   for them .  “She’s a witch. ”  “Not always a witch. You were not always sitting here in this Retirement Center. You  were outside, normal, and active. Then one day ,   your body or your mind, or maybe both ,  failed,   and you had to give up and come here. That happen ed to Cherie. She was not a  witch at birth, nor was I. Now, was she bullied in school?”  Her cane tapped the floor. “Some called her a bitch. Some called her a witch. Some  called her   a   low - life piece of shit. Bullied , harassed,   and   abused are   mild terms for   her  treatment. Anything you can think of to make someone’s life   miserable,   they did to that  poor girl. Trip her. Shove her down the stairs. Hold her in the cafeteria while boys pissed  on her lunch tray.   I felt sorry for her most of the time. It’s not like   she   chose   where she  was born or where she was fetched up. She didn’t visit the earth , investigate all the  families,   and ask to be born a Lowbottom.”  Robin   was alerted to that comment   immediately. “What? Back up! She was not a  Lowbottom. She was born a Wat erman. That’s her maiden name! You must be  mistaken!”  Diane’s eyes opened wide   at the outburst .  Rachel placed a hand and a squeeze on Robin’s arm. “Calm down, birdie. She’s been  around Denton   longer than you ,   and she sounded to o   assured to be lying. Take a   deep  breath and suck up a long worm. Better now?”  Robin held up a trembling hand and nodded.  Diane turned her head toward Rache l   and asked in a whisper,   “Is she okay?   I don’t  like   visitors   yelling at me. I get that enough here   from the staff . ”  “She’s okay ; s he’s just a tad touchy about her history and ancestors. She’s Robin  Kirby ,   and she’s also Cherie’s great - granddaughter.”  “ Excellent ? That’s a good lineage to come from. Anita Smallwood was your mother,  wasn’t she,   dear ?”  “Yes. She came from Cherie’s dau ghter ,   who married Able Smallwood. My mother  married Daniel Kirby ,   and here I am,   confused but   living.”  “And that’s still an excellent lineage for genes, honey. However, before   Cherie   was  born, before the name Waterman came into play by Shannon   being   marri ed, she was  sired by Bartholomew Lowbottom. You won’t find it   listed on paper anywhere , but when  you dally and tempt fate with too much opportunity   to be alone,   the heat gets too much ,  and   wham!   And Shannon loved Bartholomew ,   and she was a slut for him. Sh e’d give it  up to him anywhere she could. And all   it takes is   a few drops of semen and OOPS.   Her  papa di d not like any Lowbottom at all, but he respected the Waterman family. A nd all it  takes is a click, click of two hammers on a double - barre l   shotgun, and   you’ll marry who ","you r   papa tells you to marry.   Right or wrong, most anyone would make the right choice  that lets you keep living.  Robin’s face turned painful.   “I know that one ,   and she, Cherie, was proud of the  Waterman name and her peers and the communit y knew who the daddy was ,   and they  cut her down and stomped her into the ground at every opportunity. And ,   of course,  bullies don’t give up. And th e scum maggots   didn’t   lighten up   until she couldn’t take it  anymore. That’s the boiling point where she didn’ t kill herself as most would. Instead,  she sold herself to the Devil and dropped into her witch persona.”  Robin   jumped to her feet. “Oh, no! Oh, no! They’re all dead   but not from natural  causes or old age! She   killed them all in some way or another !   She di d, didn’t she? ”  Diane nodded ,   and her cane tapped the floor. “Sit down,   dear . Yes, they’re all dead. I  don’t blame her one bit for what she did. The miserable slobs had it coming ,   and their  absence from the gene pool is like   giving   humans   a breath of fresh   air. I would have  done it   another way , but she didn’t ask me before she commenced on them.   They’re all  in the cemetery with her, but the y all got there long before her. And I can tell you this  with certainty, Robin ;   she watched   them go into the ground and   waved good bye to  them. ”  The   methodology interested Rachel , and she had to ask . “ How did she do it? ”  “Various ways, but all painful. Six went to a surprise birthday party where they used  those trick candles that keep lighting.   Unfortunately, t hey caught th e   tablecloth   on fire  and all six ,   plus the birthday girl and her parents ,   died.  “Two couples went camping in West Virginia. The campsite was attacked by a group  of black bears. One   team   was   killed and eaten. The other couple fled the area and over  the edge   of a cliff , where a   475 - foot   drop killed them.  “One girl   suddenly   got stomach cancer ,   and it went to her kidneys and then her  brain. One died on the delivery table a few moments after her baby. Two men got shot  by others on a hunting trip in Colorado. One   drowned fishing when his boat capsized.  And one got bitten by a rabid raccoon   that got into a grocery store and cornered her out  of   twenty - one   other people available .  “She was   highly creative   but   lethal ,   and nothing could be pinned on her. No one  thought   witch until years later when the bus crash happened. Then it was stupid, but  that’s Denton folks for you.   They’re about as bright as a turned off lightbulb.   They  ganged up on her, restrained her, declared her a witch   at a   mock   trial,   and burned her.  “I thi nk that was stupid, but   again, no one asked me or my opinion. She’s still  kicking up dust, isn’t she?”  Robin hugged her arms and leaned back against Rachel. “Yes, she is ,   and it’s up to  me to find a way to stop her and her harmful antics.”  Diane’s cane tap ped the floor and pointed toward her. “That’s going to take a lot of  love. Do you think you have it in you?”  “I hope so. I keep praying for 100,000 angels with a love bomb each and a huge  metal basket for her safe departure to where she needs to be.”  Diane ’s voice was shrill and cracked when she spoke after laughing. “That sounds  like a   fine   combo.”  Then s he turned to Rachel.  “What about you, dear? Are you going to abandon her?”  “No   way, ma’am.   I’ve been at odds with that a couple of times since I got here.   I  think it’s coming from Cherie, so I’ve cast my lot to be Robin’s partner and helpmate ","until she no longer needs or wants me. I think that’s sufficient to cause Cherie some  level of heartburn.”  “You’re right about that. Just stick with her ,   and you’ll be   more than fine in the mix  of life. I wish I were younger, healthier, and had the strength to join you two in your  fight. As it is, I’ll cheer you from here and pray for your success. God bless you ,   two  girls .”  *  The two tired women returned to Clarence’ s compound and sat on   the repaired  swing , holding hands without talking ,   and again   Rachel broke the wall down.  “Robin, I admire all that you’ve done so far. However, I’m curious how you   will   get  Cherie to stop coming back and hurting people around her.   Als o,   I’ ve thought of many  hundred ways to restore Roxana’s uterus ,   and I draw a blank and file every method in  the   isn’t   going to happen locker. ”  Robin grinned and traced a finger around her eyes and down her nose and cheeks  and   squeezed   her earlobes ha rd en ough to get a gasp.  “Are you saying you don’t have any faith in me?”  “My mommy side has   massive   faith in you. The science mom says womb transplants  are a no - go.   And you have no clue where her womb   is right now. And it’s been gone too  long. And even if it w ere handy and on ice, the   best   method I see working uses steel pins  and a cable blanket to hold it in place. And that would give her a rather monster tone  that would scare most anyone.   S ome guy would get her undressed and then run  screaming for his m om ma,   his buddies, or the police.”  Robin laughed and hugged her close. “You’re thinking overtime, aren’t you? That’s  cute. I could see me as a woman Frankenstein, seducing women and doing all   kinds   of  transplants until I got one to work. ”  She laughed again and r ubbed her forehead against hers.  “Hey, sugar, keep your mommy side working and watch me.   Reflect a moment   on  Roxana. Does she strike you as the kind of woman who is sexually active, dating men,  looking for a husband to settle with and raise a family?”  “ In   my opinion, s he looks like a flat tire. She’s a woman, but part of her is missing ,  and she’s stuck on the hide - in - the - corner game of her own creation. No one can see  she’s lived without a uterus for quite a few years. No man having sex with her would  know   it was missing. Only she knows that.”  “ Right on, a nd that fact, the one that tells her she can’t have a baby ,   is what keeps  her tire flat on the bottom.   So,   w hen I get to her   in my plan , I’ll start her on a regimen of  dating men, having sex with them so th at   she can become pregnant in pretty much a  hurry when her womb returns . It’ll go like a female NASCAR Driver making a pit stop ,  and while the   necessary service   is performed   on her car, some virile dude   will service   her  body,   and before she’s back   in the r ace   again, she’s pregnant.”  “It will happen to Roxana that fast?”  “Yep. I guarantee it. However, since it’s me doing it, and I’m an ex - government  employee, it will have to be close enough for government work. I mean ,   it won’t be spot -  on like I was working   for Bank of America, which would   be   wonderful.   But   it might take  two or three times to get it right.” ","Rachel frowned and thought hard of mechanics and timing and positions. “Nah. I’m  not buying that.”  Robin feigned hurt. “You doubt me? You had better stop   that. I’m practicing with  Roxana to get it right. Then I’ll use it on you the next time.”  “I’ve had two babies ,   and that’s enough.”  “I can see it now. You’re   squatting   down, picking a   booger   from Sue’s nose, licking  your thumb to clear a smudge of dirt fro m Frank’s chin ,   and wham! Your stomach jerks.  And you’ll come up hopping mad ,   and people for   ten   miles around will hear you yelling  at me . Then   you’ll throw everything at me that’s not nailed down ,   maybe   even the kids.  However, by then ,   it’s too late.   So g o ahead and t hrow   a   tantrum ; y ou’re pregnant  already.”  Rachel turned red and   whirled. “I was going to tell you to leave, but I’ll do it instead!  Later!”  Robin laughed and sat down on the porch steps to keep from falling. “That girl’s too  easy to rile but w onderful to make laugh. I hope she adjusts to my sense of humor soon.  Long - distance impregnation? Come on, girlfriend. It’s   cool   in theory but impossible in  practice. My method will require up - front and very personal contact and   detailed  cooperation. Howev er, by the time I approach her with it, she’ll be primed and do a  triple back - flip and ask when.   She’ll beg me to knock her up.   Of course, y ou won’t, but  that’s quite okay. ”  “It is? Have lesbians learned how to do that?”  Robin yelped and grabbed her chest.   “My lands, grandfather! You   scared   me!”  “So, Rachel won’t ask you to get her pregnant?”  “Never mind   about that. I t’s   complicated, and   thinking it through and talking about  it   hurts my brain .”  “Well, don’t tell me about it then. I can wait a few years for   that news anyway.”  “I’m sure you can.”  “Thanks for arranging the trees to be cut and removed. I got quite a stash   of  firewood   lay in for winter now.”  “Do the winters get rough here?”  “It all depends on her mood at the time. They can go from jacket weather   and little  snow to freezing cold and ass - deep snowdrifts to make life miserable.   On the other  hand, i f you   settle   her before then, we might have a   regular   season where we have a bit  of all that.”  “Then we’ll work toward that goal. Normal is   desirable .”  “Ha ve you come up with anything solid yet? Any plans at all?”  “I’m still working on some of them. Mainly I’m gathering information.   Today, I  learned a great deal   about her being bullied and what happened when she hit her  breaking point and retaliated versus k illing herself. That was interesting and non - typical  action. And for her to do all that, she had to have assistance. I’ve encountered on e   while  I was in Seaford   getting   put on Admin Leave. I don’t particularly like him, or it, but I’ll  do what’s necessary,   to a point. Picking up he r habits wouldn’t benefit either   of us .”  He wiped his brow and sighed. “That’s wonderful news to hear,   girl . That had me  worried.”  “Did you know about her being bullied?”  “I did, but she never let on that it bothered her. She had   a very tough constitution. I  watched and listened to them die in freak accidents, and I suspected something, but she ","was my future, my love, so I tuned out the bad and saw   the   good in her. I knew how far I  could go to interfere with her plans, and when I g ot close to it, I shut up and left her  alone.”  “It sounds like you’ve learned a thing or two over the years.”  “Yes. I’ve hashed and r ehashed many things to   nearly get   sick, and nothing  changed.”  He rubbed   his   n eck and sat beside her in the swing.  “I guess   the biggest mistake was to take her at face value.   Whatever she said, I  believed and questioned little. She said she loved me and wanted to stay with me always.  I believed it. Now I think it’s a twisted kind of possessive love. It was one way. I was like  a   fine piece of art that she adored. However, she was beautiful, attractive, and sexy. I  couldn’t get enough of her, so how much should I have argued and fought her? I don’t  know anymore.”  “What about when she was exposed, captured ,   and burned? Were you to   show your  love for her by defending her, stopping the Denton Mob, or calling   on   external  authorities to out - weigh the locals?”  “I thought of that, and I also thought that I should have fought them to the point  that I went with her. But now, who knows?”  “We ll, don’t fret over it too much. What’s in the past can’t be changed ,   and you’ve  got two granddaughters who love you.   So j ust let it go.”  *  Robin   left him and found Rachel sitting on the back porch, staring at the charred  post.  She blew across her ear an d put an arm around her waist.  “That was a fairy dollar dropped in the slot. Now you   must   answer questions. What  are you thinking?”  “I’m thinking how much pain she experienced in life. Being bullied all the years.  Selling her soul. Being attacked and burne d   to death   for doing something un - Witchy .  Some of it doesn’t seem fair at all. Then th is damned obnoxious green dog   keeps  skulking in the shadows. I’d like to kick his ass back into hell. He stinks from 200 feet  away.”  Robin’s eyes snapped to the forest at   the edge of the clearing, looking into the  shadows and seeing nothing.  “Is he here now?”  “He came three times since I sat on the steps , but he’s gone now . Why can’t we have  chairs back here? Anyway, he   comes,   drool s all around ,   and then pees on the post.   I  yelled at him to go away ,   and he said he   wa s marking his territory. She belongs to him.   I  told him to go the fuck away ,   and he told me to be brave and lay beside the post ,   and he  would   piss on me too. I told him he didn’t have the balls to do that ,   and I   would kick his  smelly ass back to hell for even mentioning it, but when I stood, he disappeared and  hasn’t been back.”  Robin rubbed her back and kissed her cheek. “Wow, girlfriend! You told him that?”  “Yes, and I meant it. Things that don’t belong when an d where they appear really  make me angry . You can joke with me all you like, but don’t try no anachronism   poop   on  me ,   or I’ll hurt you.” ","“Anachronism? Something out of place and time? Got it, fairy princess! Marvelous!  That was a good fairy dollar invested ! I love it!”  Rachel twisted to view her. “Then I’m happy for you. I was set to do what I told him  before he disappeared. This sidekick of yours   doesn’t take   no guff ,   and she’s no wuss,  even if she does   pee   without notice   during high fear situations.”  “ I c ouldn’t ask for anything better.”  “I never thought to ask, what are you getting out of this messed - up affair once it’s  straight?”  “If I’m the winner, I’ll receive an Atta Girl, a year’s supply of lipstick, two boxes of  panty wash, a year’s free subscriptio n to Elle Magazine, and one   neat   girlfriend.”  “In other words, all the satisfaction and praise you can heap on yourself. That’s cool,  though. You forgot an unexpected reunion with an almost grandfather. You can forget  everything   except for the girl and the   grandfather . ”  “What other things?”  “That’s what I mean, joker.”  “Oh, and I forgot the year of free toe kissing from my girlfriend’s sister.”  “Which I’ll guarantee, with or without t r ying.   So,   what do we do next? Give me  something to do, partner.”  “Well, C larence said he would start dinner in about an hour.   So, f or the moment, I’ll  sit where I am. You sit behind me with your legs wrapped around   me and your hands   on  my shoulders. Then you call your green, nasty buddy back so I can talk with him. That’s  the s tart ,   and we’ll pla y   it   spontaneously   from that point onward.”  Rachel moved into position. “I love this sidekick assignment. Must we call him  back? Can’t you find a way without him, or   could   we just fake it?”  “Don’t worry, girlfriend. You’re safe here as y ou were with the falcons, the knight,  and the T - Rexes. Just worry about me. I’m allergic to urine before   eight   o’clock at night,  so hold it.”  “Cute , smartass .”  “I know. Yo! Jaded Willow! Where are you ? Why are you   hiding and skulking? Carry  your   tired, sme lly   ass back to this world and prepare for a conversation with me, Robin  Kirby. Come on! Stop dragging your heels and gnawing your own tail! I won’t wait all  day ,   and you’d better   not make me come   and   fetch you!”  He appeared   beside the post   with a   bang, a   loud growl , c ocked a leg ,   and urinated on  it.  “ Oh , that felt   so grand!   Your turn, Rachel.   Let it go. You   have   a nice commode  handy , so go ahead and give her a   g olden   s hower now!   It will make you feel so good. ”  Robin shook her head. “Pathetic! If you’re goi ng to be a comedian, you’d better take  some   fun   lessons because you’re not.”  “Whine! Whine! Whine! Go back to Seaford and be another nobody.”  “I will, thanks. However,   instead   of nobody, I’ll be somebody. I’ll be a for - real  queen ,   and people will come from   miles around to kiss my feet and get a Selfie Shot with  me. But for you, you’ll have to bring $10,000 in certified gold bullion to do the same and  another $5000 for a photo session. ”  “No way! I won’t do that now ,   and I never will!   So j ust   leave   while I’m   being   kind !”  “Oh, I love those lies. You’re never   pleasant ,   and you’re never truthful unless it’s  with me. Is that why you hate me so much?”  “Go!” ","“Why did you do all that for Cherie Waterman? I know you helped her, but why?”  “Go! Go while you still can!”  “Ah, good. Keep up the anger, dude. It lets truths flow and increase s   your pain. You  helped her a lot. Was she your witch bitch? Ha! That’s it, isn’t it?   You   would never   have  done what you did without that sexual reward.   Oh,   my! She was your main squeeze  t here ,   and Clarence was the one who had her here.   Do you hate him also?”  “I hate YOU!”  “Too bad for you. I need some help ,   and I think you’re the best candidate for the  job.”  “Never! Stop talking! You can’t make those demands! Only she can do that ,   and  you’ ll never reach her level. I’ll kill you first.”  “You’ll not kill me   at all .   That doesn’t lie within your line of authority. And   Cherie  will never approve it anyway.”  She removed Rachel’s legs and stood defiantly. “Oh,   you think you will, huh?   Well,  you   jus t try it. Go ahead.   T here is nowhere on ,   above,   or   below the earth ;   you can hide  from me. You won’t be safe, even   in the Netherworld! And no, I won’t kill you. I’ll keep  you in excruciating pain for hundreds of millions of years. I’ve learned how to do tha t  from her Tomes, so just try me! Please try me!”  “This is ridiculous! I’m leaving now. Cherie is horny ,   and she needs me.”  “You’re going nowhere until your work is finished with me!”  “I’m not helping you!”  “The people of Denton have suffered enough from h er mistakes and your assistance.  You will cease that   IMMEDIATELY! ”  “Only she can command that!”  “It’s not my problem. It’s yours ,   and I’d recommend you find her,   cringe ,   slobber  before her, and clear yourself. Otherwise, you will do it   yourself ,   and you WI LL obey me.  This interview is   over,   and you’re   hired,   and you will start to work as of now!”  He growled and howled and increased to three times his size and charged toward  her.  “Girlfriend, do you have a safety pin on you? Please be a good Girl Scout.”  “Mo mmy always ha s   those around for life’s little emergencies. ” She unfastened one  from the bottom of her blouse   hem   and   laid   it in the waiting hand.  “ I w ant to go on record and say I love you. You’re awesome.”  “You’ve not seen awesome yet. Sit tight now.”  She   opened it, bent it nearly straight ,   and held it between the closed fingers of her  right hand.   Then, s he stepped forward and clasped her hands behind her back.  “Come on, unruly employee. Hit me with   your most   potent   piss - ant endeavor. When  you do, I’ll pop   you and watch you fizzle and sail around the clearing here, bouncing off  trees and anything else, farting like   you   just ate a   100 - acre   field of beans. And when you  lie   on the ground looking like an empty bladder, I’ll light you on fire.”  “Impossible!”  “Ve ry possible. Demons burn the same as witches ,   except they shriek louder and  longer . Come on, big boy. Put me in my girlish place, doggie style and vulnerable.”  Too   late, he   realized what she meant to do,   tried   desperately   to   stop, but   failed and  could only   achieve   a hard turn to her right. He howled   in pain   when the safety pin  pierced him and dragged along his underbelly. He   expended   more tremendous   efforts to  stop,   but he hit the   cabin   wall beside the back door, bounced back, rolled head over ass ","around   to   hit the post ,   and jar it s   foundation   loose .   He groaned ,   and his tongue slipped  out and lay in the dust as his sight dimmed and he felt near death.  Robin was at his side before he could think or react with the pin pulled back and  ready.   She   struck   him agai n behind his right shoulder and reeled from the   blood -  curdling   screech.  “You evil, nasty bitch!”  Again, he leaped into the air and deflated farther as he fell on a collision course with  her hand and the damned p in.  “Please! No more!” he pleaded as the pin   stuck in his throat and   her hand deftly  flipped   his body   f arther from the house toward the tree line and far away from Rachel.  He looked like a wet Chihuahua, trembling from the cold and in mortal fear of the  heinous monster   who still held the damned mommy   pin   that hurt him bad .  “I’m sorry.   I’m sorry! I’m such a loser ass hole!   I’ll try to be more reasonable from  now on, boss lady. Please stop. I won’t touch   her,   and I’ll stop running my mouth unless  it’s a positive response to something you’ve asked   or a j ob you’ve assigned .   Please?   Have  mercy!   I can’t take   any smaller.   As it is, I’ll be ridiculed and teased for eons   by all known  demons in the Netherworld! ”  “That’s an acceptable surrender.” She stood and slipped the safety pin in to   the   waist  of her skirt .  “ I’ll see her right away and turn in my   resignation letter . I’ll work for you now, no  matter how much it hurts   me,   and this small prelude tells me I’ll suffer   great and long  before I’m free of you r dictatorship. ”  “Another acceptable surrender. Welcome to my   toolbox, Jaded Willow.”  He groaned   in humiliation   and disappeared.  Rachel hurried and hugged her. “Damn, woman! I love you. That was amazing!”  “Yeah. I liked it too because I didn’t have to change any diapers this time. You must  be getting used to it.”  “I   am but   excuse me. I’ve picked out the bush ,   and I’m going to make a nature  donation now.”  Robin chuckled as Clarence approached her.  “That was awesome, Robin. I’m happy you’re figuring things out and swiftly. That  demon is good, but she let him go on his   own too often.   He'll work much better for you if  you hold him to the task and don’t tolerate his gaff like you just did .”  She winked and kissed his cheek. “Thanks, grandfather. Uh,”  The tomes are on the kitchen table. I’m ahead of you for once.” He cast he r a  sideways glance but said no more.  “What? Let it out. You’ll feel better.”  “ Are y ou   going to, or do you plan   to restore Roxana’s uterus? Cherie was the best  around, but I don’t think that even she could do that.”  “She removed it , so w hy not put it back? ”  He frowned and rubbed his chin. “Cherie did that?”  “Roxana told me about the pre - Halloween night where it   happened,   and Jeremy  died,   and Robert disappeared.”  “Oh, yes , I remember that, but still, r estore a womb?”  She laughed and patted his arms. “Don’t w orry about it for now.   That’s a popular  question   posed   to me   many times . It’s   quite   simple once you find out.   I’ll explain it later. ","For now, I’m tired ,   and I need some sound resting time to let my body heal. As soon as  Rachel catches up with me, I’m going   to bed.”  *  The next day began with sunshine and a gentle breeze. The resident and guests at  the Lowbottom   H ouse decided to dine   outside on the front porch. Afterward, Robin and  Rachel visited Cherie’s grave once more.  “Hello,   great - grandmother . I’m back .   Whether wanted or not, I’m the proverbial bad  penny that keeps popping up .   I j ust wanted to tell you that I love d   you and   enjoyed  learning about your life.   Yesterday,   I learned about you being bullied in school. That’s  reprehensible ,   and I don’t condone   it. I’m sorry that it happened to you, but I discovered  that you overcame it   and   severely retaliated against the bullies. Then, without being  aware of it, you became a bully yourself. It’s not right for you to do that.  “I hope you understand what I’m going   to do. It’s time for you to grow up. I know it  might be difficult since you’re already dead, but you will do that and stop bullying the  world and people who had no part in discriminating against you. You’ve hurt many  people with your silly revengeful coun tenance, even me ,   who didn’t know you ever  existed.   So j ust stop it and rest in peace , as much as it’s possible for you. You’ve chosen  your destructive path ,   and I’ve chosen my own path of effervescent love.  “Thanks for transferring Jade Willow to me to us e. I will use him   on rare occasions  un til I’m finished here in Denton. I will stop or lessen the destruction of the remaining  tornados and the hurricane.   I must do that to stop the anger against you and me.   Your  reign as the Punisher   Bully   is ending ,   and m y reign as the   Healer   Cupid is beginning.  Please pay attention to me so you won’t get hurt   anymore .”  The air remained warm, but a surreal quietness surrounded them. A grasshopper, a  dragonfly, a praying mantis, and a wren buzzed them and landed facing them   on top of  the fresh bouquet of weeds.  “You’re welcome ,   great - grandmother .”  Robin saluted the display and blew a kiss to the   tombstone.  *  If the tornados and the hurricane w ent unchecked, Denton, Maryland ,   may have  been uninhabitable for a decade or more . Weakening them and stopping their  inten tional   destruction wore out Robin and Rachel. A two - day respite in Seaford  restored their physical and emotional well - being ,   and they prepared to return to  Denton.  “You know, at one time in my life, I’d have hated t his and dragged my lead   feet for  months to avoid it. Now I look forward to it.”  “Does the final act of your puzzle have something to do with that?”  She cast Rachel a   naughty   gaze. “ Perhaps .”  “When do you let me in on your secret plan?”  “When you decide to   have another child for us.”  “Well, goodbye, Robin. My lawyers will be in touch.”  A hand went into the air.   “Talk to the hand.   You’ll be with me when I discuss   with  Roxanna how to rectify her womb. Then you’ll shake your head and think I’m   the ","nuttiest   pers on in the world,   and you might be right this time. However, I’m a  government employee ,   and we have a saying, ‘Close enough is okay for Government  work.’ Relax. The time is growing near to do that so I can open the money doors. Are you  going to leave me the n?”  “ Hey,   I’ll hang around with you with or without the money . You make life  interesting. I just want my babies to be with me also.”  “That’s a given, honey. How are they?”  “Charlene’s heart is   melting,   and it’s even   begun   a small heatwave in mom and dad. ”  “Good deal. It   will   take a sun full of love to melt the resistance and balking at what  I’m brewing up, but it will happen ,   or else I’ll go back to Seaford and live my life in  shame and disgrace.”  CHAPTER ?? ???:  Robin rose early and kissed Rachel’s should er as she gathered her clothes and  slipped out of the door to dress in the living room. The walk to the car was delightful in  bare feet and sandals hooked on her fingers. She enjoyed the damp, dew - laden grass and  used paper towels to dry her feet before   pu tting on   the   sandals and driving away.  She stopped in the empty visitor's parking lot at the Wilson Retirement Center and  walked up the steps to the office. It surprised her to find the door unlocked. She closed it  behind her and halted at the chilling atm osphere.  “May I help you?” asked the morning security guard. “We’re not open for visitors  yet.”  “I didn’t figure you were, but I need to speak to one of your guests, a Diane Hart. I  can wait for her until it’s time.”  He scrutinized her and pressed a button   on the desk beside him. “You’re that Kirby  Girl who’s been stirring up trouble around Denton, aren’t you?”  “I’m Robin Kirby, but I’m causing no trouble.”  “Don’t give me that   lying hoopla!   Anywhere a Kirby goes, bad news follows them.  Why   don’t you go back   to Delaware and stay lost there?”  “Look, I’m not here to cause anyone trouble.   So w hy does everyone have to criticize  me and determine I’m bad without knowing me?”  “You’re the great - granddaughter of Cherie Waterman, aren’t you?”  “Yes, but what does that h ave to do with me? She’s dead ,   and I’m alive.”  “ Is she   dead? Witch’s curses never die with them. You’re here ,   and   now   the hatred  she felt for Denton residents is coming back to life and hurting people who want to be  left alone!”  “Oh, bullshit! Curses don’t   work unless   some dumb and uneducated people ar e  around to believe it. If that’s the case, you and   1 98 0   other residents of Denton are  keeping it alive and passing your stupidity on to the next generation. Give me a break!  I’ll be glad to get   it   done and le t this hick town disappear into the history book as roads  are built all around it so no one can even find it by accident!”  He started to   dispute   the statement when the doors opened to the common greeting  and meeting area and a woman in a white nurse unifor m entered.  “What’s wrong? Why all the shouting out here?”   she asked.  “This man is sitting here being stupid and saying I’m the reason for all the problems  in Denton because Cherie Waterman   was   my   great - grandmother . That ignorance is my ","problem and the reas on for the loud responses! Narrow - minded people like him   upset  me !”  “I know who you are, Miss Kirby. Why are you here now? Can’t you read the posted  sign with visiting hours listed on the door?”  “Yes, I can read the sign! And since it’s nine whole   agonizin g   minutes until it begins,  I’ll wait in my car! Heaven forbid that I encounter a human who is educated and   willing  and capable of thinking independently   in this alien country town! I hope you all stay and  die here. The rest of the world is not ready for yo ur idiocy yet!”  “You don’t have to be so snotty and demeaning, Miss Kirby.”  “And you don’t have to be stupid and say I’m causing problems, but you do! I’m here  to solve problems, and most of them do not concern you whatsoever! It’s not my fault  that   many   p eople in this isolated place   want   to jump into pointing fingers and   make   me  the scapegoat for the problems you and your ancestors created! Your ancestors did that,  not mine!   I came here in kindness ,   and all I get is belligerent responses and accusations  fr om people who don’t know me! Stop it!”  “Okay, Miss Kirby. Who are you here to see?”  “Diane Hart. I spoke with her yesterday ,   and she asked me to return if I needed  more information or help.”  The nurse’s face registered surrender. “I should have known that.   We can’t keep her  in bed for any reason this morning. Go on inside the greeting room. She’s there at a  table, one hour early for breakfast. Go on.”  She opened the door for her and waved her inside.  *  Diane sat at a round dining table, waiting patiently.  “Good morning, Robin. I’m so happy to have you as a visitor again. Come on. Sit  with me. What can I do for you today?”  “Trip as many staff personnel as you can get away with. That’s a good place to start.”  She gave a   muted   response and nodded.   “Aren’t you   happy that you don’t carry a  weapon?”  “ You got it, Diane.   I ’d be charged with so many murders; it would be ridiculous if I  did . When I stopped, the population sign would read about   ten .”  “I hope I’m one of the ten. I’d rather go peacefully in my sleep.”  “ You’re safe.”  “You’re not. I had several dreams last night and this morning about   a   pregnancy. At  my age, that’s either a blessing or a   boon. I don’t know which   I prefer . Are you here to  give me the answer?”  “If I can , I will . That’s one of the biggest and   most   challenging tasks I must perform.  However, I have a rough plan ,   and I want to run it through your brilliant mind. Since  you know all the players   involved , I figure you’re the best person in Denton to do that.  What do you say?”  She   put on a great smil e and   rubbed her wrinkled hands together. “I say tell me.  Don’t make me take up my cane to you. You won’t like it.”  * ","Rachel   spent the remainder of the day   observing her quiet   superhero   and waiting  for   her composure to   break   and   start any conversation. S he had watched Roger act the  same when there was something important that needed discussing, but fear of the  results if misunderstood caused lockjaw for hours or sometimes days.  Clarence watched   both   until he had to say something, anything.  “Rachel, what i s up with the two of you. She’s pacing. You’re watching. Neither of  you   is   talking. What derailed the train?”  “ Nothing   major, grandfather. To me, it’s minor. To Robin ,   it’s a mountain prepared  to bury her. She has a wild plan to tackle Roxanna’s womb ,   and   she needs some external  help from Shayne, and she’s worried about any level of contact with him interfering with  me, with us.”  “Ah, the woman’s about to cheat ,   and it worries her. Good for her. Should she be  worried?”  “No   way . I’ve told and showed her I   ca re;   I love   her , I want to stay with her. It’s not  like it was with Roger. The commitment doesn’t carry the same weight. We’re together  for a di fferent reason, not from a long - term loving relationship.”  She sighed and stood when the swing moved forward. “I   guess I’ll have to tell her  again.”  “If she stops pacing long enough.”  “Oh, she will. She’s about to fall down ,   and I’ll be there for her.”  “Do you know her that well to know she’ll fall?”  “Yes , and since I know her   and   set the stage to trip her, I can gua rantee it.”  “Rachel, I love you. It’s been rewarding to know you.”  “Good. Enjoy me for the time you have left. That’s worrying her too. That which was  lost is found ,   and she’s   reluctant   to let go so soon.”  “She’ll get over it.”  “I know she will. Let me go   now.”  She walked to sit beside a bush close to Robin’s path. She waited idly , holding   the  end of a grapevine in her hand until Robin was in position and jerked the vine up to  catch and tangle in her feet.  Robin hit the ground with a grunt and moved to her   knees.  “What the hell? What happened? Nothing was there before to bother me.”  “Aww,   did   poor   little   superhero fall down and go boom? Oh my !   Oh ,   dear !   Do your  hands stingy wingy? Crawl over here and let me kiss the boo - boo.”  Robin’s eyes found her in the bu shes. “You? I might have known it would be you!  Why are you bothering me?”  “Because that’s my responsibility. It’s part of my job description. Paragraph 34a,  subparagraph eek. When Robin is hung up over a dilemma that isn’t a dilemma, trip  her ,   so she fall s and suffers a humiliating   boo - boo . Then kiss it and make it better. Come  on.”  “How can you be so   calm   about what I’m going to do? Is everything about you  invalid ? Is there nothing in your job description about that?   C ome on. This is killing  me!”  “You’re   killing yourself, sweetie. You’re causing yourself more   boo - boos   than the law  allows.   Since you told me the plan that Diane approved and thought was wild and  groovy, I ’ve thought about it ,   and I’ ve joined you in wanting to see   it happen. Like  Diane, I can   see mouths drop open ,   fingers point, and whispered rumors fly like ","confetti; when it happens, and people won’t hate you, they feel sorry for insane people  who think they could get away with it . Come on ,   sweetie.   Open . Let the truth set you  free. Come on.”  “Doesn’t that bother you?”  She smiled and gave a thumb up. ‘Yes, it does.   I almost had a heart attack when you  said yes to kissing you . I couldn’t for the life of me understand why you would. However,  you did ,   and we both liked it. Then I asked for more ,   a nd WHAM! I was in a state of  shock like you wouldn’t believe.  “Wow! You asked me to go with you in this battle ,   and over the last weeks, I’ve  grown accustomed to your presence in my life and   wonderfully comfortable   with the sex.  You rock, girlfriend! And n o, I don’t 100% like what you’re going to do, but I know why  you will . Shayne has the facility to help you   with   your plan. I don’t.   And since   I’m not  equipped for it ,   I’m here for   our   pleasure, not procreation. I also know that   you’re out of  luck without d oing that tonight . No other man in Denton will give you   yesterday’s last  breath ,   but h e will . He’s had you once ,   and he’s dying to have you again. So, suck up  your   sense of loss that won’t happen, turn your panty   hamster loose,   and have fun. You  need it. W ithout that second time, he won’t help you. Afterward, he will do whatever you  want, even if it’s something crazy, like rob bing   a bank. No problem, ho ney , consider it  d one.”  “Panty hamster? That’s a good one. I like it better than coochie. That sounds like  bugs or something. Okay. Thanks, girlfriend, sidekick. Maybe I’ve become too attached  to you, maybe more than I thought possible.”  “I know, but I’m glad it’s me instead of Ariel. You did with one phone call what I  failed miserably to do in   eight   years. Yo u got my children   in   Charlene’s   life, and   it’s  spreading out to capture   mom and dad. Wow, superstar. Go do what you   must   do ,   and  I’ll let it pass with no more comment. I wish I could be there when you lay it on him,  after laying it on him.  “You’re terrible , sidekick.”  “And you’re so cute in loving me.   So d on’t worry , w e’ll be okay in the mix of life.”  *  Shayne felt great after learning some extra carnal knowledge with Robin. He lay  l anguid   beside   her but   within touching reach and trailed his fingers over   her skin.  “Robin, you are one fine woman. I don’t care if you got here to Denton by accident,  by design, or by being evicted from Seaford, Delaware.”  “So am I, darling. I fought it for so long I thought I   won   until   Ariel won a room and  money here and   bugg e d me until I went with her.   Now,   here I am, enjoying the last  bachelor in Denton ,   Maryland. Lucky me.”  “Me also.”  “Did you date any women before I got here?”  “I never met anyone worthwhile.”  “Get out. What about Roxana Perkins? She’s single and available.”  “Uh, no thanks.   She has   too many problems   and   need s   a strong man to help her.”  “Oh, so you’re telling me she needs Shayne Wolf. Why didn’t you   date her ?”  “ For real ? Well, I don’t find her that   attractive, and   I also hear she’s frigid.”  “No way.” ","“Yes, the re is a way,   sweet thing. I recall   she;   her   brother   and a friend went   into   the  cemetery on Halloween   night,   and   only   she made it out   alive if   you want to call her   that.  Her brother disappeared. The man with them was killed after raping her on a grave . It  w as all a gross mess.”  “Mercy!”  “Yes.   Mercy.   That’s what I say to   your suggestion to   date   her.   She has   more  problems than   there are mathematicians in the world to count them. ”  She laughed and snuggled against him. “You crack me up, thinking all backward. A  real man would tell me this way.”  She cleared her throat   and deepened her   voice . “And let me tell you what, Clyde.  That   Roxana is a Mother Goose of a sex maniac   in them faded jeans   and plaid flannel  shirts . She hadn’t been laid in   over   nine   years ,   and when   I got to massag e   her panty  hamster, she came alive and raped me every night for twenty - seven and a half days!  Wow, what a woman! She had me in positions I never thought possible, but she did.   If a  man could get a woman pregnant while she’s still pregnant,   I’d have   nineteen   kids on  the way.”  “And Clyde would say, ‘In other words, she’s ugly.’ And you’d   say , ‘Clyde, my buddy ,  I   found her in the dark, laid her in the dark, and neither of us will ever care what you  think.’”  “You crack me up, Robin. Stop for no w. Wow, what an imagination.”  “It’s not that far from the truth, Shayne. I’m serious.   She’d treat you like a queen  would her king if you ever got next to her .   Nine years is a long time to be rejected and  ignored when   everything   but one works normal ly .   Her   missing womb does not affect  anything else. ”  He lay quiet a moment. “You mean she can still have sex? I thought, well, I was told,  something ripped that part out.   But, y ou know, she has no vagina.”  “What? Man, I’m glad I’m not a man. She’s got a vagina. Sh e has no uterus. She  wants to get pregnant ,   and even without a uterus, she can still do that. Do you want to  help her? She will rape you when you get close to her. The how to do it will return in  about ten seconds ,   and you’ll be a good ten pounds lighter w hen you do get away from  her.”  He laughed and flipped a nipple. “Hey, that was a serious face there. It sounded like  you really wanted me to date her.”  “It was serious. I would love to see you date her. I’d love to see her feeling like a  worthwhile woman a gain.   But unfortunately, t hat night of what should have been fun  turned into a nightmare that still crushes her. She needs a man to pull her out of that  shell. A man like Shayne Wolf could do that.”  “ You say s he wants to get   pregnant.   How can she do that w ithout a uterus? That’s an  essential   organ for   birthing.”  “All things in creation can be recreated or   recycled or   reused.   So,   i f y ou date her a  few times ,   work your Shayne lupine magic on   her ;   I guarantee you will get her pregnant.  And when she tests posit ive, you got a love slave for the   remainder of your life.”  He sat up, turned on the bed, and stared at her crossly in the semi - darkness. “Robin,  you are one wild ass woman to ever think of something like that.”  “I know, but the money started me ,   and since   she was so bitchy when I first met her,  I wanted to know why. Now I know. Now I have her solution to womanhood, right here  in my hand.” ","She moved her hand and found her target while studying his eyes.  “Do you want me again?” she asked.  “Of course. Once is   never enough.”  “Then get busy with Roxana Perkins ,   and you can experience   my   sexuality again.  Maybe a couple of times. I’m not going anywhere any time soon.”  “Good deal. I’ll leave now and knock   up   Roxana   before morning.”  “No deal. You stay right where you   are unless it’s a bathroom break.   Then, y ou show  me how you’re going to do her, step   by   step ,   so I can grade you.”  *  Shayne had no problem finding his clothing when he dragged his tired body from  the bed in Room 501 in the Denton Hotel. H owever, h e remai ned in shock when Robin  kissed him goodbye at the door ,   and he departed   by himself .   After buying   a cup of coffee  from a breakfast vendor , he   sat on the boardwalk for half an hour before   deciding. He  chose   to follow through on his wild promises to Robin Kir by, currently the most  desirable and crazy woman in Denton, Maryland.  He called Walter and said he was sick and took a day off. He sat in his car, looking  both ways on the street that had not moved since it was built, trying to firm his mind.  “What did   th at wild sexy, and too   intelligent woman sa y?”  “You want to help abused women. Roxana has been abused and lived without help,  but with a lot of ridicule   and shunning   for nine years. You can start with her. You want  to build a food kitchen to feed the homele ss. Many of Roxana’s children have never been  born because they have no home. They will appreciate being born Shayne. End her  abuse with tender love and sex. Enshrine her in your loving home.   The   eggs   will come  from her, the sperm from you, and I’ll provid e the surrogate womb f or her children to  grow and be born. We’ll make a crack team, Shayne Wolf, and I don’t mean the illegal  drug.   So g o forth, with faith, Lupine, and stir up some native and lonely hormones.”  “Great. The condensed version is, she has you   by the balls ,   and you’re screwed either  way. Might as well make it a double   bagger .”  He turned left and headed for the Denton Cemetery Office.  *  Robin left the hotel , drove to the back of the cemetery,   and walked whistling to  Clarence’s house and Rachel   waiting on the porch.  “Man, you look good.   But   y ou also look tired and worn out.   L ike you’re about on  your last step before the rest of your energy leaves you ,   and you fall on your face.”  “I love you   too , Rachel. Good morning.”  “Back at you, love. Sit dow n before you   fall,   and I’ll fetch a cup of Grandfather’s  ‘ can’t sleep from fear ’   coffee. That will work for you.”  “Thanks. You do that. Where is he this morning?”  “He woke energized and went to cut some grass in the cemetery. He said he needed  some exercis e.”  “Good for him.”  “Did you meet with any success other than having a lot of fun?” ","“I did, sweetheart. Unless my reading people   are   wrong, he’s in the office right about  now, noticing Roxana for the first time in years ,   and he’ll have a date lined up befo re he  leaves. I wish I had a camera there to see how he does it, but I’ll just have to have faith in  him.”  “Like he had faith in you and some of his body parts last night, hmm?”  “Bring the coffee. I’m ready to wake up. I’m not ready for that discussion yet .”  Rachel returned ,   and Roxana called her at the same time.  “Robin, you won’t believe what just happened !   I was the only one here, darn the  luck, and Shayne Wolf came by asking for information on a plot. He said he wanted to  plan   for his children. I told h im he had none. He looked at me   all   w eird ly   and said he  knew   because they all waited   in my belly to be born.   I was   astonish ed !   Then he asked me  for a   date,   and I didn’t want to do it, but he got my weakness.   So,   I’m going with him to  the high school footba ll game on Friday. Do I sound excited? Do I sound like a teenager?  I’m old enough to be his mother ,   and I’m going on a date with him? Do I need my head  examined? I’m too old for him ! ”  “Hey, Roxana. Take a breath, honey. Wow! That’s the reason for   excitemen t but  breathe every now and then. And don’t worry about being too old for him. You’re not  that old ,   and he’s not that young. And if people bother you, move to Seaford, Delaware.  Several older women marry younger men ,   and   wow,   they have fun.   That’s fantasti c  news!   I’m so happy for you, Roxana. I’ll come by later today and see you in person. Yes,  you can have me as a girlfriend. Yes. Bye.”  She disconnected, lay the phone in Rachel’s lap ,   and took the   perfect   coffee. She  sniffed it, smiled luxuriously, and sip ped it. “Perfect. And we have a perfect second step  complete. Roxana has a date for Friday night.   So n ow comes the   most   difficult part of  my offer of love and a trip to Baltimore Fertilization Clinic.”  Rachel rubbed her back and told her not to spill the c offee.   S he laughed as she  gripped her bra clasp, stretched it, and let it go to slap against her skin. She watched and  coaxed the hand that held the   hot liquid jerk and dance ,   but   it   maintain ed   perfect  balance and n ever   spill ed   as it had in the past.  “Exce llent, child. I’m getting better , y ou’re getting better , and y ou’ll have no  problem   with   the next phase of end ing   Roxana’s punishment. The full moon is two days  away,   on   Friday night, on Roxana’s first date in years. Are you ready?”  “Ready and fidgeting li ke my butt ’ s   wedged in   an anthill. You want to go with me  when I visit her?”  “ Yes,   to visiting both of our women, the live one and the dead one who still thinks  she’s alive.”  “Thanks, sweetie.”  “Mom called me today.”  “Whoa! I hope that’s a good sign.”  “It   was. She asked about how I was doing   and made some   pleasant   conversation.  Then she asked if I really   kissed your feet on the first day of every month   or was that a  rumor . I told her yes. Then she asked about you and how we were doing together. I told  her f ine and then had to stop   because of   crying. Damn, you’re awesome without   even  trying. Then I said goodbye to   grandfather just in case   it doesn’t end like we want it to  end.”  “That was good, sweetie. I think things will work out well. We’ll both go forth in  faith and shake up the world.   Would the world expect less from a Kirby Girl? ” ","# # # ","3 AUDIOBOOK COLLECTIONS 6 BOOK COLLECTIONS "]},"totalPage":82}